[
    {
        "text": "Depuis les années 70 l'usage des ordinateurs s'est répandu et particulièrement, à partir\ndes années 80, celui des micro-ordinateurs. Il était devenu courant qu'au sein d'une\nmême entreprise les bureaux et les ateliers soient équipés d'ordinateurs qui,\ncependant, sont utilisés de façon séparée. D'où :\n- une impossibilité de partager les ressources,\n- une sous utilisation des capacités de traitement,\n- une difficulté à faire communiquer différents intervenants dans une même\nentreprise.\nDevant cet état de fait, la solution a été de chercher à relier les ordinateurs par un\nréseau de transmission propre à l'entreprise.\nDéfinition d'un réseau local (LAN : \"Local Area Network\") : c'est un réseau\ninformatique privé reliant des équipements informatiques situés dans un même\nbâtiment ou dans des sites géographiquement proches (exemple : campus).",
        "metadata": {
            "topic": "II.. IInnttrroodduuccttiioonn",
            "subtopic": "II.. IInnttrroodduuccttiioonn"
        }
    },
    {
        "text": "Ce cours est une initiation à la technologie des réseaux locaux, en particulier, il s’agit\nde :\n- connaître les spécificités des réseaux locaux,\n- bien assimiler les techniques d'accès à un support de transmission partagé,\n- étudier l’architecture et la normalisation des réseaux locaux,\n- étudier l'interconnexion au niveau 2 et l'évolution des réseaux locaux vers des\nréseaux commutés,\n- se familiariser avec les composants matériels et le câblage des réseaux locaux\n- déployer un réseau IP et configurer les services de base et\n- acquérir une expérience pratique à travers des TPs ciblés.",
        "metadata": {
            "topic": "file1",
            "subtopic": "I.1 Présentation du cours"
        }
    },
    {
        "text": "",
        "metadata": {
            "topic": "file1",
            "subtopic": "I.2 Rappels"
        }
    },
    {
        "text": "Un réseau de communication est constitué d'un ensemble d'équipements ou nœuds\németteurs / récepteurs reliés par des liaisons de communication.\nUn réseau se caractérise par :\n1\n- la nature des nœuds sources / destinations (téléphone, télécopieurs, ordinateurs,\nterminaux, commutateurs, imprimantes,...) ;\n- la répartition géographique des nœuds à connecter (réseau interne à une machine,\nréseau local, régional, national ou international) ;\n- le caractère public ou privé ;\n- la topologie (réseau maillé, en boucle,...) ;\n- les supports de transmission (supports métalliques, fibres optiques, ondes\nradioélectriques,...) ;\n- les techniques et les protocoles de transmission ;\n- le débit de transmission ;\n...",
        "metadata": {
            "topic": "I.2 Rappels",
            "subtopic": "I.2.1 Caractéristiques des réseaux"
        }
    },
    {
        "text": "Suivant la taille géographique, on distingue 4 classes de réseaux :\ni) Les réseaux personnels (PAN : Personal Area Network) s'étendent sur quelques\nmètres. Ces réseaux sont utilisés pour assurer la connectivité entre les PC, les\ntéléphones portables, les imprimantes ainsi que d’autres terminaux… Les bus les\nplus couramment utilisés sont l'USB et le FireWire. Parmi les technologies sans fil\non peut citer le Bluetooth et l'infra rouge. Selon les réseaux et les versions de ces\nréseaux les débits peuvent varier de quelques Mb/s (USB 1.0) à quelques Gb/s\n(USB 3.0, FireWire 800).\nii) Les réseaux locaux (LAN : \"Local Area Network\") s'étendent jusqu'à quelques\nkilomètres et supportent des débits de l'ordre de 1 Mb/s et plus couramment\naujourd'hui ils atteignent des débits de 100 Mb/s et de 1 Gb/s. Parmi les réseaux\nlocaux, on distingue les réseaux départementaux (DAN : Departemental Area\nNetwork) et les réseaux d'établissement.\nUn réseau DAN, appelé aussi réseau capillaire, a pour objectif de relier les\néquipements d'un même département situé souvent dans un même étage.\nUn réseau d'établissement relie des réseaux DAN. Il peut être confiné dans un seul\nbâtiment (BAN : \"Building Area Network\") ou desservir plusieurs bâtiments\ngéographiquement très proches (CAN : \"Campus Area Network\").\nUn Réseau local d'Entreprise (RLE) est un réseau utilisée pour la bureautique. Un\nRéseau Local Industriels (RLI) est spécifique au monde industriel et pour lequel les\néquipements connectés peuvent être en plus des équipements informatiques, des\nrobots, des machines outils, des capteurs… Les contraintes dans un RLI sont plus\nsévères particulièrement en termes de disponibilité et de garanti de temps d'accès.\n2\niii) Les réseaux métropolitains (MAN : \"Metropolitan Area Network\"). Une extension\ndes réseaux locaux est celle où les bâtiments, d'une même entreprise, peuvent être\ndistants de plusieurs dizaines de kilomètres dans une même métropole (< 100 Km)\net reliés par un réseau haut débit dit réseau MAN. Pour un tel réseau, les\ncommunications distantes se font par l'intermédiaire d'une infrastructure publique\nde télécommunication (\"carrier\").\niv) Les réseaux étendus (WAN : \"Wide Area Network\")\n- à faible et moyen débit (< 100 Kb/s) : réseaux téléphoniques, réseaux télex,\nréseaux de transmission de données (X.25, réseaux constructeurs : SNA, DNA,...),\n- à haut débit (> 1 Mb/s) : réseaux satellites, réseaux câblo-opérateurs, RNIS ...).",
        "metadata": {
            "topic": "I.2 Rappels",
            "subtopic": "I.2.2 Classification des réseaux"
        }
    },
    {
        "text": "De part la définition d'un réseau local on peut dégager les caractéristiques suivantes :\ni) un étendu géographique limité ;\nii) le caractère privé à un organisme ou une entreprise ;\niii) la possibilité d'interconnecter des équipements variés provenant de différents\nconstructeurs (ordinateurs, terminaux, périphériques ...).\nDe plus, étant donné les contraintes d'utilisation, se rajoutent d'autres caractéristiques\nparmi lesquels on peut citer :\niv) un débit élevé supérieur au Mégabit par seconde ;\nv) un temps de réponse faible de l'ordre de la centaine de microseconde ;\nvi) un taux d'erreur faible (< 10-9) ;\nvii) une stabilité en pleine charge ;\nviii) la facilité d'extension, de reconfiguration et de maintenance.\nNotons que les réseaux locaux industriels sont utilisés pour interconnecter divers\néquipements de contrôle et de mesure, ils nécessitent des contraintes plus sévères\nquant à la fiabilité (tolérance aux pannes) et le comportement déterministe, en\nparticuliers, les temps de transmission doivent être bornés.\n3",
        "metadata": {
            "topic": "file1",
            "subtopic": "I.3 Spécificités d'un LAN"
        }
    },
    {
        "text": "Un réseau local se caractérise notamment par :\n- sa topologie,\n- le support de transmission,\n- le mode de transmission et\n- la méthode d'accès.",
        "metadata": {
            "topic": "IIII.. TTeecchhnnoollooggiiee ddeess rréésseeaauuxx llooccaauuxx",
            "subtopic": "IIII.. TTeecchhnnoollooggiiee ddeess rréésseeaauuxx llooccaauuxx"
        }
    },
    {
        "text": "La topologie d'un réseau décrit la configuration physique relative à l'interconnexion\ndes nœuds entre eux au moyen d'un support de transmission. Différentes topologies,\nillustrées par la figure 1, sont décrites dans ce qui suit. Notons que nous pouvons\ndistinguer deux types de liaison :\n- une liaison point à point où deux nœuds sont reliés par une voie de\ncommunication qui leur est réservée,\n- une liaison multipoint (à diffusion) où plusieurs nœuds partagent la même voie de\ncommunication.\nRemarque :\nLa mise en œuvre d’un réseau local se situe au niveau des couches physique et liaison\ndu modèle de référence. Indépendamment du type de liaisons utilisées (point-à-point\nou multipoint), un réseau local est généralement considéré comme une \"liaison\"\nmultipoint.",
        "metadata": {
            "topic": "file1",
            "subtopic": "II.1 Topologies des réseaux locaux"
        }
    },
    {
        "text": "La topologie en étoile est composée d'un nœud de commutation central auquel sont\nreliés, par des liaisons point à point, tous les autres nœuds. D’une manière générale, la\ncommutation est soit une commutation de circuits soit une commutation de\ntrames/paquets. Dans le cas des réseaux locaux, il s’agit d’une commutation de\ntrames.\nAvantages :\n- facilité de maintenance ;\n- facilité d'extension dans la limite du nombre de ports ;\n- la défaillance d'un nœud, autre que le nœud central, ne paralyse pas les\ncommunications sur le réseau ;\n- possibilité de réaliser plusieurs communications en parallèle (commutation) ;\n- possibilité de construire des commutateurs rapides, à haut débit avec un délai de\ntraversée de l’ordre de quelques dizaines de micro-secondes.\n4\nInconvénients :\n- le risque de surcharge du nœud central ;\n- la défaillance du nœud central paralyse toute communication à travers le réseau ;\n- l'extensibilité du réseau est limitée ; Afin de remédier à cette limite Une autre\nextension possible de la topologie en étoile est celle où plusieurs commutateurs\nsont reliés au moyen de répéteurs pour former un réseau dit en arbre.\n- la diffusion peut nécessiter des mécanismes / opérations particulières ;\n- longueur totale du câblage importante.",
        "metadata": {
            "topic": "II.1 Topologies des réseaux locaux",
            "subtopic": "II.1.1 Topologie en étoile"
        }
    },
    {
        "text": "Dans une topologie en anneau, les nœuds sont reliés entre eux par des liaisons point-\nà-point, l'ensemble forme une boucle. Les messages transitent de nœud en nœud\nsuivant un sens de rotation. Le câblage d'un réseau local en anneau est le plus souvent\nen étoile.\nAvantages :\n- simplicité de l'acheminement des messages ;\n- le signal reste toujours de bonne qualité car il est régénéré à chaque passage par\nun nœud ;\n- extension relativement facile ;\nInconvénients :\n- à défaut de mécanismes supplémentaires,\n~la défaillance d'un nœud ou d’une liaison paralyse le réseau ;\n~l’ajout ou la suppression d'un nœud nécessite l'interruption du fonctionnement\nnormal du réseau ;\n- coûteuse puisqu'il est nécessaire d'assurer la répétition du signal, la\nsynchronisation entre toute paire de voisin, la réduction des temps de latence sur\nchaque station intermédiaire ...",
        "metadata": {
            "topic": "II.1 Topologies des réseaux locaux",
            "subtopic": "II.1.2 Topologie en anneau"
        }
    },
    {
        "text": "Dans le cas d'une topologie en bus tous les nœuds sont raccordés à une même liaison\nphysique multipoint appelée bus. Dans le cas des réseaux locaux, le contrôle d'accès\nest soit centralisé au niveau d'un nœud maître, soit réparti à travers les différents\nnœuds. On distingue deux types de bus : unidirectionnel et bidirectionnel. Pour un\nbus unidirectionnel les signaux circulent suivant un sens bien déterminé, il est donc\nnécessaire d'utiliser 2 canaux (un par sens). Pour un bus bidirectionnel les signaux\npeuvent circuler dans les deux sens, l’accès est symétrique. Les bus peuvent être des\nstructures passives : ils ne possèdent pas de composants électroniques pour maintenir\nou re-générer le signal. Il est aussi possible d'étendre la longueur physique d'un bus\nau moyen de répéteurs.\n5\nDans le cas des réseaux locaux, la tendance a été de remplacer le bus par un nœud\ncentral appelé HUB. Ce dernier envoie un signal reçu à travers une entrée sur toutes\nles sorties. La topologie physique est ainsi ramenée à une étoile. Le fonctionnement\nreste comparable à celui d’un bus.\nAvantages :\n- facilité d’ajout ou de suppression d'un nœud ;\n- la défaillance d'un nœud n'a presque pas d'incidence sur le réseau (sauf s’il se met\nà émettre sans respecter les règles d’accès) ;\n- propriété de diffusion (suite à une même émission) ;\n- coût relativement faible (câblage).\nInconvénients :\n- une coupure du réseau divise le réseau en deux et rend le réseau non\nopérationnel ;\n- Le délai de propagation d’un signal sur le bus augmente avec la longueur du bus.\nAfin de d’augmenter les possibilités d’extension sans augmenter ce délai, il est\npossible de relier plusieurs bus au moyen de répéteurs suivant une structure\narborescente.\n- un seul nœud peut émettre à la fois (dans le cas d’une transmission symétrique).\nétoile anneau arbre\nRéseaux point-à-point\nbus satellite anneau\ns Réseaux à diffusion\nFigure 1 : les différentes topologies en point à point et en diffusion\n6",
        "metadata": {
            "topic": "II.1 Topologies des réseaux locaux",
            "subtopic": "II.1.3 Topologie en bus"
        }
    },
    {
        "text": "Il existe deux modes de fonctionnement dans le cas des réseaux locaux sans fils :\n- Le mode Ad-Hoc (IBSS: \"Independent Basic Service Sets\") : ce mode permet\nde connecter directement les ordinateurs (figure 2-a), sans recourir à un\néquipement tiers. Ce mode est approprié pour échanger des fichiers entre\nportables dans un lieu quelconque (café, train …). La mise en place d'un tel\nréseau se ramène à sélectionner un canal (fréquence) et un nom de réseau\n(SSID) communs à tous. Grâce à l'ajout d'un logiciel de routage dynamique\n(OLSR : \"Optimized Link State Routing\", AODV : \"Adhoc On Demand\nDistance Vector\" …), il est possible de créer des réseaux maillés autonomes\ndans lesquels la portée ne se limite pas aux voisins.\n- Le mode infrastructure (BSS: \"Basic Service Set\" ou ESS: \"Extended Service\nSet\") : ce mode de fonctionnement permet de connecter les ordinateurs entre\neux à travers un ou plusieurs équipements intermédiaires qui concentrent le\ntrafic et appelés Points d'Accès ou AP (figure 2-b). Ce mode est essentiellement\nutilisé comme extension de réseaux filaires. Les APs ainsi que les ordinateurs,\ndoivent être configurées avec le même nom de réseau afin de pouvoir\ncommuniquer. Il est donc possible de déterminer les nœuds connectés au\nréseau.\nFigure 2-a: Mode Ad-Hoc (IBSS)\nFigure 2-b : Mode Infrastructure (BSS+ESS)\n7\nAvantages :\n- la mobilité ;\n- la facilité d’ajout ou de suppression d'un nœud ;\n- la défaillance d'un nœud, mis à part l'AP en mode infrastructure, n'a presque pas\nd'incidence sur le réseau ;\nInconvénients :\n- en mode infrastructure, la défaillance d'un AP rend non opérationnelle la cellule\ncorrespondante ;\n- taux d'erreurs, sensibilité aux bruits et aux obstacles,\n- la diffusion ne permet pas de joindre forcement toutes les stations,\n- un seul nœud peut émettre à la fois (dans le cas d’un seul canal),\n- problèmes de sécurité : besoin de recourir à des techniques d’authentification et\nde cryptage ;",
        "metadata": {
            "topic": "II.1 Topologies des réseaux locaux",
            "subtopic": "II.1.4 Cas des réseaux locaux sans fils"
        }
    },
    {
        "text": "Du choix du support physique dépendent les performances du réseau notamment le\ndébit de transmission ainsi que la fiabilité du réseau. La plus part des réseaux locaux\nutilisent un signal électrique véhiculé sur des supports métalliques. On trouve aussi,\nde plus en plus, des réseaux à fibres optiques permettant des débits plus élevés et une\nmeilleure fiabilité. Par ailleurs, la transmission peut s’effectuer sans que les signaux\nne soient guidés par un support : onde radio électromagnétique, rayons infrarouges,\nrayons laser ...\nDans ce qui suit, sont décrits les supports utilisés à savoir les paires torsadées, les\ncâbles coaxiaux et la fibre optique ainsi que les bandes de fréquence utilisées. La\nfigure 3 représente une illustration de ces supports.",
        "metadata": {
            "topic": "file1",
            "subtopic": "II.2 Le support physique"
        }
    },
    {
        "text": "Le câble est constitué d'une ou plusieurs paires de fils de cuivre en spiral (en torsade).\nChaque fil est recouvert d'une gaine. Plusieurs paires peuvent être regroupées dans\nune même gaine.\nCaractéristiques :\n- se prête bien à une liaison point à point ;\n- s'utilise pour une transmission analogique ou numérique ;\n- affaiblissement des signaux important suivant la longueur ;\n- le débit dépend du type de la liaison et de la longueur. De l'ordre du Kb/s ou\nmoins pour une liaison multipoint ainsi que pour une liaison point à point d'une\nlongueur supérieure au kilomètre. De quelques centaines de Kb/s jusqu'à plusieurs\ndizaines de Mb/s (voire même 100 Mb/s ou 1 Gb/s) lorsque la longueur est de plus\nen plus courte ;\n8\n- sensible aux perturbations électromagnétiques et au problème de diaphonie. La\ndiaphonie se produit par la transmission d'un signal parasite d'une paire vers les\nautres paires d'un même câble. L'affaiblissement de ce signal (paradiaphonie)\ns'obtient par le torsadage et en réduisant la proximité des paires. En outre, pour\nréduire ces perturbations, les paires torsadées, d’un même câble, peuvent être\nentourées d'une tresse métallique, le câble est dit blindé ou d’une pellicule de\nblindage (une feuille d’aluminium), auquel cas, le câble est dit écranté. Cette\npellicule évite le couplage de rayonnements perturbateurs haute fréquence (actifs à\npartir de 25 Mhz environ). Si le blindage n'est pas correctement mise à la masse,\ndes courants parasites apparaissent et le support se comporte moins bien qu'une\npaire torsadée sans blindage (qui est de surcroît moins cher). Les organismes EIA\n(« Électronic Industries Association ») et TIA (« Telephone Industries\nAssociation ») ont élaboré une norme EIA/TIA-568 définissant les caractéristiques\nminimales de différentes catégories (3, 4, 5, 6, 7) de paires torsadées notamment en\nce qui concerne la bande passante et l’affaiblissement en fonction de l’impédance ;\nles paires torsadées de catégorie 5 sont les plus utilisées alors que les câbles\nblindés, introduits par IBM, n'ont pas eu un succès comparable.\n- simple à installer et coût relativement faible notamment dans le cas des câbles de\ncatégorie 3.\nUtilisation :\n- Topologies : étoile et anneau ;\n- les réseaux DAN (entre le répartiteur d'étage et les nœuds de l'étage).",
        "metadata": {
            "topic": "II.2 Le support physique",
            "subtopic": "II.2.1 Les paires torsadées"
        }
    },
    {
        "text": "Il est constitué d'un câble central entouré d'un isolant et d'une tresse métallique, le\ntout enveloppé par une gaine protectrice.\nCaractéristiques :\n- se prête bien à une liaison point à point ou multipoint ;\n- s'utilise pour une transmission analogique ou numérique ;\n- moins simple à installer que la paire torsadée ;\n- plus coûteux que la paire torsadée ;\n- on distingue, notamment, deux types de câbles coaxiaux :\n câble 50  utilisé en bande de base,\n câble 75  (ou CATV : \"Community Antenna TeleVision\"), utilisé en large\nbande\n- le débit dépend de la longueur du câble et de ses caractéristiques, il est de l'ordre\nde quelques Mb/s à plusieurs dizaines de Mb/s (sur une longueur de 1 Km ) voire\nmême 1 Gb/s ;\n9\nUtilisation :\n- topologies : bus, anneau, arbre ;\n- tendance à le remplacer par la paire torsadée au niveau des réseaux DAN, et par\nla fibre optique pour le reste du câblage.",
        "metadata": {
            "topic": "II.2 Le support physique",
            "subtopic": "II.2.2 Le câble coaxial"
        }
    },
    {
        "text": "Une fibre optique se compose d'un noyau entouré d'une gaine. Le noyau est un guide\ncylindrique optique ayant un fort indice de réfraction dans lequel se propagent des\nfaisceaux lumineux (ondes optiques). La gaine confine les ondes optiques. Le tout est\nrecouvert par une ou plusieurs enveloppes de protection. Un câble en fibre optique\ncomporte généralement plusieurs brins regroupés par multiple de 2, 6, 8 …\nAux extrémités d’un câble se trouve l’émetteur et le récepteur. L'émetteur est\ncomposé d'un codeur et d'une Diode Electro Luminescente (DEL) ou d'une Diode\nLaser (DL) ou encore d'un laser modulé. Le récepteur est constitué d'un décodeur et\nd'un détecteur de lumière (photodétecteur). Le rayon laser a pour avantages d'être une\nlumière intense, monochromatique, stable en amplitude et en fréquence, avec un\nphénomène de dispersion faible. Les diodes laser sont plus chères et durent moins.\nOn distingue deux types de fibres optiques :\n- la fibre monomode : un seul angle d'incidence, diamètre de quelques microns,\nvitesse de propagation de l'ordre de 0,25 millions de kilomètre par seconde, bande\npassante jusqu'à 100 Ghz/Km voire même plusieurs milliers de Ghz/Km ;\n- la fibre multimode : plusieurs angles d'incidence, diamètre de quelques centaines\nde microns, vitesse de propagation de l'ordre de 0,1 millions de kilomètre par\nseconde, moins chère. Parmi les fibres multimode on distingue :\n la fibre multimode à saut d'indice dont le noyau a un seul indice de\nréfraction, bande passante allant jusq’à 50 Mhz/Km ;\n la fibre multimode à gradient d'indice dont le noyau a un indice de\nréfraction qui diminue progressivement en s’éloignant de l’axe, bande\npassante allant jusqu’à 1 Ghz, vitesse propagation plus importante que celle\npour la fibre à saut d’indice. La fibre optique multimodes à gradient d'indice\nsemble être la meilleure solution pour les rocades et les distances\nsupérieures à 100m. Elle est déjà largement utilisée pour fédérer les\nréseaux.\n- bien que la largeur de la bande passante que peut atteindre un support en fibre\noptique est énorme, le débit est limité actuellement à quelques Gb/s, ceci est du à\nl'impossibilité d'effectuer des conversions entre les signaux électriques et les\nsignaux optiques plus rapidement.\n10\nCaractéristiques :\n- s’utilise pour une liaison point à point, cependant il est délicat de l'utiliser pour\nune liaison multipoint à cause des difficultés de dérivation ;\n- le plus difficile à installer (raccordement, dérivation,...) ;\n- le plus coûteux ;\n- bande passante et débit important ;\n- pas de diaphonie, insensible aux perturbations électromagnétiques, faible\natténuation, résistance à la chaleur, au froid et à l'humidité ;\n- encombrement et poids inférieurs aux autres supports (<1/10).\nUtilisation :\n- topologies anneau, étoile\n- tendance à utiliser la fibre optique multimode particulièrement dans les réseaux\nd’établissement.",
        "metadata": {
            "topic": "II.2 Le support physique",
            "subtopic": "II.2.3 La fibre optique"
        }
    },
    {
        "text": "Les réseaux locaux sans fils utilisent des ondes radio ou infrarouges.\nParticulièrement, ils utilisent les bandes de fréquence (dans la gamme des micro\nondes) sans licence suivantes:\n• ISM \"Industrial Scientific and Medical\" : 3 sous-bandes cédées en 1985 par\nl’armée US,\n• U-NII \"Unlicensed-National Information Infrastructure\".\nPlusieurs techniques de transmission ont été définies afin de limiter les problèmes\ndus aux interférences et afin d'augmenter le débit (cf. §II.3).\nCaractéristiques :\n- Plus la puissance d’émission est élevée, meilleure est la couverture, mais la\nconsommation d’énergie est plus grande.\n- Plus la fréquence radio est élevée, meilleur est le débit, mais la couverture est\nmoins bonne.\n- Plus le débit est élevé, plus la couverture radio est faible.\n- Les signaux se comportent différemment dans l’environnement selon leur\nfréquence ; dans la gamme des micro-ondes :\n• les gouttes de pluie atténuent davantage les signaux à haute fréquence,\n• les micro-ondes sont en partie réfléchies par la plupart des objets. Un signal\npeut être réfléchi plusieurs fois, le récepteur capte donc plusieurs signaux avec\nde légers décalages de temps,\n• au-delà de 5 GHz (le haut du spectre des micro-ondes), les ondes ne pénètrent\nquasiment plus les objets. L’émetteur et le récepteur doivent être en vue directe\nsans obstacle « clear line of sight ».\n11\nPaires torsadées\nCat. 3 Cat. 5 Cat.5 Cat. 6 Cat. 7\nClasse Classe E Classe Classe Structure Autre\nC D E F\ndénomination\nBande 16 100 100 200 600 U / UTP\nPass. MHz MHz MHz MHz MHz\nU / FTP\nType UTP UTP/ UTP/ UTP/ SSTP\nFTP FTP FTP F / UTP\nCoût 0.7 1 1.2 1.5 2.2 SF / UTP (de Cat5e)\nou S / FTP (de cat6 ou +)\nFibres optiques\nBandes de fréquences\nVHF\nFigure 3 : les différents supports de transmission\n12",
        "metadata": {
            "topic": "II.2 Le support physique",
            "subtopic": "II.2.4 La transmission sans fils"
        }
    },
    {
        "text": "Le raccordement se fait grâce à un coupleur (carte réseau) dont la fonction est\nd'assurer l'accès au support de transmission. Le raccordement est décrit par la figure\n4. A noter que l’adaptateur peut être intégré au coupleur.\nle support physique : câble.....................\nla prise (tap) : connexion mécanique............\nl'adaptateur : modem, transceiver (codage,...)..\nle coupleur : contrôle d'accès ................\nl'interface : entre l'équipement et le coupleur.\nDessin réalisé par Robert M. Metcalfe pour présenter le concept Ethernet en 1976\nFigure 4 : raccordement d’une station",
        "metadata": {
            "topic": "II.2 Le support physique",
            "subtopic": "II.2.5 Le raccordement à un câble"
        }
    },
    {
        "text": "Les deux modes, en bande de base et large bande, sont utilisés. Rappelons que pour la\ntransmission en bande de base, l'information est directement traduite par des\nchangements discrets du signal et suivant un codage donné (exemple : code\nManchester, le code Manchester différentiel, en bloc 4B/5B, 8B/10 …). Ces codes\nincluent le signal d'horloge. Pour la transmission en large bande, le signal numérique\nest modulé sur une onde porteuse (variation de la fréquence, de l'amplitude et / ou de\nla phase).\nLes systèmes en bande de base sont plus simples à mettre en œuvre et moins coûteux.\nBien que suivant ce mode de transmission le signal tend à s'affaiblir rapidement avec\nla distance, l'utilisation de répéteurs permet de remédier à ce problème. Pour ces\nraisons, la transmission en bande de base est la plus utilisée dans le cas des réseaux\nlocaux filaires. En revanche, les réseaux locaux sans fils font appel à une transmission\npar modulation. Des techniques d'étalement de fréquences sont utilisées dans les\nréseaux WiFi :\n13\n- La technique d'étalement de spectre par saut de fréquence (FHSS \"Frequency\nHopping Spread Spectrum\") consiste à découper une large bande de fréquence\nen canaux, puis de transmettre en utilisant une séquence aléatoire de canaux\nconnue de toutes les stations d’une même cellule (suivant la norme 802.11, la\nbande de fréquence est 2.4-2.483 qui permet de créer 79 canaux de 1 MHz,\nbande ISM). La transmission s’effectue successivement sur un canal puis sur un\nautre (à chaque fois pendant une courte période, environ 300 ms) afin réduire\nles interférences entre les transmissions des diverses stations. Il est possible de\nfaire fonctionner 26 réseaux dans une même zone. Le débit est limité à 2 Mb/s.\n- La technique d’étalement de spectre à séquence directe (DSSS \"Direct\nSequence Spread Spectrum\") utilise la bande ISM de 83.5 Mhz, elle est divisée\nen 14 (Europe) canaux de 20 MHz qui se recouvrent. Pour permettre à\nplusieurs réseaux de couvrir une même zone, il faut allouer à chacun d'eux des\ncanaux qui ne se recouvrent pas (donc au maximum 3 réseaux). Puisque\ncertains canaux se recouvrent partiellement, des canaux isolés (les canaux 1, 6\net 11) distants les uns des autres de 25MHz sont généralement utilisés. En outre,\npour éviter toute interférence il est recommandé d'organiser la répartition des\npoints d'accès et l'utilisation des canaux de telle sorte que deux points d'accès\nutilisant les mêmes canaux ne se recoupent pas. En comparaison avec à la\ntechnique FSSS, la technique DSSS permet d’augmenter le débit cependant elle\nest sensible aux interférences. Pour remédier à ce problème, la technique de\n« chipping » est utilisée, un bit est représenté par une séquence dite Barker de\n11 bits. Cette séquence redondante permet d'effectuer des contrôles (et même de\ncorrection) d'erreurs. Différents débits sont possibles : 1Mb/s (code Barker,\nmodulation de phase DPSK \" Binary Phase Shift Keying\"), 2 Mb/s (code\nBarker, modulation QPSK pour Quadrature PSK), 5,5 et 11 Mb/s (une méthode\nalternative appelée CCK \"Complementary Code Keying\" permet d'encoder\ndirectement plusieurs bits de données en une seule puce en utilisant des\nséquences de 8 signaux. Ainsi en codant simultanément 4 bits, la méthode CCK\npermet d'obtenir un débit de 5.5 Mbps et elle permet d'obtenir un débit de 11\nMbps en codant 8 bits de données).\n- La technique OFDM (Orthogonal Frequency Division Multiplexing) utilise un\ngrand nombre de canaux distincts dans la bande de fréquence des 5 GHz (bande\nU-NII). Elle permet d'obtenir un débit théorique de 54 Mbps en envoyant les\ndonnées en parallèle sur les différentes fréquences.",
        "metadata": {
            "topic": "file1",
            "subtopic": "II.3 Le mode de transmission"
        }
    },
    {
        "text": "Comme pour tout système où l'on veut partager une ressource, dans un réseau local, il\nest nécessaire de mettre en œuvre un protocole (ou méthode) d'accès au support\n14\nphysique de transmission. Le partage d’un canal de communication peut s’effectuer\nsuivants différents critères.\nClassification 1 :\n- accès aléatoire (par contention), ne nécessite pas une autorisation préalable,\n- accès déterministe où un mécanisme permet de désigner la station (primaire)\nqui peut émettre.\nClassification 2 :\n- accès statique où l'allocation de la bande passante est définitive,\n- accès dynamique (adaptatif) où l'allocation de la bande passante évolue selon\nles besoins.\nClassification 3 :\n- l'approche centralisée où seul un nœud primaire attribue des droits d'accès,\n- l'approche distribuée où les différents nœuds participent de la même façon\naux contrôles d'accès.\nClassification 4 :\n- partage temporel (TDMA : \"Time Division Multiple Access\"),\n- partage fréquentiel (FDMA : \"Frequency Division Multiple Access\").",
        "metadata": {
            "topic": "file1",
            "subtopic": "II.4 Les protocoles d'accès"
        }
    },
    {
        "text": "Les nœuds du réseau sont interrogés successivement (suivant un certain ordre) pour\ndéterminer à chaque fois si le nœud interrogé a un message à émettre. Pour cela une\ninvitation à émettre est issue d'un nœud primaire, si le nœud secondaire ayant reçu\ncette invitation veut émettre, il répond positivement à cette invitation.\nUtilisation : cette technique est utilisée dans le cas de liaisons longues distances, elle\nest aussi utilisée dans des réseaux de terminaux en bus. Par ailleurs elle a été retenue\ndans le cas des réseaux locaux Ethernet 100VG Any LAN. Appelée méthode PCF\n« Point Coordination Function », elle est aussi prévue dans les réseaux locaux sans fil\nWiFi, en mode infrastructure, pour des applications temps réels. Elle n’est pas la\nméthode d’accès généralement utilisée par les réseaux WiFi (elle n’est pas\nsystématiquement implémentée). La méthode PCF assure un service sans contention\ndurant des périodes obtenues grâce à une méthode avec contention (DCF–\n« Distributed Coordination Function »), cf. II.4.4.",
        "metadata": {
            "topic": "II.4 Les protocoles d'accès",
            "subtopic": "II.4.1 Accès par invitation à émettre (\"polling\")"
        }
    },
    {
        "text": "Le principe du contrôle d'accès à l'aide d'un jeton consiste à faire circuler sur le\nréseau une permission d'émettre, appelée jeton (\"token\"), de sorte que seul le nœud\nqui détient le jeton a l'autorisation d'émettre un message. Le jeton peut être dans l'un\ndes deux états : libre ou occupé. Pour qu'un nœud puisse émettre un message, il doit\nattendre que le jeton lui parvienne à l'état libre, auquel cas, le jeton est positionné à\n15\nl'état occupé, le nœud est en mesure d’entamé son émission. Les autres nœuds voient\npasser le message, le destinataire doit se reconnaître et recopier le message. Dans le\ncas d’une topologie en anneau, c'est l'émetteur du message qui prélève ce dernier et\nensuite passe le jeton libre.\nSuivant ce principe, plusieurs techniques à jeton existent. Elles diffèrent en particulier\nselon :\n- le choix du prochain nœud qui aura la possibilité de détenir le jeton. Soit que la\ncirculation du jeton se fait suivant l'ordre des nœuds dans un anneau physique\n(jeton non adressé), soit que le jeton est adressé à nœud spécifique suivant un\nanneau logique (particulièrement appliqué dans le cas d'une topologie en bus) ;\n- l'instant de renvoi du jeton libre. Pour une topologie en anneau, ceci peut se faire\nlorsqu’une station, ayant émis une trame, reçoit cette trame (possibilité d’effectuer\ndes vérifications) ou dès la réception de l'en-tête de la trame ou encore dès la fin de\nl'émission de la trame. Cette dernière solution permet de mieux utiliser la bande\npassante en ayant plusieurs trames de données, issues de différents nœuds, qui\ncirculent en même temps sur le réseau. Il faudra alors réduire le retard induit par la\ngestion du jeton au niveau des coupleurs (reconnaissance, prélèvement, insertion)\npour que réellement en puisse améliorer l'utilisation de la bande passante ;\n- la gestion des priorités.\nL'utilisation du jeton nécessite un mécanisme pour garantir la présence et l'unicité du\njeton. Dans une première approche centralisée, un nœud de supervision (moniteur) est\nutilisé à cet effet. En cas de défaillance, le moniteur peut changer de nœud. Un délai\nde garde est défini au bout duquel, si le jeton ne repasse pas par le moniteur, le réseau\nest purgé et le jeton est re-généré par le moniteur.\nDans une seconde approche distribuée, chaque coupleur maintient un temporisateur\nayant une valeur propre. Si le délai de garde d'un coupleur s'écoule sans qu'aucun\nmessage ne passe, le coupleur re-génère le jeton. Il faut aussi prévoir des mécanismes\nsupplémentaires pour éviter que deux jetons ne soient re-générés. Ceci est aussi\nnécessaire dans le cas général car une séquence quelconque de bits peut se\ntransformer en un deuxième jeton.\nLes techniques de contrôle d'accès utilisant un jeton permettent de garantir une borne\nsupérieure du temps d'accès au support physique. Cette borne peut être calculée en\nfonction notamment de la quantité maximale d'informations qu'il est possible\nd'émettre à chaque passage du jeton et le nombre de nœuds connectés au réseau.\nUtilisation : le contrôle d'accès à l'aide d'un jeton est la méthode privilégiée des\nréseaux en anneau, elle est aussi utilisée pour la topologie en bus.\nDans ce qui suit, en se référant à d’anciennes normes utilisant la méthode des jetons,\nnous illustrons davantage le fonctionnement de telles méthodes\n16",
        "metadata": {
            "topic": "II.4 Les protocoles d'accès",
            "subtopic": "II.4.2 Les techniques à jeton"
        }
    },
    {
        "text": "Principales règles de fonctionnement (inspiré du \"token-ring »/IEEE802.5) :\n- Disposant du jeton il est possible d’émettre plusieurs trames de suite, un\ntemporisateur (THT : « Token Holding Timer ») contrôle le temps maximum de\ndétention du jeton (par défaut 10 ms).\n- Retrait d'une trame par son émetteur.\n- La libération du jeton se fait dès la réception de l’en-tête de la première trame.\n- Le jeton est libéré lorsque l'entête de la trame revient à l'émetteur.\n- Utilisation d'un mécanisme de priorité (description simplifiée)\n A chaque message MI est associée une priorité I (8 niveaux sont définis). Sur\nchaque nœud le message le plus prioritaire est noté M S. Au jeton est associée\nune priorité courante P et une priorité R de réservation. P et R sont initialisées à\nla priorité la plus basse 0.\n Un jeton libre ne peut être pris par un nœud que si S  P (S relative à ce\nnœud). Si en plus, P < S alors S est affectée à P et R est mise à 0.\n Un nœud par lequel passe le jeton occupé ou de priorité P > S (S relative à ce\nnœud), met à jour R par la valeur de Max (R,S).\n Le jeton est libéré au retour et lorsque le nœud qui le détient ne dispose plus\nde message de priorité supérieure ou égale à Max (P,R) ou aussi lorsque le\nTHT a expiré, R est mis à jour à Max(R,S). Lors de la libération du jeton, si\nR>P, la valeur de R est affectée à P et R est mise à 0.\n Tout nœud ayant augmenté la valeur de P devient une station de stockage et\nmémorise l'ancienne valeur de P dans une pile Sr et la nouvelle valeur de P\ndans une autre pile Sx. Lorsque le jeton lui revient libre, ou vient d’être libéré,\navec la même nouvelle valeur (de Sx), si la valeur de R (ayant été mise à jour\nlocalement par Max(R,S)) est inférieure à l'ancienne valeur de P, tête de Sr,\ncelle ci est dépilée et affectée à P (la tête de Sx est aussi dépilée) et R reste tel\nqu'il est. Sinon la valeur de R est affectée à P, cette même valeur devient la\nnouvelle tête de la deuxième pile et R est mise à 0.\n- Une station est désignée comme étant le moniteur, elle surveille le\nfonctionnement du réseau, exemples :\n Le jeton libre fait plus d'un tour sans que la priorité ne redescende alors le\nmoniteur purge l'anneau (trame PRG) et le jeton, est regénéré.\n Une trame de données ayant fait plus d'un tour est éliminée par le moniteur.\n Si aucune trame ne passe par le moniteur, au bout d'une certaine\ntemporisation l'anneau est purgé et le jeton est re-généré.\nLa surveillance de la présence du moniteur se fait grâce aux trames AMP\n(\"Active Monitor Present\") envoyés par le moniteur et surveillé par les autres\n17\nstations. L’élection du moniteur se fait de la façon suivante : une station ne\nrecevant pas de trame AMP pendant un certain temps émet une trame CT ; une\nstation recevant un CT le ré-émet si l’adresse de l’émetteur est plus grande que\nla sienne, sinon elle émet un CT ; au final, la station ayant la plus grande adresse\nMAC devient le moniteur.\nL’insertion d’une station dans l’anneau se fait comme suit : la station émet des\ntrames LMT (\"Lobe Media Test\") ; la station teste si elle est la première pour\ndevenir le moniteur, si un moniteur est présent (AMP, PRG), la station émet une\ntrame DAT (\"Duplicate Address Test\") ; si en retour les bits A et C sont non\npositionnés la station s’insère, sinon la station se retire. Si aucun moniteur n’est\ndétecté, la station émet une trame CT, si en retour les bits A et C sont non\npositionnés la station devient le moniteur.\n- chaque station dispose d’un message à émettre en fonction duquel S est positionné :\n sur la station 1, S = 2\n sur la station 2, S = 4\n sur la station 3, S = 6\n- notation : jeton = <état (0 : libre/1 : occupé) ; P ; R>\n- le THT n’est pas pris en compte\n2\n1 3\nValeur du jeton à l’arrivée sur la station\nStation 1 Station 2 Station 3\n<0 ; 0 ; 0> empile 0 et P à 2 <1 ; 2 ; 0> <1 ; 2 ; 4>\n<1 ; 2 ; 6> empile 2 et P à 6 <0 ; 6 ; 0> <0 ; 6 ; 4>\n<1 ; 6 ; 4> <1 ; 6 ; 4> <1 ; 6 ; 4>\n<0 ; 6 ; 4> tête(pile)< 4 et P à 4 <0 ; 4 ; 0> <1 ; 4 ; 0>\n<1 ; 4 ; 0> <1 ; 4 ; 0> <0 ; 4 ; 0>\n<0 ; 4 ; 0> dépile 2 et P à 2 <0 ; 2 ; 0> <0 ; 2 ; 0>\n<0 ; 2 ; 0> dépile 0 et P à 0 <0 ; 0 ; 0>\nFigure 5 : exemple de fonctionnement de la méthode d’accès du jeton sur anneau\n- Exemple : voir la figure 5.",
        "metadata": {
            "topic": "II.4.2 Les techniques à jeton",
            "subtopic": "II.4.2.1 Cas du jeton sur anneau"
        }
    },
    {
        "text": "Principales règles de fonctionnement (\"token-bus »/IEEE802.4) :\n- Chaque nœud maintient les adresses du prédécesseur et du successeur suivant un\nordre décroissant (sauf entre deux nœuds) pour former un anneau logique.\n- L’émetteur d’une trame a la possibilité de solliciter une réponse, auquel cas, le\ndestinataire n’a pas besoin du jeton pour envoyer sa réponse.\n- Lorsqu'un nœud passe le jeton, il reste à l'écoute pour vérifier que le nœud\nsuccesseur envoie une trame (de données ou le jeton). Dans le cas négatif et après\n18\nun certain nombre de tentatives un nouveau successeur est élu. Dans une première\nphase, une requête est diffusée sur le réseau pour déterminer le successeur de\nl’ancien successeur ; si cette requête échoue un algorithme de résolution en arbre\nquaternaire est utilisé pour déterminer le nouveau successeur (l’adresse est de 48\nbits, la profondeur de l’arbre est 24).\n- De plus, pour prévenir la perte d'un jeton, chaque station maintient un\ntemporisateur et au bout d'un délai de garde décrète que le jeton est perdu. Un\nalgorithme pour désigner quel nœud doit re-générer le jeton (en fonction des\nadresses) est mis en place.\n- ayant le jeton, un nœud teste périodiquement (tous les P passages du jeton, 16  P\n 255) s’il existe un nouveau nœud qui veut s’insérer dans l'anneau et devenir le\nsuccesseur du nœud qui dispose du jeton. Si plusieurs nœuds veulent s’insérer un\nalgorithme de résolution en arbre quaternaire est utilisé. L’insertion du nouveau\nnœud n’est effectuée que si le temps de rotation du jeton reste en dessous d’un\ntemps de rotation cible. La station qui dispose du jeton invite à l’insertion en\nenvoyant un sollicit-successor-1 (pour les adresses inférieures à la sienne, sinon\nsollicit-successor-2). Si pas de réponse la station passe le jeton. Si une seule\nréponse, alors insertion de la station. Si plusieurs réponses alors la station qui\ndispose du jeton envoi un resolve-contention. Une station qui veut s’insérer répond\nalors dans la Kème fenêtre, K est déterminé en fonction de l’adresse. Toutefois si le\ncanal est détecté occupé avant la Kème fenêtre la station se retire (figure 6).\n1 2 3 4 K 1 2 3 4\nK=1\n11 10 01 00 Stations\nA 10 00 11 10\n1 2 3 4 A B D E\nC B 10 10 01 11\n11 10 01 00 Terminent\n2 11 10 01 0 n 0 t C 10 10 01 01\nB C A D 01 10 01 11\nTermine\n3 11 10 01 00 E 00 10 11 00\nB C\n4 11 10 01 00\nTermine\nB C\nFigure 6 : Résolution de contention\n- un mécanisme optionnel de priorité est mis en œuvre. S'il n'est pas utilisé, un\nnœud ne peut détenir le jeton au-delà d'une certaine période (fixée lors de la\nconfiguration). Autrement, à un message est associée une priorité. Quatre\npriorités sont définies. A chaque priorité I est associée un objectif de temps de\n19\nrotation du jeton OTR . Plus la priorité I est haute plus OTR est grand. Sur",
        "metadata": {
            "topic": "II.4.2 Les techniques à jeton",
            "subtopic": "II.4.2.2 Cas du jeton sur bus"
        }
    },
    {
        "text": "chaque nœud et pour chaque ordre de priorité I (à partir de la plus haute),\nlorsque le jeton revient, après un temps TR, les messages sont émis dans la\nlimite du temps qui reste. La plus haute priorité 6 est utilisée pour le trafic\ntemps réel qui garantit un temps d’accès inférieur N*OTR , N est le nombre de\n6\nstations.\n- Exemple : voir la figure 7.\nOTR = 100 - Temps de passage d’un jeton = 1\n6\nOTR = 80 - Initialement le jeton arrive à la station 3 où TR=4 ; le jeton ayant\n4\nOTR = 40 effectué un tour complet sans qu’aucun message ne soit émis\n2\nOTR = 20 - Notation : m durée de transmission\n0 priorité\nItération 1 2 3 4\nm40\nMessages à 2*m8 m10 m10 4\n6 4 4 m20 m20\némettre 4 4\nm10\n4\nTR 4 72 24 14 22 54 34\n2* m8 m10 m 4 40 m 4 20\nMessages 6 4 m10\n4\némis\nStation 3 Station 0\nm2 m10 m10 m10\n2 0 0 0\n20 56 34 4\n22 54 34 4\nm2, m 0 10\n2\nStation 1\nStation 2\nFigure 7 : exemple simplifié du fonctionnement de la méthode d’accès IEEE 802.4",
        "metadata": {
            "topic": "file1",
            "subtopic": "I I"
        }
    },
    {
        "text": "\"slotted ring\")\nCette technique a été élaborée pour un réseau en anneau. Le principe de cette\ntechnique consiste à faire tourner sur l'anneau un ensemble de trames ayant une taille\nfixe que l'on peut considérer comme des wagons ou encore des tranches de temps\n(vides ou pleines). Un nœud désirant émettre un message doit attendre le passage d'un\nwagon libre. Le message initial est découpé si nécessaire suivant la taille des wagons.\nLorsqu'un coupleur voit passer un wagon transportant des données qui lui sont\ndestinées, soit qu’il prélève ces données et libère le wagon, soit qu’il les copie et c'est\n20\nl'émetteur qui libère le wagon (acquittement). En cas de défaillance, ceci peut se faire\naussi par un nœud de contrôle. Si aucun mécanisme pour éviter la famine n'est mise\nen œuvre, le temps de réponse n'est pas borné.\nLa réalisation de cette technique est faite au niveau des coupleurs et en utilisant une\ntechnologie rapide pour pouvoir atteindre les débits escomptés (50 Mb/s). La taille\ndes wagons est de quelques dizaines d’octets.",
        "metadata": {
            "topic": "II.4 Les protocoles d'accès",
            "subtopic": "II.4.3 Technique de la tranche vide ou anneau en tranches (\"empty slot\" ou"
        }
    },
    {
        "text": "",
        "metadata": {
            "topic": "II.4 Les protocoles d'accès",
            "subtopic": "II.4.4 Les techniques à accès aléatoire"
        }
    },
    {
        "text": "La première technique, appelée ALOHA, à accès aléatoire a été développée pour un\nréseau à diffusion reliant les îles d'Hawaï. Le principe de l'accès aléatoire est le\nsuivant. Tous les nœuds communiquent à travers une liaison multipoint. Le nombre\nde nœuds n’est pas limité. Lorsqu'un nœud a un message à émettre, il transmet le\nmessage. Les émissions de deux ou plusieurs messages risquent de se superposer. On\ndit alors qu'il y a eu collision entre ces messages. Le signal résultant sur le support est\nnon interprétable et les messages en collision sont perdus. Ils doivent par la suite être\nretransmis.\nL'accès aléatoire est ainsi décentralisé et n'impose pas une synchronisation préalable à\nune émission. Cependant les collisions ont pour conséquence une perte dans la bande\npassante d'autant plus importante que le nombre de nœuds augmente.\nUne amélioration de l'ALOHA est l'ALOHA en tranches où le temps est subdivisé en\ndes intervalles (tranches) correspondant à la transmission de morceaux de messages\nde tailles égales. Une émission n'est autorisée qu'en début de tranches. Ainsi\nlorsqu'une collision a lieu, elle est limitée à une tranche et si une partie d'un message\na été correctement transmise, elle le sera durant le reste des tranches suivantes. On\narrive ainsi à doubler le débit, mais cette technique est coûteuse à mettre en œuvre\nétant donné que les communications doivent être synchronisées.\nUn nœud qui vient d'émettre un message, probablement va le faire suivre par une\nsuite d'autres messages. Partant de cette constatation, une autre amélioration de\nl'ALOHA est la réservation de tranches de temps. L'idée a été alors de réunir les\ntranches en des trames d'une longueur supérieure au temps d'allée-retour. Ainsi\nchaque nœud peut savoir au début d'une tranche ce qui s'est passé dans la même\ntranche de la trame précédente. Si une tranche est libre ou en collision, la tranche\ncorrespondante est libre d'accès dans la trame suivante. Sinon, si un nœud réussit une\ntransmission dans cette tranche, la tranche correspondante dans la trame suivante lui\nest réservée. Grâce à cette technique on peut arriver à un taux d'utilisation de la bande\npassante proche de 1.\n21",
        "metadata": {
            "topic": "II.4.4 Les techniques à accès aléatoire",
            "subtopic": "II.4.4.1 ALOHA"
        }
    },
    {
        "text": "Dans le cas des LAN, on utilise aussi l'accès aléatoire mais d'autres techniques plus\nappropriées ont été élaborées. En effet le délai de propagation d'un signal est très\nfaible et par conséquent un nœud écoutant le canal peut déterminer rapidement l'état\ndu canal. Ces techniques sont dites à accès aléatoire avec écoute de la porteuse\n(CSMA : \"Carrier Sense Multiple Access\"). Avant d'émettre un message, un nœud\ndoit se mettre à l'écoute du canal et ne transmettre que s’'il ne détecte pas un signal\nsur la ligne. Ceci n'élimine pas la possibilité de collision étant donné le délai de\npropagation (figure 8). On définit la période de vulnérabilité comme étant le temps de\npropagation d'un signal entre les nœuds les plus éloignés. Durant cette période un\ncoupleur peut ne pas détecter l'émission d'un signal par un autre nœud. De\nnombreuses variantes utilisant la méthode CSMA ont été proposées.\nCSMA persistant :\nLorsque le canal est occupé, un coupleur désirant émettre un message poursuit\nl'écoute du canal jusqu'à ce qu'il soit libre et émet ensuite son message. Si une\ncollision se produit, les stations attendent un temps aléatoire avant de retransmettre.\nCSMA non persistant :\nLorsque le canal est occupé, un coupleur désirant émettre un message reprend l'écoute\ndu canal après un temps aléatoire (cette procédure est réitérée jusqu'à ce que le canal\nsoit libre).\nCSMA P-persistant :\nLe temps est divisé en slots, comme \" Aloha discrétisé \". Si un coupleur veut émettre,\nil écoute pour savoir si le réseau est occupé. Si le réseau est libre (sinon il passe au\nslot suivant), il émet avec une probabilité p, et reporte l’émission au slot suivant avec\nune probabilité 1 – p. Le processus continue jusqu’à ce que la trame soit émise. A la\nsuite d’une collision il génère un temps aléatoire.\nCSMA/CD (Collision Détection) :\nA l'écoute du canal avant l'émission se rajoute l'écoute pendant l'émission pour\ndéterminer s'il y a eu collision. Pour cela le signal émis est comparé au signal sur la\nligne. Si une collision s'est produite, le coupleur abandonne l'émission et envoie une\nséquence de bits, appelée séquence de brouillage, pour faire persister la collision et\nassurer que les autres coupleurs se sont rendu compte de la collision. L'émission sera\nreprise après un temps aléatoire. L'émetteur devra rester à l'écoute du canal pendant\nune période (tranche canal) égale à deux fois le temps maximum de propagation d'un\nsignal entre deux coupleurs. Au-delà de cette période, l'émetteur est sure qu'il n'a pas\nsubi de collision et qu'il n'en subira pas.\nContrairement aux méthodes précédentes l’émetteur s'assure du bon déroulement de\nl'émission sans attendre un acquittement mais par détection ou non, de collision.\n22\nL'avantage est de pouvoir abandonner l'émission dès qu'une collision est détectée et\nde ne pas attendre d’acquittement.\nA C\nBits en collision\nBits erronés\ntemps\nFigure 8 : collision entre deux émissions\n23\nQuelques applications numériques : méthode d'accès CSMA/CD, taille minimale\nd'une trame 512 bits\n- pour un support métallique, débit du câble = 10 Mb/s, vitesse propagation =\n200.000 Km/s\n la tranche canal  51,2 µs.\n la longueur d'un segment  (51,2*10-6*2*108)/2=5,12 Km\n- pour une fibre multimode, débit du câble = 10 Mb/s, la vitesse propagation =\n100000 Km/s\n la longueur d'un segment  2,5 Km\n- pour une fibre monomode, débit du câble = 10 Mb/s , la vitesse propagation =\n250 000 Km/s\n la longueur d'un segment  6 Km\n- on veut maintenant réaliser un réseau avec un débit = 100 Mb/s et en utilisant la\nfibre monomode\n la tranche canal  5,12 µs.\n la longueur d'un segment  600 m\n moins de nœuds\nCSMA/CA (Collision Avoidance) :\n- Sous cette appellation on trouve plusieurs méthodes qui tentent de résoudre le\nproblème de collision avant que les messages ne soient émis.\n- Cas des réseaux locaux sans fils WiFi : la méthode d’accès de base est appelée\nDCF « Distributed Coordination Function », c’est une méthode d’esquive de\ncollision CSMA/CA « CSMA/ Collision Avoidance ». Dans un environnement\nsans fil, il n'est pas possible de s'assurer que toutes les stations s’entendent entre\nelles (ce qui est l’hypothèse de base du principe de détection de collision).\nParticulièrement se pose le problème de la station cachée (cf. figure suivante\n(a)), ce problème se produit quand deux stations A et C ne peuvent pas\ns'entendre l'une et l'autre (du fait par exemple d'une distance qui les sépare\nsuffisamment importante) mais elles ont des zones de couverture qui se\nrecoupent et où se trouve une station B. Si les stations A et C ne font que la\ndétection de porteuse, n'étant pas en mesure de s'entendre l'une l'autre, elles\nvont s'autoriser à émettre des paquets en même temps à la station B ce qui\nprovoque une collision entre les trames et donc leurs pertes. En outre se pose\naussi le problème de la station exposée (cf. figure suivante (b)) : la station B\nveut transmettre à C, B écoute le canal et le trouve occupé par A, B pense que le\ncanal est occupé et il ne peut pas joindre C Alors que c’est possible.\n24\n(a) «station cachée » (b) « station exposée »\nSuivant le mode DCF, une station voulant transmettre écoute le support, et s’il\nest occupé, la transmission est différée. Si le canal est libre pour un temps\nspécifique (appelé DIFS, Distributed Inter Frame Space), alors la station est\nautorisée à transmettre. La station réceptrice va vérifier le CRC du paquet reçu\net renvoie un accusé de réception (ACK). Si l’émetteur ne reçoit pas l’accusé\nde réception, alors il retransmet le fragment jusqu'à ce qu'il l’obtienne l’ACK\nou abandonne au bout d’un certain nombre de retransmissions.\nDurant la transmission de la trame et jusqu’à réception de l’accusé de réception,\nNAV « Network Allocation Vector », aucune station n’a le droit d’émettre. Le\ntemporisateur NAV est le premier élément qui permet concrètement d’éviter les\ncollisions et correspond à un indicateur de \"Virtual Carrier Sense\".\nCe principe s'adapte bien et est appliqué dans le cas des trames courtes. Pour les\ntrames longues la réservation du canal se fait d'abord moyennant des messages\ncourts (RTS/CTS: \"Request To Send/Clear To Send\").\nSi le canal est libre pendant DIFS, une station émettrice transmet un RTS et\nattend que le destinataire réponde par un CTS. Toute station qui entend le CTS\ndoit déclencher le NAV. Aussi, toute station recevant le RTS, déclenchera le\nNAV (figure 9). Ce mécanisme réduit la probabilité de collision par une station\n« cachée » de l’émetteur dans la zone du récepteur à la courte durée de\ntransmission du RTS. Un algorithme de back-off (BO), est utilisé pour éviter\nque deux stations émettent en même temps (comparable à celui du CSMA/CD).\nLe seul cas où le back-off n'est pas utilisé est quand la station décide de\ntransmettre une nouvelle trame et que le support a été libre pour DIFS.\n25\nDIFS SIFS\nRTS Données\nSource\nSIFS SIFS\nCTS ACK\nDestination\nDIFS\nAutres\nNAV (RTS) Backoff\nstations\nNAV (CTS)\nNAV (données)\nAccès différé Délai aléatoire\n- Slot = 50µs\n- SIFS : « Short Inter Frames Space » = 28µs, valeur minimale pour qu’une station puisse changer du mode\némission vers le mode réception(dans le cadre d’un même dialogue, le récepteur gagne le droit d’accès).\n- DIFS « Distributed Inter Frame Space » = SIFS+2*Slot=PIFS+Slot=128µs, utilisé lorsqu’une station veut commencer\nune nouvelle transmission\nFigure 9 : transmission CSMA/CA &\"Virtual Carrier Sensing\"\nRemarque : Il existe un autre IFS appelée PIFS « Point coordination IFS » dont la\ndurée est de 78µs (SIFS+Slot), il est utilisé par la méthode de polling PCF au lieu du\nDIFS, il permet de donner une priorité au AP. L’ordre de priorité conséquent est\ninduit par : SIFS<PIFS<DIFS\nProtocoles sans collision\n- Cas du protocole bit-map : dans ce protocole, chaque station utilise un mini-slot\npour annoncer qu'elle souhaite transmettre une trame (bit à 1) ou non (bit à 0).\nToutes les stations entendent cette annonce. Une fois que toutes les stations ont\neffectué leur annonce (leur nombre doit être connu de tous), les transmissions\nont lieu dans l'ordre des stations ayant annoncé une trame. Il n'y a pas de\ncollision.\n- Cas du protocole à comptage binaire : pour limiter la période de contention\ndans le protocole précédent, on peut utiliser un identificateur unique des\nstations. S'il y a N stations, log2 N bits peuvent suffire. Chaque station qui veut\ntransmettre une trame annonce les bits de son identification, un par mini-slot\ndans la phase de contention. On suppose que le canal réalise un « ou » logique.\nSi une station « entend » un bit différent de celui qu'elle a émis, elle se retire de\nla compétition. À la fin, seule une station reste, et a le droit de transmettre dans\nla période de transmission qui suit. Un protocole similaire, nommé CSMA-CR\n(Contention Resolution) est mis en oeuvre dans le RNIS (interface S).",
        "metadata": {
            "topic": "II.4.4 Les techniques à accès aléatoire",
            "subtopic": "II.4.4.2 CSMA"
        }
    },
    {
        "text": "Toutes les techniques citées ci-dessus sont dynamiques (adaptatives) et le partage du\nsupport est temporel, seule la technique du « polling » est centralisée. Une\nclassification de ces techniques d’accès est décrite par la figure 10.\n26\nstatique dynamique\naléatoire déterministe\nCSMA/CD polling anneau en jeton\ntranches\nFigure 10 : classification des techniques d’accès utilisées dans les LAN",
        "metadata": {
            "topic": "II.4 Les protocoles d'accès",
            "subtopic": "II.4.5 Classification"
        }
    },
    {
        "text": "Plusieurs études d'évaluation de méthodes d'accès ont été effectuées. Nous retenons\ndans la suite les principaux résultats obtenus.\nLa méthode CSMA/CD dépend essentiellement du nombre de nœuds émetteurs, de la\ncharge de communication provenant des différents coupleurs et du rapport temps de\npropagation sur le support divisé par le temps de dépôt d’une trame. Lorsque ces\ndeux paramètres augmentent le nombre de collisions augmentent et par conséquent\nl’utilisation effective diminue. On estime dans le cas d'un réseau Ethernet (10Mb/s)\nque le débit imposé au réseau (y compris les retransmissions) ne doit pas dépasser\n5Mb/s s'il y a plus de 100 nœuds en émission, au risque que le débit réel s'écroule.\nCeci n'est pas le cas pour les techniques à jeton qui sont moins sensibles à la charge\nimposée.\nDans le cas de la méthode CSMA/CD, lorsque la charge d'émission est faible, et donc\nle taux de collision, les temps d'attente pour obtenir l'accès au support sont faibles.\nDans le cas des techniques à jeton, ce temps dépend de la taille de l'anneau et du\ntemps de traversé d'un coupleur. Si un seul nœud émet des messages l’efficacité est\ninférieure à celle de la méthode CSMA/CD.\nUn autre paramètre dont dépend la méthode CSMA/CD et la taille maximale des\ntrames, plus elle est petite, plus le découpage des messages conduit à un nombre\nimportant de trames et donc de collisions. Inversement si cette taille augmente, les\ntemps d'attente de libération du support de transmission augmentent, l'accès étant\naléatoire, d'où le risque qu'un nœud reste en attente de la libération du support d’une\nfaçon inacceptable. Dans le cas des techniques à jeton ce problème ne se pose pas\npourvu que le jeton ne soit pas détenu par un nœud que pendant une certaine durée\nlimite et que le jeton circule d'une façon équitable.\nL’évaluation des performances de ces méthodes sera traitée dans les exercices qui\nsuivent.\n27",
        "metadata": {
            "topic": "II.4 Les protocoles d'accès",
            "subtopic": "II.4.6 Comparaison"
        }
    },
    {
        "text": "Exercice 1\nOn considère la méthode d’accès ALOHA. Les trames sont générées suivant le\nprocessus de Poisson.\nOn définit les paramètres suivants :\n- T: durée de trame (temps moyen nécessaire à la transmission d’une trame,\ntaille moyenne / débit) ;\n- λ : le nombre moyen de trames produites par seconde par l’ensemble des\nnœuds.\n- s : le nombre moyen de trames émises sans collision par seconde ;\nOn pose :\n- g= λ\n- S = s.T (débit utile normalisé)\n- G = g.T (charge offerte normalisée)\nLa probabilité d’émettre k trames pendant une durée T (notée P (T)) est donc :\nk\n(gT )k\nP(T )  egT\nk k!\n1) Quelle est la condition pour qu’une trame soit émise avec succès à un instant\nt ? Déduire la probabilité de succès P .\nsuccès\n2) Déterminer la probabilité de succès P en fonction de s et g.\nsuccès\n3) Déterminer S en fonction de G.\n4) Dans le cas de l’Aloha Slotté, que devient l’expression de S en fonction de G.\n5) Tracer S en fonction de G.\nExercice 2\nOn considère un réseau local utilisant la méthode d'accès aléatoire CSMA où\nchaque station dispose toujours d'un message à transmettre. Lorsqu'une station\ndétecte que le support est libre, elle transmet une trame avec une probabilité P. La\nprobabilité qu'une seule station, à la fois, émette une trame est donc :\nPu = N*P*(1-P)N-1.\nOn définit les paramètres suivants :\n- C = débit de transmission du support,\n- D = délai de propagation d'un signal sur le support de transmission,\n- L = longueur d'une trame (supposée toujours constante),\n- N = nombre de stations dans le réseau,\n- U = utilisation du réseau.\nOn pose : F=D*C/L\n28\nUne unité de temps est égale à la tranche canal (2*D=1). Une collision est traitée\nen une tranche canal.\n1) Montrer que la valeur 1/N de la probabilité P réduit la probabilité de collision\nlors d’une émission ? Cette valeur sera choisie dans ce qui suit.\n2) Que représente F ?\n3) Déterminer le temps d'injection en fonction de F.\n4) Déterminer le temps moyen de collisions successives (on suppose que le temps\nperdu sans qu’aucune station n’émette fait partie de ce temps).\n5) En ne considérant que les temps nécessaires pour l'injection d'une trame et la\npropagation d'un signal, déterminer l'utilisation U en fonction de F et N.\n6) Déduire la valeur de U quand N tend vers l'infini (sachant que lorsque N tend\nvers l'infini (1-(1/N))N-1 tend vers (1/e). Que peut on conclure ?\n7) Pour F=0.1 et F=2 tracer l’allure de la courbe U en fonction de N.\n8) Pour N=2 et N=10 tracer l’allure de la courbe U en fonction de F.\nExercice 3\nOn considère un réseau local Token-Ring où chaque station dispose toujours d'un\nmessage à transmettre. L'émetteur d'une trame libère le jeton dès que le premier\nbit de la trame lui revient et une fois qu’il a fini de transmettre la trame courante.\nLe temps d'injection du jeton est supposé nul. On définit les paramètres suivants :\n- C = débit de transmission du support (débit de transmission),\n- D = délai de propagation d'un signal sur le support de transmission,\n- L = longueur d'une trame (supposée toujours constante),\n- N = nombre de stations sur le réseau,\n- U = utilisation du réseau.\nOn pose : F = D*C/L\nOn note que le temps de propagation du jeton d’une station vers la suivante est\négal à D/N.\n1) Que représente F ?\n2) Une unité de temps est choisie égale à L/C (L/C=1). En ne considérant que les\ntemps nécessaires pour l'injection d'une trame et la propagation d'un signal,\ndéterminer l'utilisation U en fonction de F et N, dans chacun des deux cas\nsuivants : F ≤ 1 et F ≥ 1\nOn remarque que l’utilisation U correspond ici au rapport entre le temps utile\npour l’injection d’une trame et le temps total pour émettre une trame et passer le\njeton à la station suivante.\n29\n3) Comment varie U par rapport à N ? Déduire la valeur de U quand N tend vers\nl'infini. Que peut-on conclure ?\n4) Pour F=0.1 et F=2 tracer l’allure de la courbe U en fonction de N.\n5) Pour N=2 et N=10 tracer l’allure de la courbe U en fonction de F.\n6) Comparer ces courbes avec ceux de l’exercice précédent.\n30",
        "metadata": {
            "topic": "file1",
            "subtopic": "II.5 Exercices"
        }
    },
    {
        "text": "La diversité des LAN, de part les techniques et les moyens mis en œuvre, a conduit à\nun besoin de normalisation, d'autant plus que les LAN peuvent comporter une grande\nvariété d'équipements provenant de différents constructeurs. C'est ainsi que le comité\n802 de l'IEEE (« Institute of Electrical and Electronic Engineers ») a été constitué en\n1980. La normalisation concerne les couches 1 et 2 du modèle de référence OSI. Une\nfamille de normes a été élaborée. Tous les travaux ayant aboutis du comité IEEE 802\nont été repris sous forme de norme ISO sous les numéros 8802.x. Des travaux\nsimilaires à ceux du comité IEEE 802 ont été menés en Europe par l'ECMA\n(« European Computer Manufacturers Association »).",
        "metadata": {
            "topic": "IIIIII.. NNoorrmmaalliissaattiioonn ddeess rréésseeaauuxx llooccaauuxx",
            "subtopic": "IIIIII.. NNoorrmmaalliissaattiioonn ddeess rréésseeaauuxx llooccaauuxx"
        }
    },
    {
        "text": "Les normes IEEE 802.x correspondent à une implémentation spécifique aux LAN et\nplus généralement aux couches physique et liaison. L'architecture IEEE 802 est\ndécrite par la figure 1.\nCouches supérieures ....\nRéseau\nLLC 802.2\nLiaison\nMAC 802.3 802.5 802.11 802.15 …\n1\nPHY\nPhysique\nPMD\nFigure 1 : architecture IEEE 802\nLa norme IEEE 802.1 montre comment l'architecture IEEE 802 s'articule avec le\nmodèle de référence OSI. Parmi les thèmes traités par la norme IEEE 802.1 nous\nretrouvons: l'architecture des LAN/MAN, l'interconnexion avec les réseaux 802, la\ngestion des réseaux 802 … La couche liaison est décomposée en deux sous-couches :\nune couche pour le contrôle d'accès (MAC : \"Medium Access Control\") et une\ncouche pour le contrôle de liaison (LLC : \"Logical Link Control\"). Cette norme\ndéfinit les différentes primitives fonctionnelles en particulier ceux relatives aux\n31\ninterfaces avec les couches supérieures et à la gestion du réseau (interconnexion et\nalgorithmes de filtrage, adressage, administration).\nLa couche physique quant à elle est composée de deux sous-couches : la couche PHY\net la couche PMD (« Physical MeDium »). La couche PMD définit le type de support,\nle type de connecteur, le mode de transmission ... Cette couche réalise aussi, dans le\ncas du protocole CSMA/CD, l’écoute du signal. La couche PHY, quant à elle, réalise\nla conversion parallèle / série et inversement, un contrôle d’erreur (différent de celui\neffectuer au niveau MAC), le codage en ligne pour faciliter la synchronisation ...\nLes normes IEEE 802.3 802.4 802.5 décrivent différentes méthodes d'accès et les\ncaractéristiques physiques rattachées à chacune de ces méthodes :\n- IEEE 802.3 se base sur la méthode CSMA/CD sur bus, elle concerne les réseaux\nEthernet.\n- IEEE 802.4 se base sur la méthode jeton sur bus (dissous),\n- IEEE 802.5 se base sur la méthode jeton sur anneau, elle a été introduite par IBM\n(réseaux Token-Ring).\n- La norme IEEE 802.6 (dissous) est relative aux réseaux métropolitains (MAN).\nElle est remplacée particulièrement par le Gigabit Ethernet utilisé dans de\nnombreux MAN.\n- La norme IEEE 802.11 concerne les réseaux locaux sans-fil WLAN (\"Wireless\nLAN\"), elle se décompose en plusieurs normes de transmission, offrant chacune\ndes caractéristiques différentes en terme de fréquence, de débit ou de portée du\nsignal radio.\n- La norme IEEE 802.15 (Bluetooth) est une technologie de réseaux personnels\nsans fils (WPAN), elle est destinée à simplifier les connexions entre : ordinateurs\nimprimantes, téléphones portables, appareils domestiques, oreillettes sans fils,\nsouris, clavier … Cette technologie utilise un circuit radio de faible coût avec une\nfaible consommation électrique.\nDans ce chapitre sont décrites les normes associées aux réseaux Ethernet et WiFi. Les\ndeux sous-sections suivantes décrivent l’adressage au niveau MAC et la norme IEEE\n802.2.",
        "metadata": {
            "topic": "file1",
            "subtopic": "III.1 Les normes IEEE 802"
        }
    },
    {
        "text": "Les liaisons n'étant pas point à point, une trame doit donc comporter l'adresse\ndestination. Nous décrivons dans ce qui suit les différents modes d'adressages utilisés\ndans les trames MAC. Une adresse est attribuée à chaque coupleur.\n32\nI/G Adresse 2 octets\nI/G U/L Adresse 6 octets\nFigure 2 : formats d’adresses (LSB : « Less Significant Bit1 »)\nOn distingue deux formats (figure 2). Le format court de longueur 2 octets\n(actuellement il n’est plus utilisé) et le format long de longueur 6 octets. Pour ces\ndeux formats d'adresse le premier bit à gauche, de poids le plus faible, (bit I/G)\nindique s'il s'agit d’une adresse de groupe (G=1) ou individuelle (I=0). Tous les bits\nsont à 1 pour une diffusion. Dans le cas du format long, le second bit à gauche (bit\nU/L) indique si l'adresse est locale (L=1) ou universelle (U=0). Une adresse est locale\nsi elle est attribuée par l'administrateur du réseau. Elle est dite universelle si elle est\ngérée par une entité internationale (dépendant de l'IEEE). Elle est alors divisée en\ndeux parties. Les 3 octets de gauche servent à désigner le constructeur (OUI :\n« Organizationally Unique Identifier »), les 3 autres octets sont attribués par le\nconstructeur et représente un numéro de série.\nExemples : CISCO 00:00:0C:XX:XX:XX\nLANBridge de DEC 09:00:2B:XX:XX:XX",
        "metadata": {
            "topic": "III.1 Les normes IEEE 802",
            "subtopic": "III.1.1 Adressage MAC"
        }
    },
    {
        "text": "Elle est relative au contrôle de liaison logique (LLC : \"Logical Link Control\"). La\nsous-couche LLC offre la possibilité de définir des liaisons de données logiques entre\ntoute paire de nœuds, elle permet de masquer la méthode d'accès. Trois types de\nservice ont été prévus :\n- LLC 1 : sans connexion, non fiable,\n- LLC 2 : avec connexion, conservation de l'ordre d'émission, fiable,\n- LLC 3 : sans connexion, la récupération des erreurs est décidée par l'émetteur.\nEtant donné le faible taux d'erreurs dans les LAN, le service LLC1 est le plus utilisé.\nLes erreurs résiduelles sont donc laissées à la charge des couches supérieures\n(exemple : TCP/IP). En outre le service LLC1 permet la diffusion. Lorsqu'il s’agit\nd’effectuer des échanges pendant une longue durée tout en garantissant le traitement\ndes erreurs et en délivrant les messages en séquence (exemple d’application : transfert\nde fichiers), il convient d'utiliser le service en mode connecté LLC2. Le protocole\nLLC 2 est assez semblable à HDLC. Le service LLC3, plus simple à réaliser, est\nutile lorsque les échanges de données sont occasionnels mais doivent être fiables\ncomme c’est le cas pour les réseaux locaux industriels. En particulier, ce service est\n1 C'est le bit le moins significatif (poids faible) qui est transmis le premier\n33\nutilisé pour réaliser un mécanisme de « polling ». Les services LLC2 et LLC3 ne\ns’utilisent qu’en point à point.\nUne trame LLC, appelée LPDU : \"Link Protocol Data Unit\", comporte les champs\nsuivants (figure 3) :\n- 1 octet : adresse du point d'accès destination (DSAP : \"Destination Service\nAccess Point\") ; le bit de poids le plus faible (I/G) indique si l'adresse est\nindividuelle ou de groupe (LLC1) ; le bit suivant indique si l’adresse est attribuée\npar un organisme de normalisation (exemples, X25 : 0x7E, IP : 0x06, etc) ou non ;\n- 1 octet : adresse du point d'accès source (SSAP : \"Source Service Access Point\") ;\nle premier bit C/R indique s'il s'agit d'une commande ou d'une réponse.\n- 1 ou 2 octets : contrôle (similaire à HDLC) ;\n- jusqu'à 8 Moctets de données.\nDSAP SSAP Contrôle Données\nLe champ contrôle :\nFigure 3 : format d’une trame LLC\nCette trame est encapsulée dans le champ des données de la trame MAC.\nLLC1 utilise les LPDUs non numérotés suivants : UI («Unnembered Information »),\nXID (« eXchange Identification ») et TEST. LLC 2 utilise le mode ABM\n(Asynchronous Balanced Mode). Le protocole de gestion des transmissions est donc\nde type Go-Back-N. Le protocole Selective-Repeat n'a pas été retenu étant donnée sa\ncomplexité et que les temps de transmissions dans les LAN sont assez faibles. LLC3\nutilise des LPDU, inexistantes dans HDLC, AC0 et AC1 (« Acknowledged\n34\nConnectionless »). Le contrôle de flux et de type « stop-and-wait ». Les primitives de\nservices de LLC1 sont (Figure 4) :\n- DL_UNITDATA.request (@locale, @distante, LSDU, priorité)\n- DL_UNITDATA.indication (@locale, @distante, LSDU, priorité)\noù : @locale et @distante permettent de déduire le SSAP et le DSAP et les\nadresses MAC ; LSDU (Link Services Data Unit) représente les données à\nenvoyer ; priorité est utilisée dans le cas où la couche MAC gère des priorités.\nStation A Station B\nRéseau LLC MAC MAC LLC Réseau\nDL_CONNECT.Request (LLC2)\nMA_DATA.Request MA_DATA.Indication\nMA_DATA.confirm\nDL_CONNECT.Indication (LLC2)\n…\n…\nDL_CONNECT.Confirm (LLC2)\nDL_REPLY_UPDATE.Resquest (LLC3) (**)\nDL_UNITDATA.Request (LLC1)\nDL_REPLY_UPDATE_STATUS.Confirm (LLC3)\nDL_DATA_CONNECT.Request (LLC2)\nDL_DATA_ACK.Request(LLC3)\nDL_REPLY.Request (LLC3) (**)\nDL_UNITDATA.Indication (LLC1)\nDL_DATA_CONNECT.indication (LLC2)\nDL_DATA_CONNECT.Confirm (LLC2)\nDL_DATA_ACK_STATUS.Indication (LLC3)\nD\nD\nL\nL\n_\n_\nD\nRE\nA\nP\nT\nL\nA\nY\n_\n_\nA",
        "metadata": {
            "topic": "III.1.2 La norme IEEE 802.2",
            "subtopic": "III.1.2 La norme IEEE 802.2"
        }
    },
    {
        "text": "C\nnd\nK\nic\n.I\na\nn\nt\nd\nio\nic\nn\na\n(\nt\nL\nio\nL\nn\nC\n(\n3\nL\n)\nL\n(\nC\n**)\n3 )\nDL_REPLY_STATUS. Indication (LLC3)\nDL_DISCONNECT.Request (LLC2)\nDL_DISCONNECT.Confirm (LLC2)\nDL_DISCONNECT.Indication (LLC2)\nN.B :\n-Les primitives MAC ne sont pas toutes représentées dans la figure\n-Les primitives DL_REPLY_X permettent au récepteur de renvoyer des données en réponse, en même temps que l’ack.\n- Les primitives LLC2 pour le contrôle de flux ne sont pas représentées\n- Les primitives STATUS sont équivalentes à une confirmation\nFigure 4 : exemples d’échange de primitives LLC\nD'autres primitives de services pour LLC2 et LLC3 sont utilisées notamment pour\nl'établissement / libération de connexion et l'acquittement. La figure 4 donne un\nexemple d’échange de primitives entre les couches MAC, LLC et réseau. Les\nprimitives de la couche physique ne sont pas représentées (PHY_DATA.request,\nPHY_DATA.indication).\n35",
        "metadata": {
            "topic": "file1",
            "subtopic": "I"
        }
    },
    {
        "text": "",
        "metadata": {
            "topic": "III.2 Les normes IEEE 802.3",
            "subtopic": "III.2 Les normes IEEE 802.3"
        }
    },
    {
        "text": "- CSMA/CD (cf. §II.4.4).\n- à la suite d'une collision l'algorithme de reprise, appelé BEB (\"Binary\nExponential Backoff\"), est le suivant : à la N ième collision et tant que N est\ninférieur à 16, on tire une valeur entière aléatoire V appartenant à [0..2min(N,10)[ ;\nla nouvelle tentative sera effectuée après V * 51,2 µs (V * Time_Slot). Si le\nnombre de tentatives atteint 16, la transmission de la trame est abandonnée.\n- un autre algorithme de reprise déterministe est utilisé pour le protocole 802.3D\n(DCR : « Deterministic Collision Resolution »). Il assure un délai maximum de\ntransmission. L'algorithme est basé sur le principe de résolution en arbre binaire\n(figure 5). On distingue deux modes, le mode fermé où les nouveaux messages\narrivant à la suite d’une collision sont transmis après la résolution de la collision, et\nle mode ouvert où de nouveaux messages peuvent être transmis au cours de la\nrésolution de la collision (si l'ordre d'un message n’est pas dépassé au niveau de\nl’arbre de résolution).",
        "metadata": {
            "topic": "III.2 Les normes IEEE 802.3",
            "subtopic": "III.2.1 Méthode d’accès"
        }
    },
    {
        "text": "7 octets à 01010101 préambule utile pour la synchronisation\n1 octet à 10101011 SFD (\"Start Frame Délimitor\")\n2 ou 6 octets adresse destination\n2 ou 6 octets adresse source\n2 octets longueur du champ information\n46 à 1500 octets champ information et bits de bourrage\n4 octets FCS sur les champs après le SFD\n36\nTi : transmission d’un message\nCi : collision\nVi : aucune transmission (tranche vide)\noù i est le numéro de tranche\nN : noeud N ayant un message à transmettre\nC1 : Collision initiale (début d’époque)\nC13 C2",
        "metadata": {
            "topic": "III.2 Les normes IEEE 802.3",
            "subtopic": "III.2.2 Format d'une trame"
        }
    },
    {
        "text": "T16 T15 C10, T11, T12 V9 C5, T6, T7 T4\n15 14 13 12 11 10 9 8 7 6 5 4 3 2 1 0\nBorne d’une époque = N * T + (N-1) * TC avec :\nN : nombre de noeuds ; T :temps de transmission d’une trame ; TC : tranche canal\nFigure 5 : résolution par un arbre binaire",
        "metadata": {
            "topic": "file1",
            "subtopic": "V17 (fin époque) C14 C8 C3"
        }
    },
    {
        "text": "-MA_UNITDATA.Request (adresse_destination, adresse_source, MA_SDU) ;\n-MA_UNITDATA-STATUS.indication1(état (transmition_OK, collisions_excessives))\n-MA_UNITDATA.Indication (adresse_destination, adresse_source, MA_SDU,\nétat (Reception_OK, longueur_incorrecte, erreur_FCS, erreur_alignement))",
        "metadata": {
            "topic": "III.2 Les normes IEEE 802.3",
            "subtopic": "III.2.3 Primitives de service"
        }
    },
    {
        "text": "Suivant la vitesse le mode de transmission et la nature du support de transmission\nplusieurs normes de niveau physiques ont été définies, elles sont décrites dans les\nsections IV.1.2 et IV.1.3.",
        "metadata": {
            "topic": "III.2 Les normes IEEE 802.3",
            "subtopic": "III.2.4 Principales caractéristiques physiques"
        }
    },
    {
        "text": "D'autres normes ont été par la suite proposées pour augmenter le débit des LAN\nEthernet :\n1\nMA_UNITDATA.confirm\n37\n- Le Fast Ethernet (100 Mb/s) est un aménagement de la norme IEE 802.3 en\ngardant le même protocole d’accès mais le diamètre du réseau a été réduit d'un\nfacteur d’environ 10, il préconise 3 standards : le 100 BASE 4T sur de l'UTP 3,\n4 et 5 sur 4 paires (100 m), le 100 base TX sur de l'UTP 5 sur 2 paires (100 m)\net le 100 base FX sur 2 fibres multimodes (2 Km). Un seul niveau de HUB de\nclasse 1 ou deux niveaux de HUB de classe 2.\n- Utilisation d’un nouveau protocole MAC de type polling, les mêmes câbles\ntéléphoniques sont gardés (« Voice Grade ») 4 paires sont cependant utilisées.\nLes travaux correspondants sont effectués par le comité IEEE 802.12 (100\nBASE VG).\n- Le Gigabit Ethernet (IEEE 802.3z, 802.3ab) a été défini dès le départ en deux\nversions, semi-duplex et duplex intégral. Dans la version semi-duplex le\nsupport est partagé et l’accès au support est géré par le même protocole\nCSMA/CD. Pour assurer la compatibilité avec les couches supérieures, la taille\nminimale des trames est maintenue à 64 octets par rapport à ces couches.\nToutefois, afin de garder une longueur raisonnablement élevée pour le support\npartagé, les trames de taille inférieure à 512 octets sont complétées par des\noctets vides (padding ou carrier extension) pour atteindre les 512 octets (à la\nsuite du FCS). Après l’envoi de cette première trame qui permet à un\néquipement d’occuper le support partagé, ce même équipement a la possibilité\nd’envoyer d’autres trames, de taille inférieure cette fois-ci à 512 octets, pour\nune durée qui correspond à 8192 octets. Cette procédure de « réservation »\ntemporaire du support par une trame de taille supérieure ou égale à 512 octets\npermet d’assurer un débit utile élevé même si les trames de faible taille (512\noctets) dominent. La taille maximale des trames est la même que pour Ethernet.\nLa version duplex de Gigabit Ethernet permet d’interconnecter des équipements\nà travers un support bidirectionnel (débit théorique 2x1 Gbit/s), utilisé par deux\néquipements à la fois, donc CSMA/CD devient inutile. Cela permet non\nseulement d’augmenter le débit utile, mais aussi de s’affranchir des contraintes\nde « time slot » et donc d’augmenter la taille maximale du réseau jusqu’aux\nlimites imposées par la technologie de transmission (3000 m pour 1000 Base-\nLX sur fibre monomode).\n- Utilisation des commutateurs rapides.\n- Ajout de canaux synchrones permettant de réaliser un Ethernet multimédia. Le\nprotocole d’accès se rapproche du protocole DQDB.\n:\n38",
        "metadata": {
            "topic": "III.2 Les normes IEEE 802.3",
            "subtopic": "III.2.5 Evolutions de l’Ethernet vers le haut débit"
        }
    },
    {
        "text": "Il existe plusieurs normes IEEE 802.11, relatives aux réseaux locaux sans-fil WLAN\n(\"Wireless LAN\"), offrant chacune des caractéristiques différentes en termes de\nfréquence, de débit ou de portée du signal radio.",
        "metadata": {
            "topic": "III.3 Les normes IEEE 802.11",
            "subtopic": "III.3 Les normes IEEE 802.11"
        }
    },
    {
        "text": "- (cf. §II.4.4).\n39\nDIFS DIFS DIFS\nStation A\nFrame\nStation B\nDefer Frame\nStation C\nDefer Defer Defer Frame\nStation D\nDefer Defer Frame\nStation E\nDefer Defer\nBackoff time\nBackoff time remaining\n- L’algorithme de back-off est appliqué dans les cas suivants :\n~lorsqu’une émission est retardée à cause du fait que le canal est occupé (signalé\npar la couche physique ou VCS),\n~à la suite d’une retransmission (collision),\n~à la suite d’une transmission ayant réussie (transmission consécutive),\nLe seul cas où cet algorithme n’est pas utilisé est lorsqu’il s’agit d’émettre une\nnouvelle trame et le support est resté libre pendant DIFS.\nUne variable d’état CW « Contention Window » est maintenue et initialisée à\nCWmin (typiquement pour FHSS 15 et pour DSSS 31). Une taille maximale est\naussi imposée notée CWmax (typiquement à 1023)\n~Si une trame est transmise correctement (i.e., acquittée), alors CW =CWmin.\n~Le temps de backoff BO est généré aléatoirement entre 0 et CW.\n~Si le canal est occupé, alors BO reste inchangée (jusqu’à libération du canal).\n~Tant que le canal est libre et BO ≠0, alors décrémenter BO à chaque slot.\n~Si BO=0 alors l’émission peut avoir lieu.\n~Si une transmission échoue alors CW=min(CWmax, 2*(CW+1)-1) ;\n~un nombre de retransmission maximum est prévu (paramétrable).\n40\n.\nFigure 7 : les intervalles de back-off en fonction du numéro de tentative",
        "metadata": {
            "topic": "III.3 Les normes IEEE 802.11",
            "subtopic": "III.3.1 Méthode d’accès"
        }
    },
    {
        "text": "a) Connexion au réseau et association\nLes stations écoutent les différents canaux pour localiser un point d’accès\n(selon des critères tels que les performances ou la consommation d’énergie) :\n- une écoute passive où la station attend la réception d’une trame balise émise\npar l’AP et\n- une écoute active où la station émet des trames « Probes Request » et attend\nla réponse des points d’accès.\nLa station choisie l’AP le plus approprié, généralement celui dont le signal est\nde meilleure qualité. Une fois l’AP sélectionné, la station doit s’authentifier\npuis s’associer pour être connectée. Pour s’associer, la station doit être\nconfigurée avec le même SSID « Service Set ID » que le point d’accès (la SSID\nest généralement diffusée dans les trames Balise). Le diagramme d’état\nrégissant les associations est décrit par la figure 8. Une association est identifié\npar un AID « Association IDentity ». Celui-ci peut être partagé par plusieurs\n41\nAPs pour faciliter la mobilité en permettant des réassociations rapides et\ntransparentes.\nLa réassociation s’effectue en cas de déplacement vers un nouveau BSS, elle est\ninvoquée par la station (au nouvel AP), elle peut être refusée. Elle se déroule\ncomme l’association.\nAssociation\nFigure 8 : diagramme d’état-transition régissant les associations\nb) Fragmentation-réassemblage\nLa fragmentation réduit le taux de retransmission par des trames de plus petites\ntailles. Une longueur seuil, appelée Fragmentation_Threshold, est définie. Les\nfragments sont transmis de manière séquentielle, le support n’est libéré qu’une fois\ntous les fragments sont transmis ou lorsque la station source ne réussit pas à recevoir\nl’acquittement d’un fragment (figure 8).\nFigure 9 : exemple de transmission d’une trame fragmentation\n42\nc) Economie d’énergie\nDeux modes de fonctionnement pour les terminaux sont prévus :\n- « Continuous Aware Mode », celui par défaut, le terminal est toujours allumé.\n- « Power Save Polling Mode », pris en charge par l’AP. Suivant ce mode, la\nstation désactive son dispositif sans fil. L’AP auquel elle est associée met alors\nles trames destinées à la station dans une mémoire tampon. Périodiquement, la\nstation réactive le dispositif radio et attend l’arrivée d’une trame de balise\n« Beacon » (trame TIM « Traffic Information Map » pour trafic unicast et\nDTIM « Delivery TTM » pour trafic multicat ou broadcast ») de l’AP lui\nindiquant la présence de trames à son intention.\nd) Sécurité\nLa communication, se réalisant par onde radio, couvre une zone plus étendue qu’on\nne le souhaite. Tout ce qui est transmis peut être intercepté. Pour remédier à ce\nproblème de sécurité, l’IEEE a défini des mécanismes de chiffrage des données et\nd’authentification. Plusieurs protcoles de sécurisation ont été définis, dont le WEP\n« Wired Equivalent Privacy » et le WPA « Wi-Fi Protected Access ».\nSuivant le WEP, deux modes d’authentification ont été prévue : « Open System\nAuthentification » et « Shared Key Authentification ».L’authentification « Open\nSystem » est celle par défaut, elle ne requiert réellement pas d’authentification\nspécifique. Si aucun chiffrement n'est activé sur le réseau, tout périphérique peut\nécouter toutes les données qui transitent sur le réseau. L’authentification « Shared\nKey » exige que le chiffrement soit activé avec une même clef sur le client et l’AP. Le\nclient doit savoir crypter un défi « text-challenge ». En plus de ces deux modes\nd’authentification spécifiés par le standard, certains fabricants proposent\nl’authentification par adresse MAC. L’AP maintient alors une liste d’adresses\nautorisées, le processus d’authentification continue uniquement si l’adresse du client\nest présente dans la liste.En utilisant le WEP, chaque terminal possède une clé secrète\npartagée sur 40 et peut aller jusqu’à 104 bits. Cette clé est concaténée avec un code de\n24 bits, l’IV « Initialization Vector », qui est réinitialisé à chaque transmission. La\nnouvelle clé de (64-128 bits) est placée dans un générateur de nombre aléatoire qui\ndétermine une séquence de clés pseudo-aléatoires, qui permet de chiffrer les données.\nUne fois chiffrée, la trame peut être envoyée avec son IV. Pour le déchiffrement, l’IV\nsert à retrouver la séquence de clés qui permet de déchiffrer les données. Le\nchiffrement ne protège que les paquets données de la trame et non les paquets de son\nen-tête. Le WEP utilise la somme de contrôle CRC-32 pour assurer l'intégrité peu\nsûr : il est possible modifier les données et de recalculer le CRC du message.\n43\nDevant la grande vulnérabilité du WEP, le WPA (version allégée du protocole\n802.11i) a été défini pour corriger les failles de sécurité du WEP. Une clé de 128 bits\nest utilisée et l'IV passe à 48 bits. Des protocoles d'authentification et de cryptage plus\nrobuste sont appliqués. Le TKIP « Temporary Key Integrity Protocol » permet la\ngénération aléatoire de clés (dynamiques) et permet de modifier la clé de chiffrement\nplusieurs fois par seconde. Cependant, ce protocole n’est pas suffisamment robuste et\npeut lui aussi être cassé en quelques minutes. Une autre alternative, assez robuste, est\nle protocole AES-CCMP « Advanced Encryption Standard - Counter with Cipher\nblock chaining Message authentication code Protocol » (définie dans le standard\nIEEE 802.11i). Grâce à ce protocole, une vérification de l'intégrité des messages MIC\n« Message Integrity Check » est aussi effectuée. Deux modes de fonctionnement sont\nprévus : le mode PSK « PreShared Key » - appelé aussi mode Personnel - s’appuyant\nsur un secret partagé et le mode basé sur la norme 802.1x pour une authentification\ncentralisée, une prise en charge de la gestion et de la distribution des clés\n(indépendante de la norme 802.11 et utilisée que ce soit pour un réseau filaire ou un\nréseau sans fil, il s’agit d’un protocole permettant de n'autoriser l'accès à un port\nréseau qu'après authentification), appelé aussi mode Entreprise. La norme 802.1x\nutilise un protocole d'authentification existant l’EAP « Extensible Authentication\nProtocol ». Dans le cas d’un réseau WiFi, l'authentification 802.1x comporte trois\ncomposants : l'authentificateur (le point d'accès), le demandeur (le client) et le serveur\nd'authentification (exemple, RADIUS). Le point d'accès, authentifie le client en\nfaisant appel au serveur d'authentification suivant le protocole EAP. Ce serveur peut\nauthentifier l'utilisateur (par mot de passe ou certificats) ou le système (par adresse\nMAC). Différents types d’authentification sont possibles : EAP-TLS, EAP-TTLS et\nPEAP « Protected EAP ». Il existe une autre authentification 802.1x : la Cisco LEAP\n« Cisco Light EAP », en outre Cisco a introduit la fonctionnalité CCKM « Cisco\nCentralized Key Management », qui permet à un point d'accès, configuré pour fournir\ndes services WDS « Wireless Domain Services » de prendre la place du serveur\nd’authentification pour les opérations re-authentification de stations (qui ont changé\nde point d’accès). WPA2, version de la norme IEEE 802.11i certifiée par la Wi-Fi\nAlliance, impose la prise en charge de l’AES-CCMP. Le WPA n'est pas compatible\navec les réseaux Ad Hoc. C'est l’une des raisons de l'apparition de WPA2 qui permet\nd'utiliser WPA au niveau des réseaux ad-hoc.\ne) Handovers et mobilité\nLe Roaming ou le Handover survient lorsqu’une station se déplace d’une cellule à\nune autre. Contrairement à la téléphonie mobile les Handovers en WiFi se font entre\ndeux transmissions de données. Le standard ne fournit pas un mécanisme de handover\nà part entière, mais définit quelques règles (synchronisation, association, ré-\n44\nassociation …), ce qui a laissé le champ libre à des implémentations propriétaires. Si\nune station se déplace elle cherchera le meilleur point d'accès pour s'associer avec lui,\nmais toute communication sera interrompue et non reprise par le nouveau point\nd'accès. La borne à laquelle s’associe une station est choisie suivant des critères, tels\nque la puissance du signal, le taux d'erreur des paquets, la charge réseau ... Une\npremière norme 802.11f a été élaborée afin de supporter le roaming mais elle a été\nretirée en février 2006 (roaming lent, non finalisée, désintéressement des acteurs).\nUne seconde norme a été ensuite définie : la norme 802.11r. Sans le recours à cette\nnorme, la reconnexion prend quelques dixièmes de seconde, voir quelque secondes,\nce qui ne pose pas de réels problèmes dans le cas de bon nombre d’utilisations. Mais\ndans le cas d’une conversation téléphonique la moindre coupure est audible. Avec la\nnorme 802.11r, la connexion au nouveau réseau se fait avant la déconnexion, ce qui\npermet d’avoir des coupures de tout au plus 50 ms.",
        "metadata": {
            "topic": "III.3.2 Autres fonctionnalités (vs. réseaux filaires)",
            "subtopic": "III.3.2 Autres fonctionnalités (vs. réseaux filaires)"
        }
    },
    {
        "text": "Il existe trois principaux types de trames :\n- les trames de données, utilisées pour la transmission des données,\n- les trames de contrôle, par exemple RTS, CTS et ACK,\n- les trames de gestion, pour l’échange d’informations de gestion au niveau\nMAC : associations ou les désassociations d’une station avec un AP …\nToutes les trames 802.11 sont structurées de la manière suivante :\nLongueur variable Préambule\nLongueur variable PLCP\n2346 octets Données MAC\n4 octets CRC\n- Le préambule comporte :\n~une séquence de 80 bits alternant 0 et 1 (appelée Synch), utilisée par la couche\nphysique pour sélectionner l’antenne et la synchronisation,\n~une séquence SFD de 16 bits (0000 1100 1011 1101), utilisée pour définir le\ndébut de la trame.\n- L’en-tête PLP « Physical Layer Convergence Protocol », toujours transmis à 1\nMb/s, permet de décoder la trame. Elle comporte :\n~la longueur (en octets) de mot du PLCP_PDU, utilisé pour détecter la fin du\npaquet,\n~un fanion de signalisation PCLP indiquant la vitesse de transmission entre la\ncarte coupleur et le point d’accès,\n~un champ de détection d’erreur CRC sur 16 bits\n- Le format général des données MAC est le suivant :\n45\n2 octets 2 octets 6 octets 6 octets 6 octets 2 octets 6 octets 0 - 2312 octets 4 octets\nContrôle Tr Durée ID @1 @2 @3 Contrôle Seq @4 Données CRC\nutiles\nEn-tête MAC\n~le contrôle de trame (FC : « Frame Control ») est constitué des informations\nsuivantes :\n« Version de protocole » : 2 bits, version du standard 802.11.\n\n« Type et Sous-type » : ces champs, respectivement de 2 et 4 bits,\n\ndéfinissent le type et le sous-type des trames (trames de données, des trames\nde services).\n« To DS » : 1 bit, à 1 pour toute trame envoyée par une station à destination\n\nd'un point d'accès (le Système Distribution DS).\n« From DS » : 1 bit, à 1 lorsque la trame provient du DS. Lorsque les deux\n\nchamps To et From sont positionnés à zéro il s'agit d'une communication\ndirecte entre deux stations (mode ad hoc).\n« More Fragments »: 1 bit, lorsqu'il est à 1 il reste des fragments à\n\ntransmettre.\n« Retry » : 1 bit, à lorsqu'il est à 1 spécifie que le fragment en cours est une\n\nretransmission d'un fragment précédemment envoyé (déjà perdu).\n« Power Management » : 1bit, lorsqu'il est à 1, la station ayant envoyé ce\n\nfragment entre en mode de gestion d'énergie (elle n’écoute pas à tout\nmoment et peut interroger un AP pour récupérer des trames en attente).\n« More Data » : 1 bit, en mode de gestion d'énergie, il est utilisé par un AP\n\npour spécifier à une station que des trames supplémentaires sont stockées en\nattente.\n« WEP » : 1 bit, indique que l'algorithme de chiffrement WEP a été utilisé\n\npour chiffrer le corps de la trame.\n« Order » : indique que la trame a été envoyée en utilisant la classe de\n\nservice strictement ordonnée « Strictly-Ordered service class ». La trame\ndoit être traitée en repectant l’ordre de réception.\n~Durée / ID : indique la durée d'utilisation du canal de transmission (estimé par\nl’émetteur), il permet la mise à jour du NAV. Il est aussi utilisé comme\nidentificateur de station pour les besoins de la gestion d’énergie.\n~Adresse 1 : adresse du récepteur. Si ToDS est à 1, c'est l'adresse du AP, sinon,\nc'est l'adresse de la station.\n~Adresse 2 : adresse de l'émetteur. Si FromDS est à 1, c'est l'adresse du Point\nd'Accès, sinon, c'est l'adresse de la station émettrice.\n~Adresse 3 : adresse de l'émetteur original quand le champ FromDS est à 1.\nSinon, et si ToDS est à 1, Adresse 3 est l'adresse destination.\n46\n~Contrôle de séquence : ce champ permet de distinguer les divers fragments\nd'une même trame. Il est composé de deux sous-champs permettant de\nréordonner les fragments : le numéro de fragment, le numéro de séquence\n(identique pour les fragments d’une même trame)\n~Adresse 4 : utilisé quand le système de distribution sans fil est utilisé et qu'une\ntrame est transmise d'un AP à un autre. Dans ce cas, ToDS et FromDS sont tous\ndeux à 1 et il faut donc renseigner à la fois l'émetteur original et le destinataire.\nAdresse 4 indique l'émetteur original (adresse 3 indique la destination finale et\nadresse).\n~CRC : une somme de contrôle servant à vérifier l'intégrité de la trame.",
        "metadata": {
            "topic": "III.3 Les normes IEEE 802.11",
            "subtopic": "III.3.3 Format d'une trame"
        }
    },
    {
        "text": "Les primitives de service sont comparables à ceux de la couche MAC IEEE 802.3.\n- MA-UNITDATA.request(addresse_source, adresse_destination, information de\nroutage,MA_SDU,priorité,Classe_de_service)\n- MA-UNITDATA.indication(addresse_source, adresse_destination, information\nde routage,MA_SDU,status, priorité,Classe_de_service)\n- MA-UNITDATA-STATUS.indication((addresse_source, adresse_destination,\nstatus, priorité_fournie, Classe_de_service_fournie)\nAvec :\n- information_de_routage non utilisé (nul),\n- status : coté émetteur peut être succès, échec avec nombre de tentatives limite\natteint, longueur trop grande, priorité/service non supportée, pas de BSS, échec\ncontrôle de sécurité …)\n- priorité : « Contention » DCF, « Contention Free » PCF ou une valeur entre 0 et 7\n- Classe_de_service : « Reorderable » ou « StrictlyOrdered » (entre les trames unicast\net multicast)",
        "metadata": {
            "topic": "III.3 Les normes IEEE 802.11",
            "subtopic": "III.3.4 Primitives de services"
        }
    },
    {
        "text": "La couche physique chargée de véhiculer des bits utilise l’onde hertzienne. Deux\nsous-couches ont été définies :\n- PLCP « Physical Layer Convergence Protocol », elle écoute le support et\nindique ainsi à la couche MAC via un CCA « Clear Channel Assessment » si le\nsupport de transmission est libre ou non\n- PMD « Physical Medium Dependeur », s’occupe de l’encodage des données.\nComme nous l’avons déjà décrit dans le chapitre précédent, la norme de base spécifie\ndifférents les modes de transmission : FHSS « Frequency Hopping Spread\nSpectrum », DSSS « Direct Sequence Spread Spectrum », OFDM « Orthogonal\nFrequency Division Multiplexing ». En plus elle prévoit le mode IR Infra Rouge pour\nla communication entre stations proches. Le tableau suivant résume les propriétés de\nces différents modes.\n47\n802.11 802.11a 802.11b 802.11g\nBande (Ghz) 2,4 5 2,4 2,4\nDébit Max. (Mb/s) 2 54 11 54\nModulation FHSS/DSSS OFDM DSSS DSSS / OFDM\nEn pratique la portée dépend de certains paramètres physiques, comme la puissance\nd’émission, spécifiés par la réglementation, mais elle dépend aussi de la qualité des\nproduits et de l’environnement considéré (nature des obstacles). Elle est de quelques\ndizaines de mètres à l’intérieur d’un bâtiment, à quelques centaines de mètres à\nl’extérieur. La portée augmente en réduisant le débit. Si la liaison n’est pas\nsatisfaisante, le débit nominal peut se replier sur des débits inférieurs (cf. chapitre",
        "metadata": {
            "topic": "III.3 Les normes IEEE 802.11",
            "subtopic": "III.3.5 Principales caractéristiques physiques"
        }
    },
    {
        "text": "Exercice 1\nOn considère un réseau local Ethernet. La retransmission en cas de collision est\neffectuée selon l'algorithme du retard exponentiel binaire BEB. Ce réseau gère les\ntransmissions entre 4 stations A, B, C et D. Dans ce problème on utilise comme\nmesure de temps le \"time slot\" qui est le temps d’allée-retour. Les délais\nd'espacement inter-trames ainsi que les durées de détection de voie libre sont\nnégligés. Le temps de détection de collision est égal à 1 slot.\nA l'instant t = 0 la station A acquiert la voie et commence à transmettre un\nmessage. A l'instant t = 5 les stations B, C, et D reçoivent une demande de\ntransmission d’une trame. Puis, pendant toute la durée considérée dans l'exercice\naucune autre demande de transmission n'est soumise aux stations. Tous ces\nmessages sont de taille fixe et la durée de leur transmission est égale à 2 slots.\nDans l'exemple on considèrera que la fonction de tirage aléatoire rend\nsuccessivement pour chaque station les valeurs données par le tableau suivant :\nB C D\n1er tirage 1 1 1\n2ème tirage 3 3 2\n3 ème tirage 2 5 4\n1) Compléter le diagramme suivant en indiquant pour chaque slot l'état de la voie.\nUn slot occupé par la transmission d'un message correctement émis par la station A\nest représenté par \"A\"\nUn slot occupé par une collision est représenté par \"X\". Un slot correspondant à une\nabsence de transmission est représenté par \"—\"\n48\nt=0 1 15\n30\n2) Calculer le taux d'utilisation de la voie sur la période allant de t = 0 à la fin de la\ntransmission du dernier message.\n3) A l’instant t=20 B et C envoient chacun une nouvelle trame ce qui provoque\nune collision, à quel intervalle devrait appartenir la valeur aléatoire générée par B\nou C ?\n49",
        "metadata": {
            "topic": "IV).",
            "subtopic": "IV)."
        }
    },
    {
        "text": "Ce chapitre présente les composants des réseaux locaux Ethernet et WiFi.\nL’organisation d’un plan de câblage d'un réseau local est aussi abordée.",
        "metadata": {
            "topic": "IIVV.. DDééppllooiieemmeenntt ddeess rréésseeaauuxx llooccaauuxx",
            "subtopic": "IIVV.. DDééppllooiieemmeenntt ddeess rréésseeaauuxx llooccaauuxx"
        }
    },
    {
        "text": "",
        "metadata": {
            "topic": "file1",
            "subtopic": "IV.1 Ethernet"
        }
    },
    {
        "text": "Le réseau Ethernet est issu des travaux de recherches lancés au début des années 70\npar Xérox sur les techniques d'accès aléatoire pour les LAN. En 1980 la première\nversion 2 (ou DIX) a été réalisée en collaboration avec Digital et Intel. Depuis le\nréseau Ethernet a connu plusieurs évolutions. En 1985, l'IEEE reprend les\nspécifications Ethernet et elle les formule dans la publication IEEE 802.3. Certaines\nmodifications ont été introduites notamment au niveau du câblage. Au niveau\nphysique, les réseaux Ethernet actuels se conforment aux normes IEEE 802.3. Les\ndifférences au niveau MAC seront étudiées dans le chapitre V.",
        "metadata": {
            "topic": "IV.1.1 Ethernet II (DIX) vs Ethernet IEEE 802.3",
            "subtopic": "IV.1.1 Ethernet II (DIX) vs Ethernet IEEE 802.3"
        }
    },
    {
        "text": "- média et connectique :\n- 10 BROAD 36 : câble coaxiale CATV (RG6), semi-rigide, large bande,\n10 Mb/s, topologie en bus, longueur maximale sans répétition 3600 m, nombre\nmaximal de nœuds par segment 1024.\n 10 BASE 5 (Ethernet de base): câble coaxial 50  (le blindage composé\nde tresses et d'écrans) ; rayon de courbure 25 cm ; vitesse de propagation =\n0.77*c=2,31*108 m/s ; temps bit = 0,1 µs (1/débit) ; longueur = multiples\nimpaires de 23,4 m (pour que les réflexions ne soient pas en phase.\nConsidérer la moitié de la longueur d'onde à 5 Mhz : 23,4 m \n(2,31*108)/(2*5*106)); connectique de type N (avec filetage) ; topologie\nen bus ; longueur maximale d'un segment 500 m ; le nombre maximal de\nnœuds par segment 100, le nombre maximal de répéteurs 4.transmission\nen bande de base (Manchester) ; 10 Mb/s ;\n -10 BASE 2 (Cheapernet) : câble coaxial 50  (souple le blindage est\ncomposé de tresses, le câble est en fils multi-brins) ; rayon de courbure 5\ncm ; vitesse de propagation = 0.65*c=1,95 108 m/s ; temps bit = 0,1 µs\n(1/débit) ; connectique de type BNC (Bayonnet-Neil-Concelman);\ntransmission en bande de base (Manchester) ; topologie en bus ; longueur\nmaximale d'un segment 185 m ; longueur minimale entre nœud 0.5 m ;\n50\nnombre maximal de nœuds par segment 30, nombre maximal de répéteurs\n4* ; 10 Mb/s.\n 10/100/1000 BASE T (Starlan) : paire torsadée, différentes catégories de\ncâbles (voir chapitre II) ; connectique RJ45 (8 broches dont 2 pour\nl'émission et deux pour la réception). topologie en étoile, la longueur\nrecommandée d’un câble est de 100 m.\nSelon la norme TIA-568B, le code couleur suivant est appliqué (un autre code couleur est\nutilisé pour la norme TIA-568A, où le vert et l'orangé sont permutés par rapport à la\nnorme TIA-568B)\nSchéma d’un câble RJ45 croisé pour des cartes réseaux à 10/100/1000 Mbit/s (entre\nparenthèses les désignations utilisées pour 1000 BASE T)\nNom NCI 1 NCI 2 Nom\nTX+ (BI_DA+) 1 3 RX+ (BI_DB+)\nTX- (BI_DA-) 2 6 RX- (BI_DB-)\nRX+ (BI_DB+) 3 1 TX+ (BI_DA+)\n- (BI_DC+) 4 7 - (BI_DD+)\n- (BI_DC-) 5 8 - (BI_DD-)\nRX- (BI_DB-) 6 2 TX- (BI_DA-)\n- (BI_DD+) 7 4 - (BI_DC+)\n- (BI_DD-) 8 5 - (BI_DC-)\n51\n 10 BASE FP (Fiber Passive) : fibre optique, 10 Mb/s, point à point,\ntopologie en étoile, longueur maximale d’un câble 1 Km, HUB passif.\n 10 BASE FL (Fiber Link) : fibre optique, 10 Mb/s, point à point, topologie\nen étoile, longueur maximale d’un câble 2 Km.\n 10 BASE FB (Fiber Backbone) : fibre optique, 10 Mb/s, point à point,\nlongueur maximale d’un câble 2 Km (« Inter Repeater Link »).\n- TRANSCEIVER (\"TRANSmitter reCEIVER\") et convertisseurs de média.\nUn transceiver (\"transmitter receiver\"), appelé aussi MAU (\"Medium\nAttachement Unit\"), est l'élément qui se connecte directement au média et qui\nse charge de l'émission et de la réception des signaux sur le support de\ntransmission. Il détecte les collisions par comparaison entre les signaux émis et\nles signaux reçus pendant le RTD, le processus est analogique. Le transceiver\nassure aussi certaines fonctions particulières comme la protection « jabber »\ncontre les trames trop longues. Dans ces deux dernier cas, il active le signal de\nprésence de collision ou de trame tronquée « Signal Quality Error » ou « Heart\nBeat »1. Dans le cas de l'Ethernet de base (10 BASE 5), un transceiver à\npiquage est utilisé où une aiguille est introduite dans le câble et mise en\ncontacte avec le conducteur central. Le transceiver possède une ou plusieurs\nprises DB15 (15 broches) sur lesquelles sont branchés les câbles AUI\n(\"Attachement Unit Interface\"). Dans le cas du Cheapernet (10 BASE 2), le\ntransceiver est relié au média à travers un T. Il est souvent intégré dans la carte\ncoupleur. Dans le cas contraire, il est relié au coupleur par une prise DB15\n(alimentation, collision, émission, réception,...).\nLes transceivers offrent la possibilité de changer de média sans changer la carte\ncoupleur. Pour les réseaux Gigabit, il est possible de changer de média\nmoyennant un adaptateur intégré appelé GBIC (Gigabit Interface Converter).\nUn GBIC est une interface interchangeable à chaud permettant de convertir le\n1\nLe test SQE : Le signal SQE peut être utilisé en tant que test, on l’appelle alors SQE(T). Il sert à vérifier la\nconnexion entre la station et le tranceiver. Il est émis uniquement vers la station et non vers le réseau.. Le SQE(T) est\nappliqué entre chaque trame et a reçu pour cette raison le nom de « Heart Beat » (battement de cœur). Il peut être\nactivé ou désactivé par un interrupteur. Il ne faut surtout pas l’activer si la station n'en connaît pas la signification. Il\npourrait être interprété comme un SQE standard et faire croire à la station qu'il y a un taux anormal de collisions.\n52\nsignal. IL existe aussi des convertisseurs de média, permettant de se connecter à\ntravers un port RJ45 à un port SC.\n- Câble de transceiver : également appelé Attachment Unit Interface (AUI), ou\ncâble de descente (drop cable), il relie le transceiver au coupleur, sa longueur\nmaximum de 50 m, utilise un connecteur 15 pins, le câble est constitué de 4 ou\n5 paires torsadées :\n1. une paire pour l'alimentation\n2. une paire pour les signaux de données en entrées\n3. une paire pour les signaux de données en sortie\n4. une paire pour les signaux de contrôle en entrées: transceiver prêt à émettre,\ntransceiver non prêt à émettre, erreur de qualité de signal (SQE) émis sur\ndétection de collision ou trame tronquée (jabber)\n5. une paire optionnelle pour les signaux de contrôle en sortie (coupleur -->\ntransceiver) permettant de commander le transceiver : entrer en mode\nmonitor, passer en mode normal …\n- Fan out ou multiplicateur d'accès : ce dispositif permet de connecter plusieurs\nnœuds à un même transceiver via des câbles AUI (pour 10 BASE 5).\n- Répéteur : il permet de relier deux segments. Le nombre de répéteurs est limité\nselon la norme utilisée.\nUn répéteur est particulièrement utile pour relier un réseau Ethernet de base à\nun réseau Cheapernet. Il existe des répéteurs distants qui permettent de relier\ndeux segments éloignés. Ces répéteurs sont formés de deux répéteurs reliés par\nun câble couvrant la distance en question.\n53\n- Carte coupleur (NIC : « Network Interface Card ») : chargé de contrôler les\ncommunications en particulier les fonctions de la couche physique du modèle\nOSI et de la sous-couche MAC. Il existe des coupleurs dits intelligents qui\ngèrent des fonctions de niveaux supérieurs (LLC et plus).\nLa carte coupleur est montée sur le bus de la machine (PCI 32/64 bits,\nISA/EISA, CardBus/Card PCMCIA ...). Elle peut être munie de plusieurs ports\n(BNC, AUI-DB15, RJ45).\nUne carte réseau est généralement capable de réaliser l’auto-négociation du\ndébit 10/100/1000 Mb/s et du mode « Full » ou « Half » duplex. Suivant la\nnorme IEE 802.3x une carte peut aussi se soumettre à un contrôle de flux\n(lorsqu’elle est raccordée à un commutateur mettant en œuvre se contrôle de\nflux).\nCertaines cartes offre la fonction WOL (Wake-On-LAN) : l’ordinateur peut être\nmis ON/OFF à distance.\nPour disposer d’un débit plus important, il est possible de trouver des cartes qui\nréalisent l’agrégation de liens (IEEE 802.3ad).\nA l'émission, les contrôles de transmission effectués par la carte coupleur sont :\n construction de la trame,\n attente de la libération du canal, l'émission est initialisée après un\ndélai/espace inter-trame minimum (IFG : \"Inter-Frame Gap\") de 9,6 µs\npour l'Ethernet, de 960 ns pour le Fast Ethernet et de 96 ns pour le Gigabit\nEthernet. Il permet de déceler le repos du signal et de donner la possibilité\naux interfaces réseaux de se préparer et d'émettre,\n Surveillance du canal, en appliquant la méthode d'accès CSMA/CD.\nA la réception, les actions suivantes sont effectuées :\n54\n détection de l'arrivée d'une trame,\n réception bit par bit jusque le repos du signal,\n vérification que la taille de la trame n'est pas courte (\"runt\"),\n comparaison des adresses du nœud et de destination, s'ils sont égaux la\ntrame est retenue pour être délivrée à la couche supérieure,\n vérification de l'alignement et du FCS,\n vérification que la taille de la trame n'est pas longue (\"jabber\"),\n- Hub : il a été introduit dans le réseau Starlan (10 BASE T) pour réaliser une\ntopologie en étoile dont les nœuds sont les Hubs (d'où le nom en anglais). Un\nHub récupère le signal par une entrée et duplique ce signal sur les sorties. Un\nHub est actif, il ré-amplifié (répété) le signal. La possibilité d’empiler les Hubs\nà travers des ports appropriés permet de remédier en partie aux contraintes liées\nau nombre de segments qu’on peut cascader.\n- Commutateur (Switch) permet d’interconnecter des stations, des HUBs ou des\nsegments Ethernet. Pour augmenter le débit on peut passer à la commutation\nEthernet duplex integrale FDSE (Full Duplex Switched Ethernet). La\ncommutation Ethernet abandonne le principe du médium partagé Plusieurs\ntransmissions peuvent avoir lieu en même temps. Deux techniques de\ncommutation sont proposées par les constructeurs :\n « Cut-Throught » ou « on the fly »: la retransmission peut avoir lieu dès le\ndécodage de l’adresse du destinataire. La réception et la transmission\nd’une trame se fait en même temps.\n Temps de transit minimal\n Le contrôle d’erreurs n’est pas possible\n La conversion de vitesse n’est pas possible\n « Store and Forward » : réception de la trame complète avant de pouvoir la\nretransmettre.\n Temps de latence plus importante (de l'ordre de 50 ms)\n Permet de filtrer les trames erronées\n Nécessite une mémoire tampon de grande taille\n « Adaptive Error Free » : combine de techniques précédentes. Le\ncommutateur fonctionne en « Cut-Throught » tant que le taux d’erreur\nreste acceptable et change en « Store and Forward » sinon.\nUn commutateur implémentant la norme IEEE 802.3x peut réaliser un contrôle\nde flux (en full duplex). Ce contrôle est déconseillé si la QoS est active.\n55\nL’aiguillage des trames, par auto apprentissage, se fait suivant le principe du\npontage transparent (« transparent bridging ») et en ayant recours, si\nnécessaire, au protocole « Spanning Tree » (IEEE 802.1d). Les techniques de\npontage seront étudiées dans le cadre du chapitre V.\nPour augmenter le débit entre deux commutateurs connectés entre eux (« trunk\nlinks »), plusieurs ports Ethernet peuvent être utilisés (IEEE 802.1ad).\nUn commutateur peut être de niveau 2 (comparable à un pont) ou de niveau 3\n(peut fonctionner en tant que routeur).\nFormat d’équipement concentrateur (HUB / Commutateur)\n1. \"Stand alone\"\nEntrée de gamme\nNombre limité de ports (8, 16, 24 ou 32)\n2. Empilable “Stackable”\nPossibilité de les chaîner via des câbles propriétaires\nLe tout représente une seule unité logique\nEquipements d’un même constructeur (5-8) !\nAdapté lorsque le nombre de postes est inférieur à 100\n3. Châssis (modulaire)\nPossibilité d’insérer différentes cartes (hub/switch) Ethernet (ou\nautre Token-Ring, FDDI, ATM …) fonctionnant à différents débits,\nsur des segments séparés\nNombre de cartes limité par le nombre de slots\nBus du fond de panier peut supporter jusqu’à plusieurs Gb/s\nAdapté lorsque le nombre de postes est supérieur à 100\n.\n56\nLes commutateurs peuvent (en option) permettre de définir des réseaux locaux\nvirtuels (VLAN : « Virtual LAN »). Les VLANs sont des sous-réseaux\nlogiques définis sur un même réseau physique. Il est ainsi possible de scinder\nun réseau déjà câblé en des groupes selon des critères logiques :\n- délimiter les diffusions qui sollicitent les couches supérieures pour une\nmeilleure gestion du trafic,\n- séparer les ressources selon des critères d’appartenance, de partage ou de\nsécurité (protection du backbone).\nLa structuration en VLANs permet ainsi de s’abstraire de la disposition\nphysique des stations lors de la définition des sous réseaux (réseaux\ncapillaires). Elle facilite ainsi le contrôle des domaines de diffusion, la mobilité\ndes utilisateurs et donc l’optimisation du réseau et les contrôles de sécurité.\nUn VLAN est constitué d’un sous-ensemble de stations reliées par un réseau\nEthernet virtuel. Une trame envoyée sur un VLAN n’est visible que par des\nstations qui appartiennent au même VLAN. Il est aussi possible de définir des\nstations appartenant à la fois à plusieurs VLANs. A l’intérieur d’un même\nVLAN, le commutateur réalise des opérations de pontage. La communication\nentre VLANs se fait grâce à des routeurs. Différents critères sont utilisés pour\nle regroupement des stations en VLAN : définition de groupe d’adresses MAC,\ndéfinition de groupe de ports physiques au niveau des commutateurs,\nregroupement par protocoles ...\nLes Normes 802.1p et 802.1q définissent respectivement des extensions pour :\n- La priorité au niveau MAC, qu'on appelle Classe de Service ou (CoS)\n- L'interopérabilité des réseaux locaux commutés (Virtual Bridged Local\nArea Networks): un VLAN peut s’étendre sur plusieurs commutateurs. De\nce fait, les liens « trunk » entre commutateurs véhiculent des trames qui\ns’apparentent à différents VLANs. La méthode du « tagging » est alors\nutilisée pour véhiculer l’identificateur du VLAN. Le commutateur d’accès\nmarque la trame avec le VLAN d’origine grâce à un identificateur (sur 4\noctets) qui est supprimé par le commutateur auquel est raccordé le\ndestinataire. Cet identificateur permet à un commutateur non source de\ndéterminer le port de sortie.\n57",
        "metadata": {
            "topic": "IV.1.2 Composants d'un réseau Ethernet 802.3",
            "subtopic": "IV.1.2 Composants d'un réseau Ethernet 802.3"
        }
    },
    {
        "text": "Il existe deux modèles pour pouvoir mettre en place un réseau Ethernet comportant\nplusieurs segments. Ces modèles garantissent que le diamètre du domaine de collision\nne dépasse pas la limite autorisée et permettent de respecter la contrainte de délai\ninter-trame minimal (le passage à travers un répéteur risque de réduire le délai inter-\ntrame particulièrement à cause de pertes au niveau des préambules de deux trames\nsuccessives avec un nombre de bits perdus plus important pour la première trame puis\nrestauration des préambules).\nModèle 1 : Règles de configuration\nLe réseau doit respecter certaines règles de configuration :\n- les interconnexions sont réalisées moyennant des répéteurs\n- un chemin entre deux stations peut comporter cinq segments tout au plus et\ndonc quatre répéteurs (y compris les transceivers et câbles AUI respectifs),\ndeux transceivers et deux câbles AUI.\n- les câbles AUI ne doivent pas dépasser 25m (soit 50m pour les deux câbles)\npour les médias 10Base-FP et 10Base-FL.\n- Si un chemin de transmission comporte cinq segments, deux de ces segments au\nmoins doivent être de liaison,\n- Si un chemin de transmission comporte cinq segments, tout segment FOIRL,\n10Base-FB ou 10Base-FL ne peut dépasser 500 m alors qu'un segment 10\nBASE FP ne peut dépasser 300 m.\n- Si un chemin de transmission comporte quatre segments, tout segment FOIRL,\n10Base-FB ou 10Base-FL ne peut dépasser 1000 m alors qu'un segment\n10Base-FP ne peut dépasser 700 m. Il n'existe pas de contrainte d'utilisation de\nsegments de liaison.\nExemple conforme au modèle 1 :\n58\nModèle 2 du délai d'un chemin :\nUn autre modèle de l'IEEE, pour les configurations complexes, comprend un\nensemble de règles de calcul permettant de calculer le délai d'aller-retour (RTD:\n\"round-trip Delay\") entre deux stations. Un autre ensemble de règles doit aussi être\nvérifié, il est relatif au délai inter-trame qui, s’il est en dessous de 96 temps bit,\nrisque de créer des « overrun » à la réception. Cet ensemble de règles n’est pas\nillustré dans la suite. Ces deux ensembles de règles permettent ainsi de vérifier le\nbon fonctionnement d'un réseau.\nRappel : la spécification IEEE stipule que toute station émettrice doit être notifiée\nd'une éventuelle collision durant les 512 premiers bits de l'émission impliquent que\nle RTD (Round Trip signal Delay) ne peut excéder 512 temps bit quels que soient\nles médias utilisés dans la configuration.\nDe manière à faciliter le calcul du RTD dans un environnement multi-média, le\nmodèle définit les segments gauche, droit et intermédiaire (un ou plusieurs) :\nsegment segment\nRépéte\ngauche intermédiaire\nuTrr ansceive\nrD rop segment\nMédia\ncable droit\nEn fonction du type de média composant le chemin entre deux stations, l'IEEE\nfournit les délais induits :\n59\nType de long. Segm. gauche Segm. interm. Segm. droit Délai\nsegment Max Base Max Base Max Base Max /\nmètre\n10Base5 500 11.75 55.05 46.5 89.8 169.5 212.8 0.086\n6\n10Base2 185 11.75 30.73 46.5 65.48 169.5 188.48 0.102\n6\nFOIRL 1000 7.75 107.75 29 129 152 252 0.1\n10BaseT 100 15.25 26.55 42 53.3 165 176.3 0.113\n10BaseF 1000 11.25 111.25 61 161 183.5 284 0.1\nP\n10BaseF 2000 - - 24 224 - - 0.1\nB\n10BaseF 2000 12.25 212.25 33.5 233.5 156.5 356.5 0.1\nL\nExcès 48 0 4.88 0 4.88 0 4.88 0.102\nAUI 6\nOù :\nBase = délai min. (transit de transceiver, répéteur, câble AUI de 2m, collision) pour le média\nutilisé\nDélai / mètre = temps de traversée aller-retour pour un mètre de média utilisé. Tous les\ndélais sont exprimés en temps bit.\nLe calcul du délai d’un chemin se fait de la façon suivante :\n Le délai du chemin entre deux stations est décomposé en délais de segments\nou SDV « Segment Delay Value » composant le chemin. Pour un segment\ndonné,\nSDV = Base + (longueur du segment * RTD / mètre)\n Si les segments gauche et droit sont de différents types, effectuer le calcul à\nnouveau en inversant la gauche et la droite et retenir le délai le plus long,\n Si les câbles AUI dépassent 2 m, rajouter le délai en excès,\n Ajouter une marge de 5 temps bit,\nSi le délai ainsi obtenu est  à 575 temps bit, le chemin est valide. Effectuer cette\nprocédure entre toutes les extrémités du réseau.\nLes contraintes du réseau Fast Ethernet sont différentes étant donné que le débit est\n10 fois plus élevé et qu'en conséquence le délai de propagation devrait être réduit du\nmême facteur (5,12 µs) au lieu de 51,2 µs). Un réseau Fast Ethernet est limité à deux\nrépéteurs et n'utilise que des segments de liaison. Le domaine de collision est limité à\n205 m avec du câble UTP. Dans le cas général, la limite de distance dépend du type\nde répéteur. Deux classes de répéteurs sont prévues: Class I et Class II. Pour les\nrépéteurs de Class I un seul saut de répéteur est permis. Pour les répéteurs de Class II,\ntout au plus deux sauts de répéteurs sont permis. Si un câble MII \"Medium\nIndependent Interface\" est utilisé, il ne doit pas dépasser 0.5 mètres.\n60\nAlors qu'un segment en paire torsadée ne peut pas dépasser 100 m un segment en\nfibre optique peut aller jusqu'à 412 m. La longueur d'un segment en fibre optique\nentre deux commutateurs en full-duplex peut atteindre 2000 m. Les deux Figures\nsuivantes décrivent deux exemples de configuration Fast Ethernet :\nIl existe aussi un modèle basé sur le calcul du RTD pour la validation de\nconfigurations plus complexes de réseaux Fast Ethernet. A cet effet le tableau suivant\npeut être utilisé.\nLes constructeurs peuvent aussi fournir des tableaux plus précis relatifs à l'estimation\ndes délais sur les câbles utilisés. Il est recommandé de rajouter une marge de 4 temps-\nbits au délai total qui doit être inférieur ou égal à 512 temps-bits. Remarquons aussi\nque ce deuxième modèle de validation ne prévoit pas le calcul du rétrécissement du\ndélai inter-trame étant donné que le nombre de répéteur est limité.\n61\nPour le réseau Gigabit et suivant un premier modèle de validation, le nombre de\nrépéteurs est limité à 1 et la longueur d'un segment est limité selon le type du média et\nne dépasse pas les 316 mètres. Le tableau suivant précise la longueur maximale d'un\ndomaine de collision.\nDans le cas d'une liaison full-duplex et en utilisant la fibre optique, il est possible\nd'atteindre des longueurs plus importantes comme le montre le tableau suivant.\nIl est aussi possible d'utiliser un second modèle basé sur le calcul du RTD. A cet effet\nle tableau suivant peut être utilisé.\nLes constructeurs de câbles peuvent fournir des tableaux plus précis selon le câble. Il\nest recommandé de rajouter une marge de 32 temps-bits au total (généralement\ncomprise entre 0 et 40) qui doit être inférieur ou égal à 4096 temps-bits.",
        "metadata": {
            "topic": "IV.1 Ethernet",
            "subtopic": "IV.1.3 Composition d’un réseau Ethernet multi-segments"
        }
    },
    {
        "text": "",
        "metadata": {
            "topic": "file1",
            "subtopic": "IV.2 WiFi"
        }
    },
    {
        "text": "- Cartes PCI / PCMCIA/ USB : PCI pour des ordinateurs de bureau et\nPCMCIA pour des ordinateurs portables. Il est aussi possible de raccorder la\ncarte à travers un port USB.\nCarte PCI Carte PCMCIA\n62\n- Antennes : il existe principalement 2 modèles d’antennes :\n Les antennes omnidirectionnelles (gain variant de 1 à 15 dBi2 () qui ont un\nrayonnement sur 360°. Elles s’installent sur un point d’accès relié voire sur\nune carte réseau wifi.\n Les antennes directionnelles (gain allant de 5 à 24 dBi) dont le rayonnement\nest directif. Elles permettent d’établir des liaisons point-à-point mais aussi\nde couvrir une zone limitée (antenne sectorielle : point à multipoint). Elles\nsont de plusieurs types : antennes paraboles, antennes panneaux…\nLes antennes utilisées sur les points d’accès peuvent être soit d’intérieur (la\npuissance de rayonnement est limitée, par exemple, dans la bande ISM, elle\nn'excède pas 100 mW) soit d’extérieur (la puissance de rayonnement est encore\nplus limitée, dans la bande ISM, elle n'excède pas 10 mW pour les canaux 8 à\n13).\nAntennes sectorielles\nplat demi-cylindre\nAntennes directionnelles\nYagi : entre immeubles proches Parabolique : immeubles éloignés Panneau (patch)\nLa connectique standard est de type N mais il existe d’autres connectiques\nutilisées par certains constructeurs : TNC-RP (Cisco, Linksys), SMA (Dlink).\n- Point d’Accès (AP) ou bornes sans fil : en mode infrastructure, cet\néquipement peut être assimilé à un concentrateur, il assure la communication\nentre les différentes stations WiFi (les méthodes d’accès utilisées, prévues par la\nnorme IEEE 802.11, sont décrites dans chapitres II et III). Un AP est\n2\nDeciBels Isotropes énergie moyenne rayonnée par l’antenne divisée par celle que rayonnerait une antenne idéale\n(isotropique) alimentée par la même puissance. Plus ce rapport est élevé plus l’onde est directionnelle.\n63\ngénéralement raccordé à un réseau filaire (appelé système de distribution et noté\nDS), par exemple Fast Ethernet, il permet de donner un accès à ce réseau.\nEn mode pont, ou « wireless bridge », deux réseaux (LANs utilisant\néventuellement des protocoles différents de niveau 2) peuvent être connectés\npar un lien sans fil en point à point. Les deux APs, de part et d’autre du lien\nsans fil, doivent être configurés en mode « wireless bridge ».\nUn autre mode appelé mode répéteur, ou « wireless repeater » ou encore\n« range expander »), existe et permet d’étendre la porté d’un premier AP (« root\nmode ») par un second AP (« repeater mode »). Ce dernier ne réalise qu’une\nfonction de répétition. A la différence du mode pont, les protocoles de part et\nd’autre de l’AP répéteur doivent être identiques (l’AP n’assure aucune\nconversion de format de trame). L’inconvénient est que la bande passante est\ndivisée de moitié : une première moitié est utilisée pour l’émission et l’autre\nmoitié pour la réception (double le nombre de trames). Il est conseillé de ne pas\ndépasser plus de 2 répéteurs.\nWDS, « Wireless Distribution System », est un système spécifique qui assure\nune interconnexion sans fil d’APs. Suivant WDS, un AP peut jouer l’un des\nrôles suivants :\n « Remote Base Station » permettant de prendre en charge les clients WiFi et\nde passer le trafic aux APs jouant l’un des 2 rôles suivants ;\n « Main Base Station » permettant la connexion à un réseau filaire ;\n « Relay Base Station » permettant de relayer le trafic provenant des clients\nWiFi, de « Remote Base Stations » ou d’autres « Relay Base Stations » vers\ndes AP « Main Base Station » ou « Relay Base Station ».\nDans WDS toutes les « Base Stations » doivent utiliser le même canal et la\nmême méthode/clé de cryptage. La bande passante est, de la même façon que\npour les répéteurs, divisée par 2. Le système WDS prévoit deux modes de\nconnectivité :\n le mode « Bridging » où l’AP ne communique qu’avec d’autres APs et\n Le mode « Repeating » où l’AP communique en plus avec les clients WiFi.\n64\nWDS peut être incompatible d’un produit à un autre (non certifié par la WiFi\nAlliance).\nUn AP peut aussi fonctionner en tant que routeur (interconnexion de niveau 3).\nUn routeur point d’accès peut se connecter à un autre AP et fonctionner suivant\nle mode « AP client », cependant il ne fonctionnera plus en tant que point\nd’accès, seuls les équipements connectés par un réseau filaire, à ce routeur,\npourront communiquer avec lui.\nUn AP peut être accompagné par des services supplémentaires :\n serveur DHCP,\n fonctions de pare-feu,\n authentification (IEEE 802.1x),\n Prise en charge des VLAN (IEEE 802.q),\n Modem ADSL.",
        "metadata": {
            "topic": "IV.2 WiFi",
            "subtopic": "IV.2.1 Composants d’un réseau WiFi"
        }
    },
    {
        "text": "La zone couverte et le débit dépendent des distances entre les équipements réseaux et\ndes obstacles entre les équipements (murs, meubles, interférences avec d’autres\nréseaux Wi-Fi sur des bandes adjacentes, bluetooth, fours à micro ondes, autres\néquipements utilisant la bande ISM, personnes …). Notons que si dans un réseau, un\nseul équipement est éloigné et ne peut communiquer qu’à 1MBits/s alors les\ninformations de contrôle pour l’ensemble du réseau sont transmises à 1Mbits, donc\nl’ensemble du réseau est ralenti.\nLes valeurs typiques (mais tout dépend de l’antenne : puissance, gain …) de la vitesse\nen fonction de la distance à l’intérieur et à l’extérieur pour les réseaux IEEE 802.11b\nsont données par le tableau suivant :\nDébit Distance à l'intérieur Distance à l'extérieur\n11 Mbits/s 50 m 200 m\n5,5 Mbits/s 75 m 300 m\n2 Mbits/s 100 m 400 m\n1 Mbits/s 150 m 500 m\nPour les normes IEEE 802.11a/g, la portée des réseaux à plus haut débit est cependant\nmoindre. Le tableau suivant donne les valeurs typiques de la vitesse théorique en\nfonction de la distance à l'intérieur pour la norme IEEE 802.11g.\nDébit Distance à l’intérieur Distance àl’extérieur\n54 Mbits/s 27 m 75 m\n48 Mbits/s 29 m 100 m\n36 Mbits/s 30 m 120 m\n24 Mbits/s 42 m 140 m\n18 Mbits/s 55 m 180 m\n9 Mbits/s 75 m 250 m\n6 Mbits/s 90 m 400 m\n65",
        "metadata": {
            "topic": "IV.2 WiFi",
            "subtopic": "IV.2.1 Couverture et débit"
        }
    },
    {
        "text": "La mise en place d'un réseau local nécessite des travaux de câblage. C'est d’ailleurs le\ncas pour les systèmes téléphonique, vidéo, électrique ou encore de contrôle d'accès.\nLe câblage comprend la pose des câbles, des boîtiers et des prises et la mise en place\ndes sous-répartiteurs. Il faudra donc préalablement déterminer les emplacements des\nprises et les chemins adéquats en fonction du plan du bâtiment, des bureaux à\ndesservir, des sources de bruits comme les lignes de courant fort (exemple de règles\nde câblage : distance d’au moins 30 cm si le câble réseau doit passer en parallèle avec\nun câble courant fort sur une distance de 20 m) ...\nDeux solutions peuvent être envisagées : le post-câblage ou le pré câblage. Le post-\ncâblage est réalisé pour des besoins bien précis et évolue à la demande suivant ces\nbesoins. Cette solution est souvent opérée pour les bâtiments déjà construits. Par\ncontre, le pré câblage consiste à effectuer les opérations de câblage d'une façon à\ndesservir systématiquement tout le bâtiment, même les locaux non prévus par les\nbesoins actuels. Les possibilités de connexion (types de prises) doivent être les\nmêmes dans tous les bureaux. Une autre caractéristique importante à la quelle doit\nrépondre le pré-câblage est la reconfigurabilité, c'est à dire, la possibilité de réutiliser\nle câblage pour différents types de réseaux locaux et différents schémas de câblage\n(bâtiment intelligent). D'autre part, pour réduire les coûts d'installation, il convient\nd'intégrer la transmission de la voix, des données et des images dans une même\nopération de câblage. Les industriels recommandent d'utiliser des câbles différents\npour la téléphonie et pour l'informatique car cette dernière nécessite de plus en plus\nune qualité supérieure permettant des débits importants (câblage non banalisé).\nExemple le câblage d'IBM : câblage du réseau informatique d'établissement avec la\nfibre optique, câblage du réseau téléphonique avec le type 3, câblage du réseau\ncapillaire avec la paire torsadée catégories 5 ou 6. A l’inverse, avec les réseaux RNIS\nle câblage est banalisé.\nOn estime que le coût d'installation d'une prise pré-câblée est de 200 D à 400 D\n(selon le type de prise : pour téléphone, pour ordinateur ou les deux). Ce coût est\nmultiplié de plus de 3 fois (voire même 7 fois) pour un post-câblage. Notons aussi que\ndans ces coûts, la main d'œuvre compte pour à peu près la moitié. Par rapport au\ncoût total du matériel, on estime que le coût des câbles est d'environ 35 %, la\nconnectique 15 %, l'infrastructure 45 % et 5 % d'autres frais divers.\nLe plan de câblage s'organise en deux parties : un câblage vertical ou d'établissement\n(BAN) et un câblage horizontal ou départemental (DAN). Ces deux types de câblage\nsont articulés grâce aux répartiteurs.\n66",
        "metadata": {
            "topic": "file1",
            "subtopic": "IV.3 Plan de câblage"
        }
    },
    {
        "text": "Pour le câblage départemental, la topologie physique retenue est l'étoile où l'élément\ncentral est un répartiteur situé dans un local technique (d’étage) avec les équipements\nactifs. Le rayon couvert par le répartiteur est de 100 m (L'ANSI recommande 295\npieds). Le nombre de prises à installer est d'une pour une surface comprise entre 6 m2\net 12 m2.\nUn panneau de brassage permet d'interconnecter les différents câbles provenant des\néquipements actifs (MAU, routeur, pont, répéteurs,...), du câblage horizontal et du\ncâblage vertical (rocade). Le brassage permet de modifier les liaisons physiques par le\nsimple déplacement de jarretières, d'où les possibilités de reconfiguration. Il existe\naussi des panneaux de brassage électroniques (matrice de commutateurs) capable\nd'effectuer les opérations de brassage d’une façon programmée (figure 3).\nLe choix de la prise RJ45 s'est imposé. En ce qui concerne le câble c'est la paire\ntorsadée qui est utilisée. Le câble UTP convient pour les réseaux actuels (Fast et\nGigabit Ethernet). Le câble STP est aussi conseillé pour des évolutions futures (au-\ndelà du Gigabit). Le câble SFTP est meilleur mais n’est pas nécessaire surtout lorsque\nle budget est limité. La catégorie 5 est la plus courante, elle est capable de supporter\nle Gigabit Ethernet en utilisant quatre paires (250 Mbit/s par paire). Il faut cependant\nque l’installation soit bien testée selon la norme TSB-95. Les nouvelles installations\ndevraient être de catégorie 6 (supportant le gigabit).\nDistance recommandées) (EIA/TIA-568A /ISO 11801) :\nEquipements passifs (armoires (baies,) panneaux de brassage, chemins de câbles,\ngoulottes, prises) :\nPanneau\n67\nPanneau (connexion des câbles provenant des prises)\nBaies au sol ou mural\nChemins de câbles\nGoulotte et prises\n68",
        "metadata": {
            "topic": "IV.3 Plan de câblage",
            "subtopic": "IV.3.1 Câblage départemental"
        }
    },
    {
        "text": "Une rocade relie deux locaux techniques entre eux. Elle est constituée d’un câble, ou\nd’un faisceau de câbles, de type paire torsadée ou fibre optique (le câble coaxial n’est\nplus utilisé).\nLe choix de la fibre optique se justifie pour aller au-delà de 90m, il se justifie aussi\nlorsque on doit passer par des milieux assez perturbés (d’un bloc de bâtiment à un\nautre, particulièrement, dans le cadre d’un campus). La fibre optique et plus\nappropriée pour les évolutions futures. La fibre multimode, de plus faible coût, est la\nplus utilisée, cependant lorsque les distances sont importantes (à l’échelle d’un\ncampus), la fibre monomode s’avère appropriée.\nDans une rocade, il est important de prévoir un faisceau de câbles (redondants) et ceci\nafin d’augmenter les possibilités de configuration, d’une façon indépendante de la\ndisposition physique des équipements. Une rocade paires torsadées devrait comporter\n25% des paires distribuées (32 paires au minimum), une rocade optique devrait\ncomporter le double des besoins (6 fibres minimum).\nLes locaux techniques d’étages sont généralement reliés à un local technique\nprincipal dit local nodal (et même à 2 locaux nodaux pour des raisons de redondance).\nL’interconnexion des locaux techniques par des rocades peut se faire suivant une\nchaîne, une boucle, une étoile ou tout autre schéma d’interconnexion. La figure\nsuivante décrit un plan de câblage typique pour un réseau de campus.",
        "metadata": {
            "topic": "IV.3 Plan de câblage",
            "subtopic": "IV.3.2 Câblage d'établissement"
        }
    },
    {
        "text": "Il existe des normes (ISO, EIA/TIA,...) concernant les performances mécaniques et\nélectriques d’un pré câblage (prises, câbles horizontaux / verticaux, jarretière,...). Il\n69\nexiste aussi des normes concernant la compatibilité électromagnétique des\néquipements avec leur environnement électromagnétique. La validation du câblage se\nfait par :\n- un examen visuel : nombre, emplacement et type des prises installées ; dans les\nlocaux techniques : ventilation, revêtement, alimentation, terre, différenciation des\nraccordements (ex. code couleur, étiquetage),...\n- des tests statiques : grâce à un oscilloscope on peut visualiser et mesurer les\ntemps de monter de descente d'un signal ; grâce à un réflectomètre (échomètre) on\npeut mesurer sur un brin les points de variation de l'impédance (ex. raccordement)\net en conséquence la continuité des conducteurs,...\n- des tests dynamiques : grâce à des valises de test et / ou des analyseurs de\nréseaux on peut effectuer des tests au niveau MAC, comme par exemple le\ncomptage des trames, des collisions, des trames en erreurs ...\nIl existe différents appareils de test et de validation :\n- Echomètre : mesure de la distance du défaut en mètres ou en temps\n- Certificateur de câbles (selon catégorie) : longueur, temps de propagation,\natténuation, atténuation para diaphonique (Next), impédance moyenne\n- Qualificateur LAN : selon la nature du réseau Ethernet 10/100/1000, qualifie la\ncapacité d'un réseau à supporter des applications comme voix sur IP ou vidéo\nsur IP.\nEchomètre Certificateur de câbles Qualificateur LAN\n70",
        "metadata": {
            "topic": "IV.3 Plan de câblage",
            "subtopic": "IV.3.3 Validation du câblage"
        }
    },
    {
        "text": "Ce chapitre est consacré à l’étude de l’interconnexion des réseaux locaux entre eux,\nces derniers peuvent être sur un même site ou sur des sites distants, auquel cas, il est\nnécessaire de recourir à une liaison spécialisée ou un réseau intermédiaire\nmétropolitain ou étendu.\nSelon l’hétérogénéité des réseaux locaux, l’équipement d’interconnexion doit réaliser\ncertaines opérations d’adaptations, de conversions pour faire passer une unité de\ndonnées d’un réseau à un autre. Les opérations ainsi réalisées peuvent être effectuées\nà différents niveaux du modèle de référence OSI. La figure 1 donne une classification\ndes équipements d’interconnexion selon les niveaux par rapport auxquels ils peuvent\nagir.\nApplication\nPrésentation\nPasserelle de\nniveau\nSession\nApplication\nTransport …\nExemple :\nle courrier\nRéseau\nPasserelle\nélectronique,\nde niveau\nLiaison\nRouteur\nconversion\ntransport\nPont SMTP/X400.\nPhysique Répéteur\nFigure 1 : classification des équipements d’interconnexion\nCe chapitre se limite à l’étude des répéteurs, des ponts et aborde l’utilisation des\nrouteurs.\n71",
        "metadata": {
            "topic": "VV.. IInntteerrccoonnnneexxiioonn ddeess rréésseeaauuxx llooccaauuxx",
            "subtopic": "VV.. IInntteerrccoonnnneexxiioonn ddeess rréésseeaauuxx llooccaauuxx"
        }
    },
    {
        "text": "",
        "metadata": {
            "topic": "file1",
            "subtopic": "V.1 Les répéteurs"
        }
    },
    {
        "text": "Un répéteur agit au niveau physique, il se limite à retransmettre les bits d’un médium\nà un autre. Le signal est ré-amplifiée (régénérée) mais aucune interprétation des\ndonnées n’est effectuée.\nL’utilité d’un répéteur provient du fait que la longueur du médium de transmission est\nen générale limitée ou aussi pour interconnecter deux supports de types différents\n(exemple : paire torsadée et câble coaxial).",
        "metadata": {
            "topic": "V.1 Les répéteurs",
            "subtopic": "V.1.1 Définition"
        }
    },
    {
        "text": "- Dans le cas d’une méthode d’accès CSMA/CD, le répéteur doit être capable de\ndétecter et de propager une collision. De plus, le répéteur introduit un retard dont-il\nfaut tenir compte au niveau de la tranche canal.\n- Un répéteur s’utilise entre des segments ayant un même débit, il n’a donc pas besoin\nd’espace mémoire tampon.\n- Un répéteur distant est constitué de deux demi-répéteurs reliés par un câble\n(exemple de la fibre optique) couvrant une certaine distance séparant les deux\nsegments de réseau.\n- Des équipements tels que les concentrateurs, HUB ou commutateurs peuvent\nréaliser la fonction de répétition.\n- Un répéteur n’a pas besoins d’être configuré.",
        "metadata": {
            "topic": "V.1 Les répéteurs",
            "subtopic": "V.1.2 Propriétés"
        }
    },
    {
        "text": "",
        "metadata": {
            "topic": "file1",
            "subtopic": "V.2 Les ponts"
        }
    },
    {
        "text": "Un pont (« bridge ») agit au niveau liaison, il réalise une opération de filtrage qui\nconsiste à examiner chaque trame pour décider s’il doit la recopier vers un réseau\ndestination (« forwarding ») de façon à éviter la retransmission d’une trame vers un\nréseau où le destinataire ne figure pas.\nLe recours à un pont, en subdivisant un réseau Ethernet en plusieurs sous-réseaux,\npermet de réduire le taux de collision. Dans le cas d’un réseau Token-Ring, une telle\nsubdivision réduit le temps de rotation du jeton. De plus, il est possible d’effectuer\nplusieurs transmissions en même temps. Ainsi, le recours aux ponts permet un\nmeilleur contrôle du trafic. Par ailleurs, la décomposition d’un réseau en plusieurs\nsous-réseaux, limite les effets d’une panne à un sous-réseau uniquement et protège les\n72\nsous-réseaux entre eux contre les écoutes malveillantes. Un pont est aussi utile pour\nremédier aux limites, de point de vue taille du réseau, imposées par certains réseaux.",
        "metadata": {
            "topic": "V.2 Les ponts",
            "subtopic": "V.2.1 Définition"
        }
    },
    {
        "text": "- La transmission à travers l’un des ports (interface LAN) d’un pont s’effectue suivant\nla méthode d’accès au support de transmission (auquel est connecté le port).\n- La retransmission d’une trame n’est pas immédiate. Le pont doit analyser l’entête de\nla trame et, selon la méthode d’accès, attendre un certain délai pour pouvoir accéder\nau support de transmission. Il est donc nécessaire que le pont dispose d’une mémoire\ntampon. Des problèmes de congestion risquent de se manifester. Lorsque la mémoire\ntampon est épuisée, une solution consiste à ce que le pont envoie des demandes de\n« pause » pour une certaine durée (IEEE 802.3x).\n- Un pont n’a pas besoin d’une adresse MAC, néanmoins on peut lui associer une\nadresse MAC (par interface LAN) utile pour la fonction de filtrage (cf. §VI.2.3). Un\npont peut aussi disposer d’une adresse réseau utile pour des fonctions\nd’administration du pont.\n- Un pont peut interconnecter deux ou plusieurs sous-réseaux.\n- Un pont distant est constitué de deux demi-ponts reliés par une liaison couvrant une\ncertaine distance séparant les deux sous-réseaux. Par exemple, la liaison peut être une\nliaison HDLC (respectivement un circuit virtuel X.25), une trame MAC est alors\nencapsulée dans une trame HDLC (respectivement, un paquet X.25).\n- Lorsque les protocoles au niveau MAC sont différents, des opérations de translation\net d’adaptation doivent être réalisées, cf. §V.2.4 (« Translating Bridge »).\n- Lorsqu’un pont est capable de fonctionner sans que les stations, connectées aux\nréseaux reliés par le pont, ne se rendent compte de la présence du pont, le pont est dit\ntransparent (« Transparent Bridge »). Un pont transparent connecte généralement des\nréseaux utilisant les mêmes protocoles MAC.",
        "metadata": {
            "topic": "V.2 Les ponts",
            "subtopic": "V.2.2 Propriétés"
        }
    },
    {
        "text": "Lorsqu’une trame passe par l’une des interfaces d’un pont, ce dernier doit décider s’il\nfaut retransmettre cette trame à travers une autre interface ou non. Une première\nsolution serait d’utiliser des tables de routage fixe chargées initialement. Cette\nsolution est simple à mettre en œuvre mais présente un inconvénient majeur, celui de\nnécessiter une phase de configuration préalable du pont.\nDans la suite de cette section nous étudions différents algorithmes dit de filtrage (ou\n« forwarding » ou encore de pontage).\n73\nFiltrage transparent par apprentissage des adresses\nLe pont reste à l’écoute sur ses différentes interfaces (« promiscous mode »). A\nchaque interface du pont est associée une table qui maintient l’ensemble des adresses\nMAC sources des trames observées sur cette interface. Ces tables, initialement vides,\nsont mises à jour dynamiquement à la mise en marche du pont. Une trame est\nredirigée à travers une interface (autre que celle d’où provient la trame) si la table\nassociée à cette interface comporte l’adresse MAC destination de la trame. Si aucune\ntable ne comporte cette adresse, la trame est diffusée sur les différentes interfaces\n(sauf sur l’interface d’où provient la trame).\nLa durée de vie des entrées dans une table doit être limitée car une station peut être\néteinte ou même déplacée vers un nouveau sous-réseau. A cet effet, à chaque entrée\nd’une table est associé un délai de garde. Une entrée de la table disparaît si la station,\nayant l’adresse MAC maintenue par cette entrée, ne transmet aucune trame durant le\ndélai de garde. Le temporisateur (par défaut, 20 sec.) associé à une adresse MAC est\nsystématiquement réarmé à chaque fois qu’une trame, issue de cette adresse, est\nobservée (cette adresse peut changer d’une table à une autre). Le pont est ainsi\ncapable de mettre à jour ces tables par auto-apprentissage, il est donc transparent.\nL’algorithme décrit n’est pas valable si le réseau comporte une boucle de ponts (cf.\nfigure 2). Supposons qu’une trame est émise par la station 1 vers la station 2, les deux\nponts A et B mettent à jour leurs tables puis retransmettent la trame. La station 2 va\nrecevoir deux copies de la trame, bien plus, les ponts A et B vont supposer que la\nstation 1 est raccordée au segment Y. Les algorithmes décrits dans ce qui suit traitent\nle problème des boucles.\nRemarque : Le recours à des boucles est nécessaire lorsqu’on veut réaliser des\nchemins alternatifs afin de distribuer la charge de communication ou aussi pour une\nmeilleure tolérance aux pannes.\n74\nStation 1\nSegment X\nPont A Pont B\nSegment Y\nStation 2\nFigure 2 : exemple de réseau comportant une boucle\nAlgorithme de l’arbre recouvrant « spanning tree »\nPrincipe :\nUne solution au problème posé par les boucles est de déterminer un arbre recouvrant\nle réseau. Les nœuds de l’arbre représentent les ponts et les arêtes représentent les\nsous-réseaux. Les ponts ne peuvent ainsi router qu’à travers les arêtes de l’arbre.\nCet Algorithme, décrit dans la spécification IEEE 802.1D, a été retenu pour\nl’interconnexion des réseaux IEEE 802.3.\nConstruction de l’arbre :\n- L’algorithme est distribué, il s’exécute sur les différents ponts du réseau.\n- A chaque pont est attribué un identificateur (niveau de priorité (2 oct.) adresse\n+ adresse MAC) unique dans le réseau. Le pont, ayant la plus petite\nidentification, est élu racine de l’arbre. Initialement chaque pont se considère\ncomme étant la racine de l’arbre.\n- Chaque port (interface) d’un pont sera identifié par un numéro (niveau de\npriorité (2 oct.) adresse + adresse MAC).\n- Le coût d’une route est comptabilisé en nombre en nombre de sauts et/ou\ndépendant du débit des ports (inversement proportionnelle au débit de\nl'interface d'un port = 1000 / débit (en Mbits/s))\n- Au niveau de chaque pont et lors de la détermination d’une route vers la racine,\nle choix de la route se fait en retenant le plus court chemin. S’il existe plusieurs\n75\nroutes de même coût, la route choisie est celle qui passe par le pont de plus\nfaible identité. Si en plus plusieurs meilleures routes passent par un même pont,\nla route choisie est celle qui passe par le port de plus faible numéro.\n- Les ponts échangent entre eux des messages de configuration traduisant des\npropositions de routes vers une racine supposée (pouvant différer d’un pont à\nun autre). Ces messages comportent les informations suivantes :\n l’identité supposée de la racine,\n le coût de la route vers la racine,\n l’identité du pont ayant émis le message,\n le numéro du port à travers lequel le message est émis.\n- Chaque pont maintient la meilleure configuration trouvée (CONFIG). Celle-ci\nest décrite comme suit :\nCONFIG = [ identité supposée de la racine,\ncoût de la route vers cette racine,\nidentité du pont local,\nnuméro du port vers la racine ]\n- A chaque port est associée un meilleur message de configuration observé sur ce\nport. Soient C=(c1,c2,c3,c4) et D=(d1,d2,d3,d4) deux messages de\nconfiguration, le message C est meilleur que D si :\n[c1<d1] ou [(c1=d1) et (c2<d2)] ou [(c1=d1) et (c2=d2) et (c3<d3)] ou\n[(c1=d1) et (c2=d2) et (c3=d3) et (c4<d4))].\n- Un port, mis à part celui menant vers la racine, ayant une meilleure\nconfiguration (et si celle-ci correspond à un message envoyé par un pont voisin\net non le pont local) que CONFIG est désactivé (une fois que le meilleur\nmessage associé au port a été déjà pris en compte dans le calcul de CONFIG).\nLa désactivation a lieu une fois que les ponts arrivent à un état stable, elle est en\nconséquence retardée 15 secondes.\n- Périodiquement et à chaque modification de CONFIG, un message de\nconfiguration est envoyé à travers les différents ports. Le pont est ainsi capable\nde tenir compte des modifications (de la topologie, des priorités …) affectant le\nréseau.\nExemple : voir la figure 3 et 4.\nCritiques :\n- Facilité d’installation grâce au fonctionnement transparent des ponts. Les\nstations n’interviennent pas dans l’exécution de l’algorithme de routage.\n76\n- Sous utilisation du réseau : les routes alternatives ne sont pas utilisées (cf.\nfigure 4).\n- Les ponts les plus proches de la racine risque d’être des goulots d’étranglement.\n- Tel qu’il est décrit, l’algorithme est mal adapté pour les réseaux de grandes\ntailles, le temps de calcul de l’arbre devient important. Un partitionnement du\nréseau est alors nécessaire.\n10\nSous-réseau 2 Sous-réseau 4 Sous-réseau 1\n11 15 16 50\nSous-réseau 3 Sous-réseau 5\n20\nFigure 3 : arbre résultant\n77\nLégende :\n50,0,50,1 50,0,50,2\n(x,y,z,t) message de config.\n>10,0,10,1 50,0,50,0 >11,0,11,2\n10,1,50,1 10,1,50,1 10,1,50,2\n>(x,y,z,t) : meilleur message\n>10,1,11,2\nde config. retenu sur le port.\nS\no\nCONFIG\nu\n: désactivation d’un port s\n-\nr\né\nSous-réseau 1\ns\ne\na\nu\n10,0,10,1\n11,0,11,1 11,0,11,2\n>10,0,10,1\n2 >10,0,10,2 11,0,11,0 >11,0,11,2\n10,1,11,1 10,1,11,1 10,1,11,2\n10,0,10,0\n10,0,10,2 >10,1,11,2\n>10,0,10,2\n10,0,10,3\n>10,0,10,3\nS\nSous-réseau 4 o\nu\ns\n-\nr\né\ns\n15,0,15,1 16,0,16,1 e\na\n>10,0,10,3 >10,0,10,3\nu\n10,1,15,1 10,1,16,1\n3\n15,0,15,0 16,0,16,0\n10,1,15,1 10,1,16,1\n15,0,15,2 16,0,16,2\n>15,0,15,2 >15,0,15,2\n10,1,15,2 10,1,16,2\n>10,1,15,2 >10,1,15,2\n20,0,20,2\n20,0,20,1 20,0,20,0\n>11,0,11,2\n>15,0,15,2 11,1,20,2\n11,1,20,2\n11,1,20,1 10,2,20,2\n>10,1,11,2\nSous-réseau 5 >10,1,15,2\n10,2,20,2\nFigure 4 : exemple de déroulement de l’algorithme « spanning tree »\n78\nAlgorithme de routage par la source « source routing »\nSuivant cet algorithme de routage, le choix de la route vers une destination est laissé à\nla charge de la source. Celle-ci envoie une trame d’exploration en diffusion afin\nd’explorer toutes les routes « All Path Explorer ». A chaque passage par un pont,\ncelui-ci rajoute son identification ainsi que l’identification du sous-réseau source (en\nconservant l’ordre de passage par les différents ponts déjà traversés). Par la suite, le\npont retransmet la trame sur tous ses ports sauf d’où est parvenue la trame. Si une\ntrame d’exploration revient à un pont, elle est éliminée. Le destinataire répond à\nchacune de ces trames d’exploration par une autre trame qui suit la même route que la\ntrame d’exploration mais en sens inverse. La source choisit une route. Elle insère\ndans une trame de donnée la route retenue.\nFormat d'une trame (LLC/source routing/IEEE 802.5)\nSD\nAC\nFC\nAdresse destination\nAdresse source\nInformation de routage\n- 3 bits: type=(data, All Path Explorer, Null1…)\n- 5 bits: long. de la route en nombre d’éléments à traverser\n- 1 bit sens d’interprétation (du premier élément ou\ninversement)\n- 3 bits taille maximale d’une trame\n- suite d’éléments : (élément1, élément2, élément3, …)\noù élément est décrit par le couple (12 bits :numéro du sous-\nréseau, 4 bits: numéro du pont (relatif au LAN))\nChamp information\nFCS\nED\nFS\n1 Non pris en compte par les ponts.\n79\nLe choix d’une route peut s’effectuer suivant différents critères, par exemple : la route\nindiquée par la première trame en réponse, la route la plus courte, alternance des\nroutes. Les routes sont recalculées périodiquement.\nExemple : voir la figure 5.\n1\nS\nSous-réseau 1\nS\no\nu\ns\n- 2\nr …\n4 … é …\ns\ne\na\nu\n2\nS\nSous-réseau 4 o\nu\ns\n-\nr\nD é\ns\ne\na\nu\nignoré\n3\n6 5\n3\n…\n…\nSous-réseau 5\nFigure 5 :exemple de routes suivies par une trame d’exploration\n80\nCritiques :\n- L’algorithme optimise les routes dynamiquement et a la possibilté d’exploiter\nplusieurs chemins alternatifs.\n- L’algorithme est non transparent, les stations doivent participer à l’exécution de\nl’algorithme de routage. Le traitement des pannes est aussi pris en charge par\nles stations.\n- Une en-tête supplémentaire se rajoute au niveau de chaque trame.",
        "metadata": {
            "topic": "V.2 Les ponts",
            "subtopic": "V.2.3 Algorithmes de filtrage"
        }
    },
    {
        "text": "Lors de l’association, un AP maintient la table des associations ainsi que la table des\ncorrespondances adresses MAC port (1=Ethernet, 2=PC card/Slot-A, 3=PC card/Slot-\nB, 4-15=WDS ports)\nCas d’un BSS\n81\nCas d’un ESS\nCas d’un WDS\n82",
        "metadata": {
            "topic": "V.2 Les ponts",
            "subtopic": "V.2.4 Relayage des trames à travers les points d’accès"
        }
    },
    {
        "text": "Outre les fonctions de filtrage et de relayage (pontage), un pont doit réaliser des\nopérations d’adaptation, dit de translation, de trames et ceci lorsque les protocoles de\nniveau MAC sont différents (entre les réseaux connectés par le pont). Parmi ces\nopérations de translation nous avons le reformatage des trames. La taille maximale\nd’une trame doit être la même pour les différents réseaux interconnectés par un pont\n(au risque de ne pas pouvoir envoyer des trames trop longues). La solution est alors\nde fixer, sur chaque station, la taille maximum d’une unité de transfert (MTU) au\nminimum des tailles maximums supportées par différents réseaux interconnectés.\nPar ailleurs, quelque soit la taille de la mémoire tampon, un pont risque de se\ncongestionner lorsqu’il interconnecte des réseaux ayant des capacités de transmission\ndifférentes. Le recours à la norme IEEE 802.3x permet de retarder l’envoi de trames\nvenant d’un pont u d’une station en amont et ainsi résoudre le problème de surcharge.\nDans la suite de cette section, nous allons prendre comme exemple le cas d’un point\nd’accès (AP) qui relie un réseau Wifi à un réseau Ethernet. L’AP est considéré\ncomme un pont, il doit effectuer un « mapping » entre :\n- les champs d’une trame Wifi+entête LLC du coté Wifi, d’une part, et\n- les champs d’une trame Ethernet uniquement s’il s’agit d’une trame de type 2\n(DIX) ou les champs d’une trame Ethernet+entête LLC s’il s’agit d’une trame\nIEEE 802.3, d’autre part.\nNotons que ce « mapping » est plus simple lorsqu’il s’agit d’une trame Wifi avec une\ntrame IEEE 802.3 (puisque nous retrouvons dans ces deux trames l’entête LLC\nencapsulé).\nUne trame Ethernet 2 est la même que celle décrite par IEEE 802.3 sauf que le champ\nlongueur (2 octets) est remplacé par un champ type qui sert à l'aiguillage vers le\nprotocole destination du niveau supérieur (exemple, IP : 0x0800, X.25 : 0x0805,\nARP : 0x806). Les valeurs de ce champ sont supérieures à 1500 et donc les trames\nEthernet et IEEE 802.3 peuvent coexister sur le même support. La couche LLC\nn'existe pas. C'est la couche de niveau supérieur qui élimine les bits de bourrage.\n83\nPaquet IP Paquet IP\ntype = 0x800\ntype\nTrame SNAP\n0x800\nSSAP=D\nSAP\n0xAA Trame LLC\nlong <=1500\ntype/long. Suite de la Trame Ethernet/802.3\nFigure 6 : différents cas d’encapsulation\nEtant donné que les réseaux Ethernet 2 sont venus avant les réseaux IEEE 802.3 et\nqu'ainsi les logiciels de niveau supérieur (notamment ceux associés à TCP/IP) ont été\ndéveloppés pour les réseaux Ethernet 2, il a fallu pour les réseaux IEEE 802.3 utiliser\nun protocole supplémentaire SNAP « Sub-Network Access Protocol », entre la\ncouche LLC et la couche réseau introduisant ainsi une nouvelle encapsulation (figure\n6). Un entête SNAP est composé de :\n- 3 octets pour coder t l’OUI (IEEE Organizationally Unique Identifier)\n- 2 octets : identification d’un protocole\nSuivant la RFC 1042, lorsque les 3 octets codant le OUI sont à zéro (00 00 00), les\ndeux octets qui suivent codent le champ « type » de la trame Ethernet 2. Il est ainsi\npossible pour un pont d’effectuer une conversion entre une trame Ethernet 2 et une\ntrame encapsulant LLC sans perdre la valeur du champ « type ». Cependant, un\nproblème se pose, il vient du fait qu’Apple et Novell ont utilisé pour leur protocoles\n(AARP : « AppleTalk Phase 2 Address Resolution Protocol » et IPX : « Internetwork\nPacket eXchange ») les entêtes SNAP de la RFC1042. La norme IEEE 802.1H traite\nce problème comme le décrit les paragraphes qui suivent.\nLorsqu’une trame vient d’un réseau Ethernet et doit passer à un réseau Wifi trois cas\nse posent :\n- si le format de la trame est celui de l’Ethernet 802.3 les entêtes LLC/SNAP\nrestent intacts.\n84\n- si le format de la trame est celui de l’Ethernet 2 et le champ type est différents\nde 0x80F3 (AARP) et de 0x8137 (IPX), le point d’accès convertit la trame en\nune trame IEEE 802.11 et rajoute les entêtes LLC/SNAP conformément à la\nRFC 1042 :\n- si le format de la trame est celui de l’Ethernet 2 et le champ type est égal à\n0x80F3 (AARP) ou à 0x8137 (IPX), le point d’accès convertit la trame en une\ntrame IEEE 802.11 et rajoute les entêtes LLC/SNAP conformément au\nprotocole (BTEP) « Bridge Tunnel Encapsulation Protocol » :\nRemarques :\n- chaque pont maintient une table appelée STT : « Selective Translation Table »\ncontenant la liste des protocoles qui doivent être translatée d’une manière\nsélective. Cette table contient des entrées relatives aux protocoles AARP et IPX\nou uniquement le protocole AARP (car il est généralement possible de\nreconfigurer les stations utilisant IPX pour éviter qu’ils ne posent des\nproblèmes lors de la suppression de l’entête SNAP/RFC 1042).\n- Une station connectée au réseau Wifi doit disposer d’un pilote capable de traiter\nles différents empilements de protocoles possibles. Ce pilote offre une interface\nsemblable à celle de l’Ethernet.\nLorsqu’une trame vient d’un réseau Wifi vers un réseau Ethernet, l’un des cas\nsuivants s’applique :\n- si la trame dispose d’un entête SNAP/BTEP (commençant par 0xAA-AA-03-\n00-00-F8), elle est décapsulée en une trame Ethernet type 2 dont le champ type\nest repris à partir des 2 derniers octets de l’entête SNAP.\n- si la trame dispose d’un entête SNAP/RFC 1042 (commençant par 0xAA-AA-\n03-00-00-00) et si les 2 derniers octets de l’entête SNAP ne sont pas dans la\ntable STT, la trame est décapsulée en une trame Ethernet type 2 dont le champ\ntype est repris de l’entête SNAP.\n85\n- si la trame dispose d’un entête SNAP/RFC 1042 (commençant par 0xAA-AA-\n03-00-00-00) et si les 2 derniers octets 2 derniers octets de l’entête SNAP sont\ndans la table STT, la trame n’est pas décapsulée elle reste conforme au format\nIEEE 802.3 et les entêtes LLC/SNAP restent intacts.\n- Tout autre entête passe intacte dans le réseau Ethernet.",
        "metadata": {
            "topic": "V.2 Les ponts",
            "subtopic": "V.2.5 Translation de trames"
        }
    },
    {
        "text": "Un routeur agit au niveau réseau, il permet d’acheminer des paquets en fonction de\nl’adresse réseau du destinataire.\nLa figure 6 décrit un exemple d’interconnexion d’un réseau local à un réseau FR\n« Frame Relay ». Toutes les machines hôtes utilisent le protocole IP au niveau de la\ncouche réseau. Les trames FR sont utilisés pour encapsuler les paquets IP et ainsi les\nvéhiculer.\n…\nIP\nFR\nIP\nLLC LLC FR\nMAC MAC\nPHY PHY\nRéseau\nFR\nFR\nAutre LAN\nFigure 7 : interconnexion D’un LAN à travers un réseau FR\nIl est aussi utile d’interconnecter différents sous-réseaux locaux entre eux à travers un\nrouteur. Comparé au recours à un pont, il ainsi possible de s’abstraire des opérations\nd’adaptation à effectuer au niveau MAC entre des réseaux de types différents.\n86",
        "metadata": {
            "topic": "file1",
            "subtopic": "V.3 Les routeurs"
        }
    },
    {
        "text": "Un pont_routeur (« Bridge_router » ou « B_router ») agit au niveau de la couche\nréseau tant qu’il reconnaît les protocoles de ce niveau, il se comporte comme un pont\ndans le cas contraire.\nPrincipales caractéristiques :\n- Un routeur dispose de plusieurs ports LAN et / ou WAN. Chaque port LAN lui est\nassocié une adresse MAC.\n- Un routeur peut supporter différents protocoles de routage (RIP, EGP, OSPF…), le\nprotocole étant fixé au moment de la configuration. De même, un pont_routeur peut\nsupporter différents protocoles de filtrage (« Source Routing », « Spanning Tree »).\n- Il existe des routeurs multi-protocoles prenant en charge différents protocoles : IP\n(DoD), IPX (Novell), X25 (ISO), XNS (Xerox), …\n- Un routeur a besoin d’une mémoire tampon pour le stockage temporaire des\nmessages en transit.\n- Certains routeurs permettent de gérer des priorités entre les différents protocoles de\nniveau réseau.\n- Un routeur est configuré grâce à un terminal qui lui est relié directement, ou aussi, à\ntravers le réseau via un terminal virtuel.",
        "metadata": {
            "topic": "file1",
            "subtopic": "V.4 Les pont_routeurs"
        }
    },
    {
        "text": "Exercice 1\nDérouler l’algorithme du « spanning tree » sur l’exemple de la figure 3 en remplaçant\nle pont numéroté 50 par un pont numéroté 14 et le pont numéroté 11 par un pont\nnuméroté 21. Décrire l’arbre résultant.\nExercice 2\nSuivant l’algorithme du « source routing », donner toutes les routes passant par le\npont 6 de la figure 5.\nExercice 3\nDonner l’architecture d’un demi-pont reliant deux sous réseaux IEEE 802.3 à travers\nune liaison HDLC.\n87",
        "metadata": {
            "topic": "file1",
            "subtopic": "V.5 Exercices"
        }
    },
    {
        "text": "Les protocoles TCP/IP sont issus de travaux lancés par le département de défense\naméricain (DoD : \"Departement of Defense\"/ DARPA : \"Defense Advanced Research\nProjects Agency\") en 1972. L'objectif étant de faire interconnecter une variété de\nréseaux existants. TCP/IP est officiellement retenu par le DoD en 1978 et généralisé\ndans ARPANET en 1983. En août 1983 l'Internet comportait 562 machines, en\nfévrier 1985 ce nombre passe à 2308 et en novembre de la même année il est de 5089.\nL'un des premiers systèmes d'exploitation (en 1983) ayant disposé des protocoles\nTCP/IP est UNIX BSD qui, par son succès, a favorisé l'utilisation de ces protocoles\ndans les universités et dans les centres de recherche. Ceci a donné lieu au plus grand\nréseau informatique mondial INTERNET qui est formé d'un ensemble de sous-\nréseaux TCP/IP individuels. En mars 1989, Tim Berners-Lee, du CERN, propose\nl'idée du World Wide Web. Les années 1990 ont vu l'Internet grossir à une vitesse\nexponentielle sous l'impulsion du Web. En 1993, on comptait 600 sites, en 1995 plus\nde 15000, le WWW devient le service le plus important sur Internet. Internet est ainsi\ndevenu un réseau ouvert aux entreprises et au grand public. Il connaît un succès\nénorme, d'où l'importance de poursuivre les travaux de normalisation et\nd'amélioration des protocoles utilisés dans ce réseau.\nIssu de l'ICCB (Internet Configuration Control Board) fondé en 1979, le comité IAB\n(\"Internet Activities Board\"), succède en septembre 1984 à l'ICCB. En 1989, l'IAB\ncréé deux structures : l'IETF (Internet Engineering Task Force) et l'IRTF (Internet\nResearch Task Force). L'IAB se charge, en particulier, de l’étude des choix\nstratégiques pour le développement du réseau Internet et de la définition de\n88\nl’architecture générale de ce réseau. L'IRTF fonctionne plutôt comme une structure\ninternationale de coordination des efforts de recherche à travers le monde. L'IRTF se\nconcentre sur des expérimentations non exploitables à court terme. Les résultats\nobtenus par l'IRTF servent de base pour des travaux approfondis d'ingénierie et de\nnormalisation menés par l'IETF. Après la création de l'ISOC (The Internet Society) au\nmois de janvier 1992, l'IAB s'est placé sous cette nouvelle instance de l'Internet. Cette\ndécision va entraîner un nouveau changement de nom, l'IAB signifiant désormais\nInternet Architecture Board. Les propositions d'ajout, de modification, ou de\nnormalisation sont produites sous forme de rapports techniques appelés RFC\n(\"Request For Comments\"). Les RFC sont rédigées sur l'initiative d'experts\ntechniques, puis sont revues par la communauté Internet.\nUne RFC passe généralement un long processus de révision avant sa publication. Les\npublications RFC se divisent en deux grandes catégories : standard et non standard.\nUne RFC est caractérisée par un niveau de maturité ou \"state\" qui traduit la position\ndans le chemin de standardisation :\n- Standard : \"Proposed\", \"Draft\" (test), \"Standard\"\n- Non standards : \"Experimental\" (en cas d'échec d'un test), \"Informational\",\n\"Historic\".\nUn RFC est aussi caractérisé par un rang ou \"status\" qui traduit l'importance du\nstandard : \"required\", \"recommended\", \"elective\" (option), limited, \"not\nrecommended\".\nLes proportions des protocoles selon le state et le status sont décrites comme suit:\nST A T U S\nReq Rec Ele Lim Not\n+-----+-----+-----+-----+-----+\nStd | X | XXX | XXX | | |\nS +-----+-----+-----+-----+-----+\nDraft | X | X | XXX | | |\nT +-----+-----+-----+-----+-----+\nProp | | X | XXX | | |\nA +-----+-----+-----+-----+-----+\nInfo | | | | | |\nT +-----+-----+-----+-----+-----+\nExpr | | | | XXX | |\nE +-----+-----+-----+-----+-----+\nHist | | | | | XXX |\n+-----+-----+-----+-----+-----+\nLes RFC sont maintenues par le NIC \"Network Information Center\". L’ISO a produit\nune normalisation de l’IP : ISO8473. Par ailleurs une nouvelle version 6 de l’IP est\n89\nproduite afin de palier à certains problèmes liés à la version 4 de l’IP : épuisement des\nadresses, explosion des tables de routage, absence de types de données, variabilité des\ndélais d’acheminement. Actuellement la version 4 tient une place dominante sur le\nmarché informatique et nous nous limitons dans ce chapitre à cette version.",
        "metadata": {
            "topic": "VVII.. LLeess rréésseeaauuxx ssoouuss TTCCPP//IIPP",
            "subtopic": "VVII.. LLeess rréésseeaauuxx ssoouuss TTCCPP//IIPP"
        }
    },
    {
        "text": "Les protocoles TCP/IP s'insèrent dans une architecture en couches (figure 1).\nTelnet FTP SMTP …\nTCP UDP\nIP ICMP ARP RARP",
        "metadata": {
            "topic": "file1",
            "subtopic": "VI.1 Architecture des protocoles"
        }
    },
    {
        "text": "LAPB LAN SLIP\n(\"Serial Line Internet Protocol\")\nPPP\n(\"Point to Point Protocol\")\nFigure 1 : Architecture TCP/IP\nTCP (\"Transmission Control Protocol\") : protocole de transport fourni un service\nfiable avec connexion.\nUDP (\"User Datagram Protocol\") : protocole de transport fourni un service non fiable\nsans connexion.\nIP (\"Internet Protocol\") : protocole de niveau réseau assurant un service non fiable et\nsans connexion. Le transfert des paquets s’effectue en mode datagramme. A ce niveau\nest défini l'adressage IP. Ce protocole assure le routage, la fragmentation des unités\nde données ainsi qu'un contrôle de flux rudimentaire.\nICMP (\"Internet Control Message Protocol\") : protocoles d'échange de message de\ncontrôle pour signaler des anomalies de fonctionnement (exemple : machine\ndéconnectée, durée de vie d'un datagramme expiré, congestion d'une passerelle).\nARP (\"Address Resolution Protocol\") / RARP (\"Reverse ARP\") : protocoles de\nrésolution d'adresses permettant de faire la correspondance entre les adresses logique\nIP et les adresses physique MAC. Le protocole ARP permet de déduire l'adresse\nMAC à partir de l'adresse IP. Le protocole RARP effectue l'opération inverse. Ceci\nest utile lors du démarrage d'une machine qui ne connaît pas son adresse IP mais\nconnaît l'adresse MAC.",
        "metadata": {
            "topic": "file1",
            "subtopic": "X25"
        }
    },
    {
        "text": "Le protocole IP définit l'adressage, le format des datagrammes, la fragmentation des\ndonnées et le routage.\n90",
        "metadata": {
            "topic": "file1",
            "subtopic": "VI.2 Le protocole IP (RFC 791)"
        }
    },
    {
        "text": "Une adresse IP permet de désigner de manière unique une machine. Elle est codée sur\n32 bits et se divise en deux parties : le numéro du réseau (net_id) suivi du numéro de\nla machine (host_id). Un organisme international le NIC (Network Information\nCenter) attribue les numéros de réseaux. Chaque pays a un organisme, dépendant du\nNIC, chargé d’attribuer les adresses IP. Le numéro de machine est attribué par\nl'administrateur du réseau. L’IANA « Internet Address Network Authority » est\nl’autorité au niveau mondial qui distribue des espaces de numéros de réseau au NIC\n« Network Information Center », à RIPE « Réseaux IP Européens » ... Quatre classes\nd'adresses sont définies, chacune code un nombre différent de réseaux et de machines:\n- classe A : 1 bit = 0 ; net_id = 7 bits ; host_id = 24 bits.\nUtilisée pour des réseaux de tailles importantes (exemple : Arpanet). Dans cette\nclasse peuvent exister 126 réseaux, chaque réseau peut comporter plus de 16\nmillions de machines. Actuellement il n'est plus possible d'obtenir des adresses de\ncette classe.\n- classe B : 2 bits = 10 ; net_id = 14 bits ; host_id = 16 bits.\nUtilisée pour des réseaux d'industriels, de centres de recherche ou d'université.\nDans cette classe peuvent exister plus de 16000 réseaux, chaque réseau peut\ncomporter plus de 64 milles machines. Pour cette classe aussi, on a constaté que les\nadresses sont sous utilisées. C’est pourquoi, il est de plus en plus difficile d'obtenir\nune adresse de cette classe.\n- classe C : 3 bits = 110 ; net_id = 21 bits ; host_id = 8 bits\nUtilisée pour les réseaux comportant peux de machines. Dans cette classe peuvent\nexister plus de 2 millions de réseaux, chaque réseau peut comporter au plus 254\nmachines. Si un site comporte plus de 254 machines et qu'une adresse de classe B\nsera sous utilisée, le NIC attribue plusieurs adresses de classe C au même site (ce\nqui complique le routage).\n- classe D : 4 bits = 1110 ; host_id = 28 bits\nUtilisée pour désigner une adresse de groupe (\"multicast\").\nUne adresse Internet est référencée par une suite de 4 entiers séparés par des points :\n- classe A : [1..127].[0..255].[0..255].[0..255],\n- classe B : [128..191].[0..255].[0..255].[0..255],\n- classe C : [192..223].[0..255].[0..255].[0..255],\n- classe D : [224..239].[0..255].[0..255].[0..255].\nIl est à noter que certaines adresses sont réservées pour un usage particulier :\n- un paquet émis vers une adresse, dont le net_id est égale à 127, revient à\nl'émetteur sans passer par le réseau (boucle locale ou \"loopback\"),\n- une adresse dont le net_id est égale à 0 désigne le réseau courant,\n91\n- une adresse dont tous les bits de host_id sont à 1 est une adresse de diffusion,\n- une adresse dont tous les bits de host_id sont à 0 et les bits du net_id non nuls est\nune adresse de sous-réseau,\n- 0.0.0.0 Signifie \"celui-ci\". C'est à dire \"cette machine\". Elle est utilisée par\nexemple par une machine sans disque qui ignore son adresse au moment du boot.\n- Adresses des réseaux privés réservés :\nClasse Masque Plages d’adresses réservés\nA 255.0.0.0 10.0.0.0 - 10.255.255.255\nB 255.255.0.0 172.16.0.0 - 172.31.255.255\nC 255.255.255.0 192.168.0.0 - 192.168.255.255\nRemarquons que, contrairement à l'adressage ISO, la longueur d'une adresse IP est\nfixe. D'autre part, le host_id peut être divisé en deux parties : une adresse pour\ndésigner un sous-réseau et une adresse de machine. Les bits de chacune de ces parties\nne sont pas forcément contigus, mais la plus part des systèmes l’exigent. Pour\ndéterminer l'adresse d'un sous-réseau on utilise un masque (\"netmask\") dont la taille\nest de 32 bits et où les bits à 1 désignent ceux du réseau et du sous-réseau. Le masque\nde sous-réseau doit être identique pour tous les sous-réseaux dérivés d’un même\nnuméro de réseau. De plus les sous-réseaux doivent être physiquement séparés par\ndes routeurs.\nExemples :\n- Une société dispose de 4000 stations auxquelles sont attribuées 16 adresses de\nréseau classe C : de 192.24.16.0 à 192.24.31.0. La valeur du netmask est alors\n255.255.240.0 (à 1 tous les bits qui ne changent pas entre les adresses\nattribués). Il suffira alors à un routeur d’effectuer un ET logique (bit à bit) entre\nune adresse et le netmask pour déterminer si cette adresse est celle d’une station\nde la société.\n- L’ENSI lui attribuée l’adresse réseau 193.95.17.0, désire diviser son réseau\nlocal en 4 sous-réseaux. Une valeur du netmask est alors 255.255.255.192.",
        "metadata": {
            "topic": "file1",
            "subtopic": "VI.3 Adressage (RFC990)"
        }
    },
    {
        "text": "Le format d’un paquet IP est décrit par la figure 2.\n92\n0 4 8 16 31\nvers. =4 lg. entête type de service lg. totale du datagramme\nidentif. Commun aux fragments drapeau déplacement fragment\ndurée de vie protocole checksum\nadresse source\nadresse destination\noptions\nbourrage\ndonnées\nFigure 2 : format d’un paquet IP\n- Version (4 bits) : indique le format de l'entête. Le format décrit est celui de la\nversion 4.\n- Longueur de l'entête (4 bits) : en nombre de mots de 32 bits. Des bits de\nbourrage sont rajoutés à l'entête pour que sa longueur soit multiple de 32.\n- Type de service (8 bits) : ce champ est utile pour le routage. Il indique la qualité\nde service requise (RFC1349).\n Bits 0-2 : priorité,\n Bit 3 : s'il est à 1 les routeurs doivent minimiser le délai de transmission (ex.\néviter les liaisons satellite),\n Bit 4 : s'il est à 1 les routeurs doivent maximiser le débit,\n Bit 5 : s'il est à 1 les routeurs doivent suivre un chemin fiable,\n Bit 6 : s'il est à 1 les routeurs doivent minimiser les coûts,\n Bit 7 à 0.\n- Longueur totale du datagramme (16 bits) : exprimé en octets (<65535).\n- Identificateur commun aux fragments (16 bits) : tous les fragments d'un même\ndatagramme portent un même numéro.\n- Drapeau (3 bits) : le premier bit est toujours à 0. Le deuxième bit indique, s'il\nest à 0, que le datagramme peut être fragmenté par un routeur. Le troisième bit\nindique s'il est à 0 que c'est le dernier fragment d'un datagramme, par défaut la\nvaleur est 000.\n- Déplacement fragment (13 bits) : indique la position du premier octet d'un\nfragment dans le datagramme initial avant fragmentation. Ce déplacement\ns'exprime en multiple de 8 octets.\n- Durée de vie (8 bits) : indique le temps maximum pendant lequel le\ndatagramme peut rester dans le réseau. A la valeur 0 le datagramme est détruit.\n93\nChaque routeur par lequel passe un datagramme réduit la durée de vie, d'une\nunité ou plus, proportionnellement à la durée passée dans le routeur.\n- Protocole : indique le protocole suivant dont le paquet se trouve dans la partie\ndonnée (ip : 0, icmp : 1, tcp : 6, udp : 17, voir RFC 1340).\n- checksum (16 bits) : le checksum est la somme en complément à 1 des mots de\n16 bits de l'en-tête. Il est recalculé par chaque routeur puisque le champ durée\nvie est modifié.\n- Adresses source, destination : tel que décrit dans la section précédente.\n- option (longueur variable), ce champ est utile pour :\n gérer des problèmes de sécurité et de confidentialité,\n fournir aux routeurs des informations de routage par exemple un chemin\ndésigné par une suite d'adresses,\n connaître le chemin suivi par un datagramme,\n- bourrage pour que l’entête soit multiple de 32 bits.",
        "metadata": {
            "topic": "file1",
            "subtopic": "VI.4 Format d'un datagramme IP (RFC 791)"
        }
    },
    {
        "text": "Un réseau INTERNET résulte de l'interconnexion de plusieurs réseaux par des\npasserelles appelées routeurs. On distingue deux niveaux de routage : le routage à\nl'intérieur d'un même réseau et le routage entre les passerelles de l'INTERNET\n(routeur). Il est à noter qu'à chaque passage par un réseau, un datagramme est\nencapsulé dans un paquet conformément aux protocoles du réseau.\nDans ce qui suit nous nous intéressons au routage entre passerelles IP. Différents\ndomaines de routage (AS : \"autonomous systems\") peuvent exister, chacun ayant ses\npropres protocoles de routage interne et externe :\n- le routage interne concerne les paquets relatifs à des communications à l’intérieur\nd’un même domaine AS (IGP : \"Interior Gateway Protocol\"). Un domaine peut\nêtre aussi subdiviser en sous-domaines (exemple un LAN);\n- le routage externe pour les communications entre différents domaines AS.\nLe routage RIP (RFC 1058)\nLe protocole de routage RIP (Routing Information Protocol) est le plus utilisé dans\nl'environnement TCP/IP. C'est un routage distribué basé sur l'échange d'informations\nentre routeurs adjacents (toutes les 30 secondes). Chaque routeur a une connaissance\npartielle sur l'état du réseau qui est limitée aux voisins (algorithme de type \"distant\nvector\"). RIP est un protocole IGP prévu pour être utilisé sur des réseaux de petites\ntailles. Une route ne doit pas dépasser 15 nœuds intermédiaires. RIP utilise le\nprotocole UDP pour encapsulé ses données (port 520). Plusieurs améliorations du\nRIP ont été proposées (exemples : RIP-2, IGRP \"Interiror Gateway Routing\nProtocol\").\n94\nLe routage OSPF (RFC 1247)\nLe protocole de routage OSPF (Open Shortest Path First) est plus complexe que le\nroutage RIP mais il est adapté aux réseaux de grandes tailles. OSPF est aussi un\nprotocole IGP. Contrairement au RIP, chaque routeur a une connaissance complète\nsur l'état des liens du réseau (algorithme de type \"link state\"). Ceci permet notamment\nde résoudre les problèmes de boucles. OSPF utilise le protocole IP pour encapsuler\nses données (avec le protocole numéro 89).\nD'autres protocoles de routages externes sont utilisés : EGP (\"Exterior Gateway\nProtocol\"), BGP (\"Border Gateway Protocol\") et CIDR (\"Classless Internet Domain\nRouting\"). Ce dernier a été développé en tenant compte qu'une même entreprise\npouvait avoir plusieurs adresse de classe C.",
        "metadata": {
            "topic": "file1",
            "subtopic": "VI.5 Le routage IP"
        }
    },
    {
        "text": "Le protocole ICMP (\"Internet Control Message Protocol\") permet de rendre compte\nde certaines anomalies de fonctionnement. Les messages ICMP sont encapsulés dans\ndes paquets IP (type = 0, protocole = 1) et peuvent êtres issus de routeurs comme de\nstations. Un message ICMP est soit une demande d'information soit une indication\nd'erreur. Il comporte en particulier au niveau des deux premiers octets un champ type\net un champ code. Des exemples de messages ICMP sont illustrés dans ce qui suit.\n- message pour indiquer qu'un paquet ne peut pas atteindre sa destination\n(type = 3). Les raisons peuvent être diverses : un routeur ne sait pas par où émettre\nle paquet (code = 0), le destinataire ne peut pas être atteint bien que le réseau le\nreconnaisse (code = 1), le destinataire ne prend pas en compte le protocole\n(code = 2), la fragmentation est nécessaire alors qu'elle est interdite (code = 3), le\nport transport est inaccessible (code = 4), la route proposée n'est pas valable\n(code = 5).\n- message pour indiquer que la durée de vie d'un paquet a expiré (type = 11).\nL'expiration a lieu soit durant le transit (code = 0), soit durant le réassemblage\n(code = 1).\n- message pour indiquer à l’émetteur de réduire sa vitesse d'émission. Ce message\npeut être émis par le destinataire ou un routeur intermédiaire. Suite à cette\nréduction l’émetteur peut augmenter progressivement sa vitesse (type = 4, code =\n0).\n- message d’écho pour tester l'accessibilité d'une station sur le réseau (type = 8,\ncode = 0). En réponse un autre message ICMP est envoyé (type = 0, code = 0).\n95",
        "metadata": {
            "topic": "file1",
            "subtopic": "VI.6 Le protocole ICMP (RFC 792)"
        }
    },
    {
        "text": "Permet de retrouver une adresse MAC à partir d'une adresse IP. Pour cela, chaque\nmachine maintient une table de correspondance entre ces adresses. Si une adresse IP\nne figure pas dans cette table, une requête ARP contenant cette adresse est diffusée.\nLe nœud correspondant à cette adresse répond en fournissant l'adresse MAC. Une\nentrée de cette table est éliminée au bout d’un certain délai si aucun trafic n’est\nobservé à partir de la station correspondante. Le protocole RARP (\"Reverse ARP\")\npermet de déduire l’adresse IP à partir de l’adresse MAC. Ce protocole est utile pour\nles stations sans disque qui, au moment de l’amorçage, ne connaissent pas leurs\nadresses IP. A cet effet une requête RARP est diffusée et est traitée par un serveur\nbien déterminé.",
        "metadata": {
            "topic": "file1",
            "subtopic": "VI.7 Le protocole ARP (\"Address Resolution Protocol\", RFC 826)"
        }
    },
    {
        "text": "",
        "metadata": {
            "topic": "file1",
            "subtopic": "VI.8 Les protocoles du niveau transport"
        }
    },
    {
        "text": "Une fois qu'un paquet arrive au nœud destinataire, il faut délivrer les données de ce\npaquet à une application particulière. A cet effet est utilisé un numéro de port. Le\nRFC 1340 donne la liste des numéros de ports attribués aux applications connues\n(smtp:25, ftp:21, telnet:23, ...). Ces numéros sont compris entre 0 et 1023. Les\nnuméros supérieurs ou égale à 1024 peuvent être attribués aux applications\nutilisateurs.",
        "metadata": {
            "topic": "VI.8 Les protocoles du niveau transport",
            "subtopic": "VI.8.1 Les ports"
        }
    },
    {
        "text": "Comparé à IP, UDP n'apporte pas de fonctionnalités supplémentaires à part\nl'utilisation des ports. Dans un paquet IP, le champ protocole est égal à 17. Le format\nd'un message UDP est décrit par la figure 3.\nport source (2 octets)\nport destination (2 octets)\nlongueur (2 octets)\nchecksum (2 octets) sur l’entête, s’il est à 0, il n'est pas utilisé\ndonnées\nFigure 3 : format d’une unité UDP",
        "metadata": {
            "topic": "VI.8 Les protocoles du niveau transport",
            "subtopic": "VI.8.2 Le protocole UDP (RFC 768)"
        }
    },
    {
        "text": "Ce protocole offre une transmission duplex fiable en mode connecté. Les segments\nsont délivrés dans l'ordre d'émission. Un mécanisme de contrôle de flux par fenêtre\nest utilisé. Le contrôle de flux est opéré sur un flot d’octets :\n une numérotation par rapport aux octets est opérée ;\n96\n un acquittement spécifie le numéro d’octet attendu, les précédents sont donc\nacquittés ;\n la taille de la fenêtre de réception peut varier dans le temps ;\n les acquittements sont positifs et la retransmission est déclenchée suite à\nl’expiration d’un temporisateur. La valeur de ce temporisateur est\ndynamique, elle se calcule en fonction de certaines statistiques (le temps\nd’aller et de retour) ;\n les messages sont découpés en segments.\nIl est aussi possible d'attribuer une priorité aux messages. Dans un paquet IP, le\nchamp protocole est égal à 6. Le format d'un segment TCP est décrit par la figure 4.\nLa figure 5 illustre un exemple d’invocation des primitives TCP pour l’établissement\nd’une connexion, l’échange de données et la libération de la connexion.\nport source (2 octets) port destination (2 octets)\nnuméro de séquence SEQ (4 octets), initialisé à partir d'une horloge\nacquittement (4 octets), contient le numéro de séquence du prochain octet attendu\n-déplacement (4 bits), indique la taille de l'entête en mots de 32 bits\n-6 bits réservés à un usage ultérieur\n-6 bits (URG : urgent, ACK : le champ acquittement est significatif, PSH : transmission\nimmédiate, RST : réinitialisation d'une connexion, SYN : initialisation d'une connexion,\nFIN : fin d'une connexion)\n-fenêtre (2 octets), nombre d'octets que le récepteur peut accepter (à partir du numéro de\nséquence acquitté)\n-checksum (2 octets), de l’entête\n-pointeur message urgent (2 octets), lorsque URG est à 1 ce champ indique le numéro de\nséquence du dernier octet d'une séquence d'octet qu’il faut délivrer au plutôt à la couche de\nniveau supérieur.\noption + bourrage, permet par exemple de définir la taille maximale d'un flot\ndonnées.\nFigure 4 : Format d’un segment TCP\n97\nCLIENT SERVEUR\nPassiveOpen\nOpenId\nActiveOpen\nOpenId SYN 100\nSYN 321 ACK 101\nOpenSuccess\nACK 322\nOpenSuccess\nSend (4 octets)\nSend (4 octets)\nSend (10 octets)\nSend (4 octets)\nSend (4 octets), PSH\nSEQ 101\nDeliver, URG\nSEQ 322 ACK 117\nDeliver\nSend (1 octets)\nACK 332\nClose\nFIN 117\nClosing\nSEQ 332 ACK 118\nDeliver Close\nFIN 333\nTerminate\nACK 334\nTerminate\nFigure 5 : exemple d’invocation de primitives TCP",
        "metadata": {
            "topic": "VI.8 Les protocoles du niveau transport",
            "subtopic": "VI.8.3 Le protocole TCP (RFC 793)"
        }
    },
    {
        "text": "A une machine est associé un nom symbolique absolu :\nnom_machine.domaine\nles domaines (zones) sont structurés de façon hiérarchique en plusieurs sous\ndomaines comme le montre la figure 6. Un sous-domaine peut comporter plusieurs\nsous-domaines. Les feuilles de l’arbre correspondent aux noms de machines. Dans la\nfigure 6, seule la machine rs6serv est représentée « rs6serv.ensi.rnrt.tn ».\nLa correspondance entre les noms et les adresses IP est maintenue par le système\nUNIX dans le fichier /etc/hosts. La mise à jour de ce fichier sur toutes les machines, à\n98\nchaque fois qu’une nouvelle machine se rajoute, est impossible. Un service distribué\nde noms pour toutes les machines a été conçu : le DNS (« Domain Name Service »).\nLe DNS permet la traduction de noms en adresses et vice-versa. A cet effet le DNS\nutilise des serveurs de noms. Un serveur de noms gère éventuellement un ou plusieurs\ndomaines / sous-domaines. Pour palier au problème d’indisponibilité d’un serveur de\nnoms (primaire), des serveurs de noms secondaires peuvent être mis en place. Sans\npouvoir modifier les données, un serveur secondaire est capable de traiter les\ndemandes de résolution adressées au serveur primaire.\n.\ncom edu fr gov ... mil org tn\nconvex ... ibm nyu ... ucla bnp ... irisa nasa ... af .... ieee ... rnrt ati\nensi esptt\nrs6serv .........\nFigure 6 : hiérarchie des domaines",
        "metadata": {
            "topic": "file1",
            "subtopic": "VI.9 Le service DNS"
        }
    },
    {
        "text": "Les sockets ont été introduites dans UNIX BSD (Berkeley, 1983) afin d’offrir un\nmécanisme général de communication inter-processus sur un même système ou sur\ndes systèmes distincts. Les sockets constituent une interface pour la programmation\nréseau (figure 7).\n99\nProcessus serveur\nProcessus client\nCouche socket\nCouche socket\nProtocole TCP/IP\nProtocole TCP/IP\nPilote de la carte réseau\nPilote de la carte réseau\nRéseau\nFigure 7 : le niveau sockets\nA l’intérieur d’un programme, une socket est identifiée par un descripteur permettant\nde spécifier un point de communication par lequel un processus peut émettre ou\nrecevoir des informations. Le format de ce descripteur diffère selon le domaine de\ncommunication. Différents domaines sont définis :\n domaine AF_UNIX, utile lorsque la communication se fait entre processus\nsur une même machine. Une socket est identifiée par une chaîne de\ncaractères ;\n domaine AF_INET, utile lorsque la communication se fait entre processus\nsur des machines reliées par un réseau internet. Une socket est identifiée\npar : un numéro de port et une adresse IP.\n autres domaines : AF_NS (XEROX), AF_CCITT (X25), AF_SNA ...\nA une socket est associé un type définissant les propriétés de communication :\n type SOCK_DGRAM, il correspond à un service datagramme (utilisant\nUDP),\n type SOCK_STREAM, il correspond à un service circuit virtuel (utilisant\nTCP),\n type SOCK_ROW, un telle socket permet l’accès aux protocoles de plus bas\nniveau (IP, ICMP, ...), l’usage est réservé aux super-utilisateurs pour\nimplanter de nouveaux protocoles.\nDans ce qui suit, nous décrivons les différentes primitives pour la manipulation des\nsockets à travers un exemple de programmes client / serveur. L’exemple est relatif à\nune communication en mode connecté (SOCK_STRERAM). Nous nous limiterons à\ndes commentaires au niveau du code de ces programmes.\nExemple\n100\n/* Programme serveur : affiche les messages qui proviennent des clients */\n#include <stdio.h>\n#include <sys/socket.h>\n#include <sys/types.h>\n#include <netinet/in.h>\n#include <netdb.h>\nvoid main()\n{\nint sock_ecoute, sock_dial ; /* sock_ecoute est utilisée par le processus père pour l'écoute des demandes\nde\nconnexions, sock_dial est utilisée par un fils pour communiquer avec un client\n*/\nchar tampon[256] ; /* pour stocker un message reçu */\nstruct sockaddr_in adr_serv ; /* adresse socket serveur */\nint lg_adr_serv; /* longueur de l'adresse de la socket serveur */\nchar nom_serv[30]; /* nom du serveur */\nstruct hostent *num_ip_serv; /* pointeur sur une structure donnant le nom, l'adresse IP, etc, du serveur */\nstruct sockaddr_in adr_client ; /* adresse socket distante */\nint lg_adr_client; /* longueur de l'adresse de la socket client */\n/* création de la socket d'écoute */\nsock_ecoute = socket(AF_INET, SOCK_STREAM,0) ;\n/* la socket est attachée à une adresse IP et un numéro de port\n(IPPORT_USERRESERVED, ne nécessite pas un mode privilégié) */\nbzero((char *)&adr_serv, sizeof(adr_serv)) ;\nadr_serv.sin_port = IPPORT_USERRESERVED ;\nadr_serv.sin_addr.s_addr = INADDR_ANY; /*pour accepter une adresse quelconque (0.0.0.0) */\n/* autre solution pour obtenir l'adresse IP de la machine locale : */\ngethostname(nom_serv, (size_t) 30);\nprintf(\"nom du serveur %s \\n\", nom_serv);\nif ((num_ip_serv=gethostbyname(nom_serv))==NULL)\n{ printf(\" échec dans l'obtention de l'adresse IP du serveur \\n\");\nexit();\n}\nelse\n{ bcopy(num_ip_serv->h_addr,&adr_serv.sin_addr,num_ip_serv->h_length);} /* fin solution */\nadr_serv.sin_family =AF_INET ;\nbind (sock_ecoute, (struct sockaddr*)&adr_serv, sizeof(adr_serv)) ; /* attachement de la socket */\n101\n/* ouverture du service : création d'une file d'attente pour les demandes de connexion d'une longueur max.\négale à 5*/\nlisten(sock_ecoute,5) ;\nfor (;;)/* boucle infinie traitant les differentes des clients */\n{\n/* attente d'une demande de connexion */\nlg_adr_client = sizeof(adr_client) ;\nsock_dial=accept(sock_ecoute, (struct sockaddr *)&adr_client, &lg_adr_client) ;\n/* création d'un processus fil */\nif (fork() ==0)\n{ /* fils */\nclose(sock_ecoute) ;\n/* réception d’un message sur la socket au moyen de la primitive read. IL existe une autre primitive de\nréception « recv », celle-ci utilise un paramètre supplémentaire « in t flag » (en dernier param.) permettant de\nconsulter des données sans les prélever (flag=MSG_PEEK), ... */\nread(sock_dial,tampon,sizeof(tampon)) ;\nprintf(\"Le serveur a recu : %s\\n\", tampon) ;\nexit() ;\n}\nclose(sock_dial) ;\n} /* for */\n}/*main*/\n______________________________________________________________________________\n/* Programme client : envoie un message à un serveur */\n#include <stdio.h>\n#include <sys/socket.h>\n#include <sys/types.h>\n#include <netinet/in.h>\n#include <netdb.h>\n#include <string.h>\nmain(int n, char*param[])\n{\nint sock_vers_serv ; /* sock_vers_serv utilisée pour envoyer au serveur un message */\nstruct hostent *num_ip_serv ; /* pointeur sur une structure donnant : nom, @ IP; ... du serveur */\nstruct sockaddr_in adr_serv ; /* adresse socket serveur*/\nint lg_adr_serv; /* longueur de l’adr. la socket serveur*/\n102\nstruct sockaddr_in adr_client ; /* adresse socket distante*/\nint lg_adr_client; /* longueur de l’adresse de la socket client*/\nchar message[256] ;\n/* création de la socket vers le serveur */\nif ((sock_vers_serv = socket(AF_INET, SOCK_STREAM,0))==-1)\n{ printf(\"echec création de la socket vers le serveur\\n\");\nexit() ;\n}\n/* la socket est attachée à une adresse IP et un numéro de port\n(IPPORT_USERRESERVED+1) */\nbzero((char *)&adr_client, sizeof(adr_serv)) ;\nadr_client.sin_port = IPPORT_USERRESERVED+1 ;\nadr_client.sin_addr.s_addr = INADDR_ANY ;\nadr_client.sin_family =AF_INET ;\nbind (sock_vers_serv, (struct sockaddr*)&adr_client, sizeof(adr_client)) ;\n/* connexion au serveur*/\nbzero((char *)&adr_serv, sizeof(adr_serv)) ;\nif ((num_ip_serv=gethostbyname(param[1]))==NULL)\n{printf(\" nom de la machine serveur inconnu \\n\");\nexit() ;\n}\nelse\n{bcopy(num_ip_serv->h_addr, &adr_serv.sin_addr,num_ip_serv->h_length) ;\n}\nadr_serv.sin_port = IPPORT_USERRESERVED ;\nadr_serv.sin_family =AF_INET ;\nif (connect (sock_vers_serv, (struct sockaddr*)&adr_serv, sizeof(adr_serv))==-1)\n{\nprintf(\" echec connexion \\n\") ;\nexit() ;\n}\nstrcpy(message,param[2]);\nprintf(\"%d\\n\", sizeof(message));\n/* émission d’un message sur la socket au moyen de la primitive write. IL existe une autre primitive d’émission\n« send », celle-ci utilise un paramètre supplémentaire « in t flag » (en dernier param.) permettant d’envoyer des\ndonnées de façon express (flag=MSG_OOB), ... */\nwrite (sock_vers_serv,message ,sizeof(message) );\n}\n103",
        "metadata": {
            "topic": "file1",
            "subtopic": "VI.10 Les sockets - programmation d’une application client/serveur"
        }
    },
    {
        "text": "L’appel de procédure à distance RPC (« Remote Procedure Call ») consiste à\ntransférer le contrôle du programme à une procédure s’exécutant sur une machine\ndistante. Ceci implique le passage d’arguments et le retour de résultats (comme c’est\nle cas pour un appel de procédure en local). Les machines appelant et appelée peuvent\nreprésenter les données différemment (entier, caractère,...), c’est pourquoi est utilisé\nen général un protocole pour la représentation des données de façon indépendante de\nla machine. Pour les RPC de SUN Microsystems (ONC : « Open Network\nComputing ») ce protocole est appelé XDR (« eXternal Data Representation »). La\nfigure 8 décrit l’empilement des différents protocoles. Cette figure montre comment\ns’insère le système de fichiers distribué NFS (« Network File system »).\nNFS\nXDR\nSOCKET\nRPC\nUDP\nIP\nLLC\nMAC\nPHY\nFigure 8 : empilement des protocoles jusqu'à NFS",
        "metadata": {
            "topic": "file1",
            "subtopic": "VI.11 Appel de procédure à distance"
        }
    },
    {
        "text": "Cette partie est effectuée directement sur des machines UNIX, WINDOWS.",
        "metadata": {
            "topic": "file1",
            "subtopic": "VI.12 Les services de niveau supérieur"
        }
    },
    {
        "text": "Exercice 1\nModifier l’exemple de la section § V.7 afin d’utiliser le mode non connecté\n(SOCK_DGRAM). Pour cela, au niveau du serveur il faudra créer la socket, la\nrattacher et, pour la réception des messages, utiliser la primitive suivante :\nrecvfrom(int s, char * buf, int leng, int flag, (struct sockadd *)&from, int fromlen).\nAu niveau du client, il faudra créer la socket, la rattacher et, pour l’émission des\nmessages, utiliser la primitive suivante :\nsendto(int s, char * buf, int leng, int flag, (struct sockadd *)&to, int tolen).\n104\nExercice 2 : analyse de trames\ntrames à analyser :\n00603E765E4A 0000C0B6DA9D 0806 00-01-08-00-06-04-00-01-00-00-C0-B6-DA-9D-C1-5F-11-43-\n00-00-00-00-00-00-C1-5F-11-01-00-01-63-5B-50-18-7C-00-0C-B7-00-00-2B-4F-4B-20-30-20-6F-32-00-\n00\n00C0DF11EE65 00603E765E4A 0800 45-00-00-6A-53-22-40-00-EE-06-B0-96-82-E1-33-1E-C1-5F-11-\n76-00-15-04-23-7F-AA-41-06-69-D9-B3-84-50-18-22-38-E6-57-00-00-32-35-30-20-22-2F-6D-69-72-72-\n6F-72-73-2F-6C-69-71-75-6F-72-2E-63-61-62-69-2E-6E-65-74-2F-68-6F-6D-65-2F-6D-69-72-72-6F-72-\n2F-4A-44-4B-2D-31-2E-31-2E-33-22-20-69-73-20-6E-65-77-20-63-77-64-2E-0D-0A-74-75-65-2B\nFFFFFFFFFFFF 00603E765E48 0800 45-00-00-35-00-00-00-00-FF-11-E8-D7-C1-5F-11-81-FF-FF-FF-\nFF-18-49-00-45-00-21-00-00-00-01-65-6E-73-69-72-6F-75-74-65-72-2D-63-6F-6E-66-67-00-6F-63-74-\n65-74-00-00-00-00-00\nFFFFFFFFFFFF 0020AF5C0A13 0800 45-00-00-E8-BD-00-00-00-20-11-36-F9-C1-5F-11-4E-C1-5F-11-\nFF-00-8A-00-8A-00-D4-7D-6B-11-02-00-2F-C1-5F-11-4E-00-8A-00-BE-00-00-20-46-41-45-44-45-4B-\n43-41-43-41-43-41-43-41-43-41-43-41-43-41-43-41-43-41-43-41-43-41-43-41-41-41-00-20-41-42-41-\n43-46-50-46-50-45-4E-46-44-45-43-46-43-45-50-46-48-46-44-45-46-46-50-46-50-41-43-41-42-00-FF-\n53-4D-42-25-00-00-00-00-00-00-00-00-00-00-00-00-00-00-00-00-00-00-00-00-00-00-00-00-00-00-00-\n11-00-00-24-00-00-00-00-00-00-00-00-00-00-00-00-00-00-00-00-00-00-00-24-00-56-00-03-00-01-00-\n01-00-02-00-35-00-5C-4D-41-49-4C-53-4C-4F-54-5C-42-52-4F-57-53-45-00-0C-00-C0-27-09-00-57-\n4F-52-4B-47-52-4F-55-53-00-00-00-00-00-00-00-00-00-00-00-00-80-00-00-00-00-50-43-4A-00-39-36-\n20-62\n00C0DF11EE65 00603E765E48 0138 AA-AA-03-00-00-0C-20-00-01-B4-08-65-00-01-00-0E-65-6E-73-\n69-72-6F-75-74-65-72-00-02-00-27-00-00-00-02-01-01-CC-00-04-C1-5F-11-81-02-08-AA-AA-03-00-\n00-00-81-37-00-0A-00-00-00-01-00-60-3E-76-5E-48-00-03-00-0D-45-74-68-65-72-6E-65-74-30-00-04-\n00-08-00-00-00-01-00-05-00-D4-43-69-73-63-6F-20-49-6E-74-65-72-6E-65-74-77-6F-72-6B-20-4F-70-\n65-72-61-74-69-6E-67-20-53-79-73-74-65-6D-20-53-6F-66-74-77-61-72-65-20-0A-49-4F-53-20-28-74-\n6D-29-20-33-30-30-30-20-53-6F-66-74-77-61-72-65-20-28-49-47-53-2D-49-4E-2D-4C-29-2C-20-56-65-\n72-73-69-6F-6E-20-31-31-2E-30-28-39-29-2C-20-52-45-4C-45-41-53-45-20-53-4F-46-54-57-41-52-45-\n20-28-66-63-31-29-0A-43-6F-70-79-72-69-67-68-74-20-28-63-29-20-31-39-38-36-2D-31-39-39-36-20-\n62-79-20-63-69-73-63-6F-20-53-79-73-74-65-6D-73-2C-20-49-6E-63-2E-0A-43-6F-6D-70-69-6C-65-\n64-20-54-75-65-20-31-31-2D-4A-75-6E-2D-39-36-20-30-31-3A-31-35-20-62-79-20-6C-6F-72-65-69-\n6C-6C-79-00-06-00-0E-63-69-73-63-6F-20-32-35-30-30-00-00-00-00\n00603E765E4A 0000C02DDB9D 0800 45-00-00-28-33-65-40-00-40-06-A0-39-C1-5F-11-42-CC-47-C8-\n48-79-4A-00-50-02-F2-2D-AB-A2-96-4D-6A-50-10-7C-00-32-6A-00-00-47-45-54-20-2F-69-2D-67-F2-\n72\n105\nCorrespondance entre les LLC SAP et les noms\n00 Management\n02 Individual LLC sublayer management\n06 Internet IP\n42 IEEE 802.1d Spanning tree\nAA TCP/IP SNAP (Ethernet type in LLC)\nE0 Novell IPX\nF0 IBM NetBIOS\nFF Broadcast\nCorrespondance entre les numéros de protocole IP (en décimal) et les noms de protocoles\n0 reserved\n1 icmp, internet control message\n2 igmp, internet group management\n6 tcp\n8 egp, exterior gateway protocol\n9 igp, any interior gateway protocol\n17 udp\n29 iso-tp4\n80 iso-ip\nTypes de trames Ethernet (en hexadécimal)\n0800 DOD IP\n0803 ECMA internet\n0805 X.25 Level 3\n0806 ARP\n8137 Novell NetWare\nCorrespondance entre les 3 premiers octets d’une adresse MAC (en hexadécimal) et le nom du vendeur\n00-00-C0 SMC\n00-60-3E Cisco\n00-C0-DF Kye Systems Corp\n08-00-69 Silicon Graphics\n08-00-6E Excelan\n00-20-AF 3Com\nCorrespondance entre les numéros de ports (en décimal) et les noms de service\n13 daytime\n53 domain\n7 echo\n69 tftp\n79 finger\n21 ftp\n20 ftp-data\n101 hostnames\n25 smtp (mail)\n23 telnet\n79 finger\n80 www\n138 netbios-dg\nQuestions :\n1. Quels sont les constructeurs des différentes cartes sur le réseau ?\n2. Indiquer les différents empilements de protocoles que l’on observe à travers ces\ntrames.\n106",
        "metadata": {
            "topic": "file1",
            "subtopic": "VI.13 Exercices"
        }
    },
    {
        "text": " I. Custer, « Au cœur de windows NT », Microsoft Press.\n J-L Montagnier, « Pratique des réseaux d’entreprise, du câblage à\nl’administration du réseau local aux réseaux télécom. », Eyrolles.\n R. Perlman, « Interconnection : bridges and routers », Addison-Wesley.\n G. Pujolle, Mschwartz, « Réseaux locaux Informatiques », Eyrolles.\n P. Rolin, « Réseaux locaux, normes et protocoles », Hermes.\n W. Stallings, « Data and computer communications », MacMillan.\n L. Toutain, « Techniques des réseaux locaux sous Unix », Hermes.\n Laurent Toutain « Réseaux locaux et Internet : Des protocoles à\nl'interconnexion », Hermes..\n L. Toutain, « Réseaux locaux et internet : des protocoles à l’interconnexion »,\nHermes.\n « Linux Network Administrator's Guide », O'Reilly Media.\n107\n108",
        "metadata": {
            "topic": "file1",
            "subtopic": "VI.14 Références"
        }
    }
]